{"name":"x","description":"X - a portable,\nnetwork-transparent window system\n\n<h2>OVERVIEW\n<a name=\"OVERVIEW\"></a>\n</h2>\n\n\nThe X Window\nSystem is a network transparent window system which runs on\na wide range of computing and graphics machines. It should\nbe relatively straightforward to build the X.Org Foundation\nsoftware distribution on most ANSI C and POSIX compliant\nsystems. Commercial implementations are also available for a\nwide range of platforms.\n\nThe X.Org\nFoundation requests that the following names be used when\nreferring to this software:\n\n\n<p align=\"center\" style=\"margin-top: 1em\"><img src=\"grohtml-3532631.png\" alt=\"Image grohtml-3532631.png\">\n\n<i>X Window\nSystem</i> is a trademark of The Open Group.\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\nX Window System\nservers run on computers with bitmap displays. The server\ndistributes user input to and accepts output requests from\nvarious client programs through a variety of different\ninterprocess communication channels. Although the most\ncommon case is for the client programs to be running on the\nsame machine as the server, clients can be run transparently\nfrom other machines (including machines with different\narchitectures and operating systems) as well.\n\nX supports\noverlapping hierarchical subwindows and text and graphics\noperations, on both monochrome and color displays. For a\nfull explanation of the functions that are available, see\nthe <i>Xlib - C Language X Interface</i> manual, the <i>X\nWindow System Protocol</i> specification, the <i>X Toolkit\nIntrinsics - C Language Interface</i> manual, and various\ntoolkit documents.\n\nThe number of\nprograms that use <i>X</i> is quite large. Programs provided\nin the core X.Org Foundation distribution include: a\nterminal emulator, <i>xterm</i>; a window manager,\n<i>twm</i>; a display manager, <i>xdm</i>; a console\nredirect program, <i>xconsole</i>; a mail interface,\n<i>xmh</i>; a bitmap editor, <i>bitmap</i>; resource\nlisting/manipulation tools, <i>appres</i>, <i>editres</i>;\naccess control programs, <i>xauth</i>, <i>xhost</i>, and\n<i>iceauth</i>; user preference setting programs,\n<i>xrdb</i>, <i>xcmsdb</i>, <i>xset</i>, <i>xsetroot</i>,\n<i>xstdcmap</i>, and <i>xmodmap</i>; clocks, <i>xclock</i>\nand <i>oclock</i>; a font displayer, <i>xfd</i>; utilities\nfor listing information about fonts, windows, and displays,\n<i>xlsfonts</i>, <i>xwininfo</i>, <i>xlsclients</i>,\n<i>xdpyinfo</i>, <i>xlsatoms</i>, and <i>xprop</i>; screen\nimage manipulation utilities, <i>xwd</i>, <i>xwud</i>, and\n<i>xmag</i>; a performance measurement utility,\n<i>x11perf</i>; a font compiler, <i>bdftopcf</i>; a font\nserver and related utilities, <i>xfs</i>, <i>fsinfo</i>,\n<i>fslsfonts</i>, <i>fstobdf</i>; a display server and\nrelated utilities, <i>Xserver</i>, <i>rgb</i>,\n<i>mkfontdir</i>; a clipboard manager, <i>xclipboard</i>;\nkeyboard description compiler and related utilities,\n<i>xkbcomp</i>, <i>setxkbmap xkbprint</i>, <i>xkbbell</i>,\n<i>xkbevd</i>, <i>xkbvleds</i>, and <i>xkbwatch</i>; a\nutility to terminate clients, <i>xkill</i>; a firewall\nsecurity proxy, <i>xfwp</i>; a proxy manager to control\nthem, <i>proxymngr</i>; a utility to find proxies,\n<i>xfindproxy</i>; web browser plug-ins, <i>libxrx.so</i>\nand <i>libxrxnest.so</i>; an RX MIME-type helper program,\n<i>xrx</i>; and a utility to cause part or all of the screen\nto be redrawn, <i>xrefresh</i>.\n\nMany other\nutilities, window managers, games, toolkits, etc. are\nincluded as user-contributed software in the X.Org\nFoundation distribution, or are available on the Internet.\nSee your site administrator for details.\n\n<h2>STARTING UP\n<a name=\"STARTING UP\"></a>\n</h2>\n\n\nThere are two\nmain ways of getting the X server and an initial set of\nclient applications started. The particular method used\ndepends on what operating system you are running and whether\nor not you use other window systems in addition to X.\n<b><br>\nDisplay Manager</b>\n\n<p style=\"margin-left:23%;\">If you want to always have X\nrunning on your display, your site administrator can set\nyour machine up to use a Display Manager such as <i>xdm</i>,\n<i>gdm</i>, or <i>kdm</i>. This program is typically started\nby the system at boot time and takes care of keeping the\nserver running and getting users logged in. If you are\nrunning one of these display managers, you will normally see\na window on the screen welcoming you to the system and\nasking for your login information. Simply type them in as\nyou would at a normal terminal. If you make a mistake, the\ndisplay manager will display an error message and ask you to\ntry again. After you have successfully logged in, the\ndisplay manager will start up your X environment. The\ndocumentation for the display manager you use can provide\nmore details.\n\n<p style=\"margin-left:11%;\"><i>xinit</i> <b>(run manually\nfrom the shell)</b>\n\n<p style=\"margin-left:23%;\">Sites that support more than\none window system might choose to use the <i>xinit</i>\nprogram for starting X manually. If this is true for your\nmachine, your site administrator will probably have provided\na program named &quot;x11&quot;, &quot;startx&quot;, or\n&quot;xstart&quot; that will do site-specific initialization\n(such as loading convenient default resources, running a\nwindow manager, displaying a clock, and starting several\nterminal emulators) in a nice way. If not, you can build\nsuch a script using the <i>xinit</i> program. This utility\nsimply runs one user-specified program to start the server,\nruns another to start up any desired clients, and then waits\nfor either to finish. Since either or both of the\nuser-specified programs may be a shell script, this gives\nsubstantial flexibility at the expense of a nice interface.\nFor this reason, <i>xinit</i> is not intended for end\nusers.\n\n<h2>DISPLAY NAMES\n<a name=\"DISPLAY NAMES\"></a>\n</h2>\n\n\nFrom the\nuser&rsquo;s perspective, every X server has a <i>display\nname</i> of the form:\n\n\n<p style=\"margin-left:22%; margin-top: 1em\"><i>hostname:displaynumber.screennumber</i>\n\nThis\ninformation is used by the application to determine how it\nshould connect to the server and which screen it should use\nby default (on displays with multiple monitors): <i><br>\nhostname</i>\n\n<p style=\"margin-left:23%;\">The <i>hostname</i> specifies\nthe name of the machine to which the display is physically\nconnected. If the hostname is not given, the most efficient\nway of communicating to a server on the same machine will be\nused.\n\n<p style=\"margin-left:11%;\"><i>displaynumber</i>\n\n<p style=\"margin-left:23%;\">The phrase &quot;display&quot;\nis usually used to refer to a collection of monitors that\nshare a common set of input devices (keyboard, mouse,\ntablet, etc.). Most workstations tend to only have one\ndisplay. Larger, multi-user systems, however, frequently\nhave several displays so that more than one person can be\ndoing graphics work at once. To avoid confusion, each\ndisplay on a machine is assigned a <i>display number</i>\n(beginning at 0) when the X server for that display is\nstarted. The display number must always be given in a\ndisplay name.\n\n<p style=\"margin-left:11%;\"><i>screennumber</i>\n\n<p style=\"margin-left:23%;\">Some displays share their input\ndevices among two or more monitors. These may be configured\nas a single logical screen, which allows windows to move\nacross screens, or as individual screens, each with their\nown set of windows. If configured such that each monitor has\nits own set of windows, each screen is assigned a <i>screen\nnumber</i> (beginning at 0) when the X server for that\ndisplay is started. If the screen number is not given,\nscreen 0 will be used.\n\nOn POSIX\nsystems, the default display name is stored in your DISPLAY\nenvironment variable. This variable is set automatically by\nthe <i>xterm</i> terminal emulator. However, when you log\ninto another machine on a network, you may need to set\nDISPLAY by hand to point to your display. For example,\n\n% setenv\nDISPLAY myws:0 <br>\n$ DISPLAY=myws:0; export DISPLAY\n\nThe <i>ssh</i>\nprogram can be used to start an X program on a remote\nmachine; it automatically sets the DISPLAY variable\ncorrectly.\n\nFinally, most X\nprograms accept a command line option of <b>-display</b>\n<i>displayname</i> to temporarily override the contents of\nDISPLAY. This is most commonly used to pop windows on\nanother person&rsquo;s screen or as part of a &quot;remote\nshell&quot; command to start an xterm pointing back to your\ndisplay. For example,\n\n% xeyes\n-display joesws:0 -geometry 1000x1000+0+0 <br>\n% rsh big xterm -display myws:0 -ls &lt;/dev/null &amp;\n\nX servers\nlisten for connections on a variety of different\ncommunications channels (network byte streams, shared\nmemory, etc.). Since there can be more than one way of\ncontacting a given server, The <i>hostname</i> part of the\ndisplay name is used to determine the type of channel (also\ncalled a transport layer) to be used. X servers generally\nsupport the following types of connections:\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p><i>local</i></td>\n<td width=\"5%\"></td>\n<td width=\"77%\">\n\n\n<p>The hostname part of the display name should be the\nempty string. For example: <i>:0</i>, <i>:1</i>, and\n<i>:0.1</i>. The most efficient local transport will be\nchosen. </td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p><i>TCPIP</i></td>\n<td width=\"5%\"></td>\n<td width=\"77%\">\n\n\n<p>The hostname part of the display name should be the\nserver machine&rsquo;s hostname or IP address. Full Internet\nnames, abbreviated names, IPv4 addresses, and IPv6 addresses\nare all allowed. For example: <i>x.org:0</i>, <i>expo:0</i>,\n<i>[::1]:0</i>, <i>198.112.45.11:0</i>, <i>bigmachine:1</i>,\nand <i>hydra:0.1</i>.</td></tr>\n</table>\n\n<h2>ACCESS CONTROL\n<a name=\"ACCESS CONTROL\"></a>\n</h2>\n\n\nAn X server can\nuse several types of access control. Mechanisms provided in\nRelease 7 are:\n\n\n<p align=\"center\" style=\"margin-top: 1em\"><img src=\"grohtml-3532632.png\" alt=\"Image grohtml-3532632.png\">\n\n<i>Xdm</i>\ninitializes access control for the server and also places\nauthorization information in a file accessible to the\nuser.\n\nNormally, the\nlist of hosts from which connections are always accepted\nshould be empty, so that only clients with are explicitly\nauthorized can connect to the display. When you add entries\nto the host list (with <i>xhost</i>), the server no longer\nperforms any authorization on connections from those\nmachines. Be careful with this.\n\nThe file from\nwhich <i>Xlib</i> extracts authorization data can be\nspecified with the environment variable <b>XAUTHORITY</b>,\nand defaults to the file <b>.Xauthority</b> in the home\ndirectory. <i>Xdm</i> uses <b>$HOME/.Xauthority</b> and will\ncreate it or merge in authorization records if it already\nexists when a user logs in.\n\nIf you use\nseveral machines and share a common home directory across\nall of the machines by means of a network file system, you\nnever really have to worry about authorization files, the\nsystem should work correctly by default. Otherwise, as the\nauthorization files are machine-independent, you can simply\ncopy the files to share them. To manage authorization files,\nuse <i>xauth</i>. This program allows you to extract records\nand insert them into other files. Using this, you can send\nauthorization to remote machines when you login, if the\nremote machine does not share a common home directory with\nyour local machine. Note that authorization information\ntransmitted &rsquo;&rsquo;in the clear&rsquo;&rsquo; through\na network file system or using <i>ftp</i> or <i>rcp</i> can\nbe &rsquo;&rsquo;stolen&rsquo;&rsquo; by a network\neavesdropper, and as such may enable unauthorized access. In\nmany environments, this level of security is not a concern,\nbut if it is, you need to know the exact semantics of the\nparticular authorization data to know if this is actually a\nproblem.\n\nFor more\ninformation on access control, see the <i>Xsecurity</i>(7)\nmanual page.\n\n<h2>GEOMETRY SPECIFICATIONS\n<a name=\"GEOMETRY SPECIFICATIONS\"></a>\n</h2>\n\n\nOne of the\nadvantages of using window systems instead of hardwired\nterminals is that applications don&rsquo;t have to be\nrestricted to a particular size or location on the screen.\nAlthough the layout of windows on a display is controlled by\nthe window manager that the user is running (described\nbelow), most X programs accept a command line argument of\nthe form <b>-geometry</b> <i>WIDTHxHEIGHT+XOFF+YOFF</i>\n(where <i>WIDTH</i>, <i>HEIGHT</i>, <i>XOFF</i>, and\n<i>YOFF</i> are numbers) for specifying a preferred size and\nlocation for this application&rsquo;s main window.\n\nThe\n<i>WIDTH</i> and <i>HEIGHT</i> parts of the geometry\nspecification are usually measured in either pixels or\ncharacters, depending on the application. The <i>XOFF</i>\nand <i>YOFF</i> parts are measured in pixels and are used to\nspecify the distance of the window from the left or right\nand top and bottom edges of the screen, respectively. Both\ntypes of offsets are measured from the indicated edge of the\nscreen to the corresponding edge of the window. The X offset\nmay be specified in the following ways:\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p style=\"margin-top: 1em\"><i>+XOFF</i></td>\n<td width=\"5%\"></td>\n<td width=\"77%\">\n\n\n<p style=\"margin-top: 1em\">The left edge of the window is\nto be placed <i>XOFF</i> pixels in from the left edge of the\nscreen (i.e., the X coordinate of the window&rsquo;s origin\nwill be <i>XOFF</i>). <i>XOFF</i> may be negative, in which\ncase the window&rsquo;s left edge will be off the\nscreen. </td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p><i>-XOFF</i></td>\n<td width=\"5%\"></td>\n<td width=\"77%\">\n\n\n<p>The right edge of the window is to be placed <i>XOFF</i>\npixels in from the right edge of the screen. <i>XOFF</i> may\nbe negative, in which case the window&rsquo;s right edge\nwill be off the screen.</td></tr>\n</table>\n\nThe Y offset\nhas similar meanings:\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p style=\"margin-top: 1em\"><i>+YOFF</i></td>\n<td width=\"5%\"></td>\n<td width=\"77%\">\n\n\n<p style=\"margin-top: 1em\">The top edge of the window is to\nbe <i>YOFF</i> pixels below the top edge of the screen\n(i.e., the Y coordinate of the window&rsquo;s origin will be\n<i>YOFF</i>). <i>YOFF</i> may be negative, in which case the\nwindow&rsquo;s top edge will be off the screen.</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p><i>-YOFF</i></td>\n<td width=\"5%\"></td>\n<td width=\"77%\">\n\n\n<p>The bottom edge of the window is to be <i>YOFF</i>\npixels above the bottom edge of the screen. <i>YOFF</i> may\nbe negative, in which case the window&rsquo;s bottom edge\nwill be off the screen.</td></tr>\n</table>\n\nOffsets must be\ngiven as pairs; in other words, in order to specify either\n<i>XOFF</i> or <i>YOFF</i> both must be present. Windows can\nbe placed in the four corners of the screen using the\nfollowing specifications:\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"6%\">\n\n\n<p style=\"margin-top: 1em\"><i>+0+0</i></td>\n<td width=\"6%\"></td>\n<td width=\"37%\">\n\n\n<p style=\"margin-top: 1em\">upper left hand corner.</td>\n<td width=\"40%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"6%\">\n\n\n<p><i>-0+0</i></td>\n<td width=\"6%\"></td>\n<td width=\"37%\">\n\n\n<p>upper right hand corner.</td>\n<td width=\"40%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"6%\">\n\n\n<p><i>-0-0</i></td>\n<td width=\"6%\"></td>\n<td width=\"37%\">\n\n\n<p>lower right hand corner.</td>\n<td width=\"40%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"6%\">\n\n\n<p><i>+0-0</i></td>\n<td width=\"6%\"></td>\n<td width=\"37%\">\n\n\n<p>lower left hand corner.</td>\n<td width=\"40%\">\n</td></tr>\n</table>\n\nIn the\nfollowing examples, a terminal emulator is placed in roughly\nthe center of the screen and a load average monitor,\nmailbox, and clock are placed in the upper right hand\ncorner:\n\nxterm -fn 6x10\n-geometry 80x24+30+200 &amp; <br>\nxclock -geometry 48x48-0+0 &amp; <br>\nxload -geometry 48x48-96+0 &amp; <br>\nxbiff -geometry 48x48-48+0 &amp;\n\n<h2>WINDOW MANAGERS\n<a name=\"WINDOW MANAGERS\"></a>\n</h2>\n\n\nThe layout of\nwindows on the screen is controlled by special programs\ncalled <i>window managers</i>. Although many window managers\nwill honor geometry specifications as given, others may\nchoose to ignore them (requiring the user to explicitly draw\nthe window&rsquo;s region on the screen with the pointer,\nfor example).\n\nSince window\nmanagers are regular (albeit complex) client programs, a\nvariety of different user interfaces can be built. The X.Org\nFoundation distribution comes with a window manager named\n<i>twm</i> which supports overlapping windows, popup menus,\npoint-and-click or click-to-type input models, title bars,\nnice icons (and an icon manager for those who don&rsquo;t\nlike separate icon windows).\n\nSee the\nuser-contributed software in the X.Org Foundation\ndistribution for other popular window managers.\n\n<h2>FONT NAMES\n<a name=\"FONT NAMES\"></a>\n</h2>\n\n\nCollections of\ncharacters for displaying text and symbols in X are known as\n<i>fonts</i>. A font typically contains images that share a\ncommon appearance and look nice together (for example, a\nsingle size, boldness, slant, and character set). Similarly,\ncollections of fonts that are based on a common type face\n(the variations are usually called roman, bold, italic, bold\nitalic, oblique, and bold oblique) are called\n<i>families</i>.\n\nFonts come in\nvarious sizes. The X server supports <i>scalable</i> fonts,\nmeaning it is possible to create a font of arbitrary size\nfrom a single source for the font. The server supports\nscaling from <i>outline</i> fonts and <i>bitmap</i> fonts.\nScaling from outline fonts usually produces significantly\nbetter results than scaling from bitmap fonts.\n\nAn X server can\nobtain fonts from individual files stored in directories in\nthe file system, or from one or more font servers, or from a\nmixtures of directories and font servers. The list of places\nthe server looks when trying to find a font is controlled by\nits <i>font path</i>. Although most installations will\nchoose to have the server start up with all of the commonly\nused font directories in the font path, the font path can be\nchanged at any time with the <i>xset</i> program. However,\nit is important to remember that the directory names are on\nthe <b>server</b>&rsquo;s machine, not on the\napplication&rsquo;s.\n\nBitmap font\nfiles are usually created by compiling a textual font\ndescription into binary form, using <i>bdftopcf</i>. Font\ndatabases are created by running the <i>mkfontdir</i>\nprogram in the directory containing the source or compiled\nversions of the fonts. Whenever fonts are added to a\ndirectory, <i>mkfontdir</i> should be rerun so that the\nserver can find the new fonts. To make the server reread the\nfont database, reset the font path with the <i>xset</i>\nprogram. For example, to add a font to a private directory,\nthe following commands could be used:\n\n% cp\nnewfont.pcf ~/myfonts <br>\n% mkfontdir ~/myfonts <br>\n% xset fp rehash\n\nThe\n<i>xfontsel</i> and <i>xlsfonts</i> programs can be used to\nbrowse through the fonts available on a server. Font names\ntend to be fairly long as they contain all of the\ninformation needed to uniquely identify individual fonts.\nHowever, the X server supports wildcarding of font names, so\nthe full specification\n\n\n<i>-adobe-courier-medium-r-normal--10-100-75-75-m-60-iso8859-1</i>\n\nmight be\nabbreviated as:\n\n\n<i>-*-courier-medium-r-normal--*-100-*-*-*-*-iso8859-1</i>\n\nBecause the\nshell also has special meanings for <i>*</i> and <i>?</i>,\nwildcarded font names should be quoted:\n\n% xlsfonts -fn\n&rsquo;-*-courier-medium-r-normal--*-100-*-*-*-*-*-*&rsquo;\n\nThe\n<i>xlsfonts</i> program can be used to list all of the fonts\nthat match a given pattern. With no arguments, it lists all\navailable fonts. This will usually list the same font at\nmany different sizes. To see just the base scalable font\nnames, try using one of the following patterns:\n\n\n<i>-*-*-*-*-*-*-0-0-0-0-*-0-*-*\n<br>\n-*-*-*-*-*-*-0-0-75-75-*-0-*-* <br>\n-*-*-*-*-*-*-0-0-100-100-*-0-*-*</i>\n\nTo convert one\nof the resulting names into a font at a specific size,\nreplace one of the first two zeros with a nonzero value. The\nfield containing the first zero is for the pixel size;\nreplace it with a specific height in pixels to name a font\nat that size. Alternatively, the field containing the second\nzero is for the point size; replace it with a specific size\nin decipoints (there are 722.7 decipoints to the inch) to\nname a font at that size. The last zero is an average width\nfield, measured in tenths of pixels; some servers will\nanamorphically scale if this value is specified.\n\n<h2>FONT SERVER NAMES\n<a name=\"FONT SERVER NAMES\"></a>\n</h2>\n\n\nOne of the\nfollowing forms can be used to name a font server that\naccepts TCP connections:\n\n\ntcp/<i>hostname</i>:<i>port</i>\n<br>\ntcp/<i>hostname</i>:<i>port</i>/<i>cataloguelist</i>\n\nThe\n<i>hostname</i> specifies the name (or decimal numeric\naddress) of the machine on which the font server is running.\nThe <i>port</i> is the decimal TCP port on which the font\nserver is listening for connections. The\n<i>cataloguelist</i> specifies a list of catalogue names,\nwith &rsquo;+&rsquo; as a separator.\n\nExamples:\n<i>tcp/x.org:7100</i>,\n<i>tcp/198.112.45.11:7100/all</i>.\n\n<h2>COLOR NAMES\n<a name=\"COLOR NAMES\"></a>\n</h2>\n\n\nMost\napplications provide ways of tailoring (usually through\nresources or command line arguments) the colors of various\nelements in the text and graphics they display. A color can\nbe specified either by an abstract color name, or by a\nnumerical color specification. The numerical specification\ncan identify a color in either device-dependent (RGB) or\ndevice-independent terms. Color strings are\ncase-insensitive.\n\nX supports the\nuse of abstract color names, for example, &quot;red&quot;,\n&quot;blue&quot;. A value for this abstract name is obtained\nby searching one or more color name databases. <i>Xlib</i>\nfirst searches zero or more client-side databases; the\nnumber, location, and content of these databases is\nimplementation dependent. If the name is not found, the\ncolor is looked up in the X server&rsquo;s database. The\ntext form of this database is commonly stored in the file\n<i>usr/share/X11/rgb.txt</i>.\n\nA numerical\ncolor specification consists of a color space name and a set\nof values in the following syntax:\n\n\n<i>&lt;color_space_name&gt;</i>:<i>&lt;value&gt;/.../&lt;value&gt;</i>\n\nAn RGB Device\nspecification is identified by the prefix &quot;rgb:&quot;\nand has the following syntax:\n\n\nrgb:<i>&lt;red&gt;/&lt;green&gt;/&lt;blue&gt;</i>\n\n\n<i>&lt;red&gt;</i>,\n<i>&lt;green&gt;</i>, <i>&lt;blue&gt;</i> := <i>h</i> |\n<i>hh</i> | <i>hhh</i> | <i>hhhh <br>\nh</i> := single hexadecimal digits\n\nNote that\n<i>h</i> indicates the value scaled in 4 bits, <i>hh</i> the\nvalue scaled in 8 bits, <i>hhh</i> the value scaled in 12\nbits, and <i>hhhh</i> the value scaled in 16 bits,\nrespectively. These values are passed directly to the X\nserver, and are assumed to be gamma corrected.\n\nThe eight\nprimary colors can be represented as:\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\">\n</td>\n<td width=\"8%\"></td>\n<td width=\"77%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"8%\">\n</td>\n<td width=\"77%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"8%\">\n</td>\n<td width=\"77%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"8%\"></td>\n<td width=\"77%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"8%\">\n</td>\n<td width=\"77%\">\n</td></tr>\n</table>\n\n\n<p align=\"center\"><img src=\"grohtml-3532633.png\" alt=\"Image grohtml-3532633.png\">\n\nFor backward\ncompatibility, an older syntax for RGB Device is supported,\nbut its continued use is not encouraged. The syntax is an\ninitial sharp sign character followed by a numeric\nspecification, in one of the following formats:\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"15%\"></td>\n<td width=\"8%\"></td>\n<td width=\"8%\">\n</td>\n<td width=\"69%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"15%\"></td>\n<td width=\"8%\"></td>\n<td width=\"8%\">\n</td>\n<td width=\"69%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"15%\"></td>\n<td width=\"8%\"></td>\n<td width=\"8%\"></td>\n<td width=\"69%\">\n</td></tr>\n</table>\n\n\n<p align=\"center\"><img src=\"grohtml-3532634.png\" alt=\"Image grohtml-3532634.png\">\n\nThe R, G, and B\nrepresent single hexadecimal digits. When fewer than 16 bits\neach are specified, they represent the most-significant bits\nof the value (unlike the &quot;rgb:&quot; syntax, in which\nvalues are scaled). For example, #3a7 is the same as\n#3000a0007000.\n\nAn RGB\nintensity specification is identified by the prefix\n&quot;rgbi:&quot; and has the following syntax:\n\n\nrgbi:<i>&lt;red&gt;/&lt;green&gt;/&lt;blue&gt;</i>\n\nThe red, green,\nand blue are floating point values between 0.0 and 1.0,\ninclusive. They represent linear intensity values, with 1.0\nindicating full intensity, 0.5 half intensity, and so on.\nThese values will be gamma corrected by <i>Xlib</i> before\nbeing sent to the X server. The input format for these\nvalues is an optional sign, a string of numbers possibly\ncontaining a decimal point, and an optional exponent field\ncontaining an E or e followed by a possibly signed integer\nstring.\n\nThe standard\ndevice-independent string specifications have the following\nsyntax:\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"31%\"></td>\n<td width=\"7%\"></td>\n<td width=\"62%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"31%\"></td>\n<td width=\"7%\"></td>\n<td width=\"62%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"31%\"></td>\n<td width=\"7%\"></td>\n<td width=\"62%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"31%\"></td>\n<td width=\"7%\"></td>\n<td width=\"62%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"31%\"></td>\n<td width=\"7%\"></td>\n<td width=\"62%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"31%\"></td>\n<td width=\"7%\"></td>\n<td width=\"62%\">\n</td></tr>\n</table>\n\n\n<p align=\"center\"><img src=\"grohtml-3532635.png\" alt=\"Image grohtml-3532635.png\">\n\nAll of the\nvalues (C, H, V, X, Y, Z, a, b, u, v, y, x) are floating\npoint values. Some of the values are constrained to be\nbetween zero and some upper bound; the upper bounds are\ngiven in parentheses above. The syntax for these values is\nan optional &rsquo;+&rsquo; or &rsquo;-&rsquo; sign, a\nstring of digits possibly containing a decimal point, and an\noptional exponent field consisting of an &rsquo;E&rsquo; or\n&rsquo;e&rsquo; followed by an optional &rsquo;+&rsquo; or\n&rsquo;-&rsquo; followed by a string of digits.\n\nFor more\ninformation on device independent color, see the <i>Xlib</i>\nreference manual.\n\n<h2>KEYBOARDS\n<a name=\"KEYBOARDS\"></a>\n</h2>\n\n\nThe X keyboard\nmodel is broken into two layers: server-specific codes\n(called <i>keycodes</i>) which represent the physical keys,\nand server-independent symbols (called <i>keysyms</i>) which\nrepresent the letters or words that appear on the keys. Two\ntables are kept in the server for converting keycodes to\nkeysyms: <i><br>\nmodifier list</i>\n\n<p style=\"margin-left:23%;\">Some keys (such as Shift,\nControl, and Caps Lock) are known as <i>modifier</i> and are\nused to select different symbols that are attached to a\nsingle key (such as Shift-a generates a capital A, and\nControl-l generates a control character ^L). The server\nkeeps a list of keycodes corresponding to the various\nmodifier keys. Whenever a key is pressed or released, the\nserver generates an <i>event</i> that contains the keycode\nof the indicated key as well as a mask that specifies which\nof the modifier keys are currently pressed. Most servers set\nup this list to initially contain the various shift,\ncontrol, and shift lock keys on the keyboard.\n\n<p style=\"margin-left:11%;\"><i>keymap table</i>\n\n<p style=\"margin-left:23%;\">Applications translate event\nkeycodes and modifier masks into keysyms using a <i>keysym\ntable</i> which contains one row for each keycode and one\ncolumn for various modifier states. This table is\ninitialized by the server to correspond to normal typewriter\nconventions. The exact semantics of how the table is\ninterpreted to produce keysyms depends on the particular\nprogram, libraries, and language input method used, but the\nfollowing conventions for the first four keysyms in each row\nare generally adhered to:\n\nThe first four\nelements of the list are split into two groups of keysyms.\nGroup 1 contains the first and second keysyms; Group 2\ncontains the third and fourth keysyms. Within each group, if\nthe first element is alphabetic and the the second element\nis the special keysym <i>NoSymbol</i>, then the group is\ntreated as equivalent to a group in which the first element\nis the lowercase letter and the second element is the\nuppercase letter.\n\nSwitching\nbetween groups is controlled by the keysym named MODE\nSWITCH, by attaching that keysym to some key and attaching\nthat key to any one of the modifiers Mod1 through Mod5. This\nmodifier is called the &rsquo;&rsquo;group\nmodifier.&rsquo;&rsquo; Group 1 is used when the group\nmodifier is off, and Group 2 is used when the group modifier\nis on.\n\nWithin a group,\nthe modifier state determines which keysym to use. The first\nkeysym is used when the Shift and Lock modifiers are off.\nThe second keysym is used when the Shift modifier is on,\nwhen the Lock modifier is on and the second keysym is\nuppercase alphabetic, or when the Lock modifier is on and is\ninterpreted as ShiftLock. Otherwise, when the Lock modifier\nis on and is interpreted as CapsLock, the state of the Shift\nmodifier is applied first to select a keysym; but if that\nkeysym is lowercase alphabetic, then the corresponding\nuppercase keysym is used instead.\n\n<h2>OPTIONS\n<a name=\"OPTIONS\"></a>\n</h2>\n\n\nMost X programs\nattempt to use the same names for command line options and\narguments. All applications written with the X Toolkit\nIntrinsics automatically accept the following options:\n<b><br>\n-display</b> <i>display</i>\n\n<p style=\"margin-left:23%;\">This option specifies the name\nof the X server to use.\n\n<p style=\"margin-left:11%;\"><b>-geometry</b>\n<i>geometry</i>\n\n<p style=\"margin-left:23%;\">This option specifies the\ninitial size and location of the window.\n\n<p style=\"margin-left:11%;\"><b>-bg</b> <i>color</i><b>,\n-background</b> <i>color</i>\n\n<p style=\"margin-left:23%;\">Either option specifies the\ncolor to use for the window background.\n\n<p style=\"margin-left:11%;\"><b>-bd</b> <i>color</i><b>,\n-bordercolor</b> <i>color</i>\n\n<p style=\"margin-left:23%;\">Either option specifies the\ncolor to use for the window border.\n\n<p style=\"margin-left:11%;\"><b>-bw</b> <i>number</i><b>,\n-borderwidth</b> <i>number</i>\n\n<p style=\"margin-left:23%;\">Either option specifies the\nwidth in pixels of the window border.\n\n<p style=\"margin-left:11%;\"><b>-fg</b> <i>color</i><b>,\n-foreground</b> <i>color</i>\n\n<p style=\"margin-left:23%;\">Either option specifies the\ncolor to use for text or graphics.\n\n<p style=\"margin-left:11%;\"><b>-fn</b> <i>font</i><b>,\n-font</b> <i>font</i>\n\n<p style=\"margin-left:23%;\">Either option specifies the\nfont to use for displaying text.\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"11%\">\n\n\n<p><b>-iconic</b></td>\n<td width=\"1%\"></td>\n<td width=\"77%\">\n\n\n<p>This option indicates that the user would prefer that\nthe application&rsquo;s windows initially not be visible as\nif the windows had be immediately iconified by the user.\nWindow managers may choose not to honor the\napplication&rsquo;s request.</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"11%\">\n\n\n<p><b>-name</b></td>\n<td width=\"1%\"></td>\n<td width=\"77%\">\n\n\n<p>This option specifies the name under which resources for\nthe application should be found. This option is useful in\nshell aliases to distinguish between invocations of an\napplication, without resorting to creating links to alter\nthe executable file name.</td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-rv</b>, <b>-reverse</b>\n\n<p style=\"margin-left:23%;\">Either option indicates that\nthe program should simulate reverse video if possible, often\nby swapping the foreground and background colors. Not all\nprograms honor this or implement it correctly. It is usually\nonly used on monochrome displays.\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"4%\">\n\n\n<p><b>+rv</b></td>\n<td width=\"8%\"></td>\n<td width=\"77%\">\n\n\n<p>This option indicates that the program should not\nsimulate reverse video. This is used to override any\ndefaults since reverse video doesn&rsquo;t always work\nproperly. </td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-selectionTimeout</b>\n\n<p style=\"margin-left:23%;\">This option specifies the\ntimeout in milliseconds within which two communicating\napplications must respond to one another for a selection\nrequest.\n\n<p style=\"margin-left:11%;\"><b>-synchronous</b>\n\n<p style=\"margin-left:23%;\">This option indicates that\nrequests to the X server should be sent synchronously,\ninstead of asynchronously. Since <i>Xlib</i> normally\nbuffers requests to the server, errors do not necessarily\nget reported immediately after they occur. This option turns\noff the buffering so that the application can be debugged.\nIt should never be used with a working program.\n\n<p style=\"margin-left:11%;\"><b>-title</b> <i>string</i>\n\n<p style=\"margin-left:23%;\">This option specifies the title\nto be used for this window. This information is sometimes\nused by a window manager to provide some sort of header\nidentifying the window.\n\n<p style=\"margin-left:11%;\"><b>-xnllanguage</b>\n<i>language[_territory][.codeset]</i>\n\n<p style=\"margin-left:23%;\">This option specifies the\nlanguage, territory, and codeset for use in resolving\nresource and other filenames.\n\n<p style=\"margin-left:11%;\"><b>-xrm</b>\n<i>resourcestring</i>\n\n<p style=\"margin-left:23%;\">This option specifies a\nresource name and value to override any defaults. It is also\nvery useful for setting resources that don&rsquo;t have\nexplicit command line arguments.\n\n<h2>RESOURCES\n<a name=\"RESOURCES\"></a>\n</h2>\n\n\nTo make the\ntailoring of applications to personal preferences easier, X\nprovides a mechanism for storing default values for program\nresources (e.g. background color, window title, etc.) that\nis used by programs that use toolkits based on the X Toolkit\nIntrinsics library libXt. (Programs using the common Gtk+\nand Qt toolkits use other configuration mechanisms.)\nResources are specified as strings that are read in from\nvarious places when an application is run. Program\ncomponents are named in a hierarchical fashion, with each\nnode in the hierarchy identified by a class and an instance\nname. At the top level is the class and instance name of the\napplication itself. By convention, the class name of the\napplication is the same as the program name, but with the\nfirst letter capitalized (e.g. <i>Bitmap</i> or\n<i>Emacs</i>) although some programs that begin with the\nletter &rsquo;&rsquo;x&rsquo;&rsquo; also capitalize the\nsecond letter for historical reasons.\n\nThe precise\nsyntax for resources is:\n\nResourceLine =\nComment | IncludeFile | ResourceSpec | &lt;empty line&gt;\n<br>\nComment = &quot;!&quot; {&lt;any character except null or\nnewline&gt;} <br>\nIncludeFile = &quot;#&quot; WhiteSpace &quot;include&quot;\nWhiteSpace FileName WhiteSpace <br>\nFileName = &lt;valid filename for operating system&gt; <br>\nResourceSpec = WhiteSpace ResourceName WhiteSpace\n&quot;:&quot; WhiteSpace Value <br>\nResourceName = [Binding] {Component Binding} ComponentName\n<br>\nBinding = &quot;.&quot; | &quot;*&quot; <br>\nWhiteSpace = {&lt;space&gt; | &lt;horizontal tab&gt;} <br>\nComponent = &quot;?&quot; | ComponentName <br>\nComponentName = NameChar {NameChar} <br>\nNameChar = &quot;a&quot;-&quot;z&quot; |\n&quot;A&quot;-&quot;Z&quot; | &quot;0&quot;-&quot;9&quot; |\n&quot;_&quot; | &quot;-&quot; <br>\nValue = {&lt;any character except null or unescaped\nnewline&gt;}\n\nElements\nseparated by vertical bar (|) are alternatives. Curly braces\n({...}) indicate zero or more repetitions of the enclosed\nelements. Square brackets ([...]) indicate that the enclosed\nelement is optional. Quotes (&quot;...&quot;) are used\naround literal characters.\n\nIncludeFile\nlines are interpreted by replacing the line with the\ncontents of the specified file. The word &quot;include&quot;\nmust be in lowercase. The filename is interpreted relative\nto the directory of the file in which the line occurs (for\nexample, if the filename contains no directory or contains a\nrelative directory specification).\n\nIf a\nResourceName contains a contiguous sequence of two or more\nBinding characters, the sequence will be replaced with\nsingle &quot;.&quot; character if the sequence contains only\n&quot;.&quot; characters, otherwise the sequence will be\nreplaced with a single &quot;*&quot; character.\n\nA resource\ndatabase never contains more than one entry for a given\nResourceName. If a resource file contains multiple lines\nwith the same ResourceName, the last line in the file is\nused.\n\nAny whitespace\ncharacter before or after the name or colon in a\nResourceSpec are ignored. To allow a Value to begin with\nwhitespace, the two-character sequence\n&rsquo;&rsquo;\\<i>space</i>&rsquo;&rsquo; (backslash\nfollowed by space) is recognized and replaced by a space\ncharacter, and the two-character sequence\n&rsquo;&rsquo;\\<i>tab</i>&rsquo;&rsquo; (backslash followed\nby horizontal tab) is recognized and replaced by a\nhorizontal tab character. To allow a Value to contain\nembedded newline characters, the two-character sequence\n&rsquo;&rsquo;\\n&rsquo;&rsquo; is recognized and replaced by\na newline character. To allow a Value to be broken across\nmultiple lines in a text file, the two-character sequence\n&rsquo;&rsquo;\\<i>newline</i>&rsquo;&rsquo; (backslash\nfollowed by newline) is recognized and removed from the\nvalue. To allow a Value to contain arbitrary character\ncodes, the four-character sequence\n&rsquo;&rsquo;\\<i>nnn</i>&rsquo;&rsquo;, where each <i>n</i>\nis a digit character in the range of\n&rsquo;&rsquo;0&rsquo;&rsquo;-&rsquo;&rsquo;7&rsquo;&rsquo;,\nis recognized and replaced with a single byte that contains\nthe octal value specified by the sequence. Finally, the\ntwo-character sequence &rsquo;&rsquo;\\\\&rsquo;&rsquo; is\nrecognized and replaced with a single backslash.\n\nWhen an\napplication looks for the value of a resource, it specifies\na complete path in the hierarchy, with both class and\ninstance names. However, resource values are usually given\nwith only partially specified names and classes, using\npattern matching constructs. An asterisk (*) is a loose\nbinding and is used to represent any number of intervening\ncomponents, including none. A period (.) is a tight binding\nand is used to separate immediately adjacent components. A\nquestion mark (?) is used to match any single component name\nor class. A database entry cannot end in a loose binding;\nthe final component (which cannot be &quot;?&quot;) must be\nspecified. The lookup algorithm searches the resource\ndatabase for the entry that most closely matches (is most\nspecific for) the full name and class being queried. When\nmore than one database entry matches the full name and\nclass, precedence rules are used to select just one.\n\nThe full name\nand class are scanned from left to right (from highest level\nin the hierarchy to lowest), one component at a time. At\neach level, the corresponding component and/or binding of\neach matching entry is determined, and these matching\ncomponents and bindings are compared according to precedence\nrules. Each of the rules is applied at each level, before\nmoving to the next level, until a rule selects a single\nentry over all others. The rules (in order of precedence)\nare:\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p>1.</td>\n<td width=\"4%\"></td>\n<td width=\"82%\">\n\n\n<p>An entry that contains a matching component (whether\nname, class, or &quot;?&quot;) takes precedence over entries\nthat elide the level (that is, entries that match the level\nin a loose binding).</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p>2.</td>\n<td width=\"4%\"></td>\n<td width=\"82%\">\n\n\n<p>An entry with a matching name takes precedence over both\nentries with a matching class and entries that match using\n&quot;?&quot;. An entry with a matching class takes\nprecedence over entries that match using &quot;?&quot;.</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p>3.</td>\n<td width=\"4%\"></td>\n<td width=\"82%\">\n\n\n<p>An entry preceded by a tight binding takes precedence\nover entries preceded by a loose binding.</td></tr>\n</table>\n\nPrograms based\non the X Toolkit Intrinsics obtain resources from the\nfollowing sources (other programs usually support some\nsubset of these sources): <b><br>\nRESOURCE_MANAGER root window property</b>\n\n<p style=\"margin-left:23%;\">Any global resources that\nshould be available to clients on all machines should be\nstored in the RESOURCE_MANAGER property on the root window\nof the first screen using the <i>xrdb</i> program. This is\nfrequently taken care of when the user starts up X through\nthe display manager or <i>xinit</i>.\n\n<p style=\"margin-left:11%;\"><b>SCREEN_RESOURCES root window\nproperty</b>\n\n<p style=\"margin-left:23%;\">Any resources specific to a\ngiven screen (e.g. colors) that should be available to\nclients on all machines should be stored in the\nSCREEN_RESOURCES property on the root window of that screen.\nThe <i>xrdb</i> program will sort resources automatically\nand place them in RESOURCE_MANAGER or SCREEN_RESOURCES, as\nappropriate.\n\n<p style=\"margin-left:11%;\"><b>application-specific\nfiles</b>\n\n<p style=\"margin-left:23%;\">Directories named by the\nenvironment variable XUSERFILESEARCHPATH or the environment\nvariable XAPPLRESDIR (which names a single directory and\nshould end with a &rsquo;/&rsquo; on POSIX systems), plus\ndirectories in a standard place (usually under\n/usr/share/X11/, but this can be overridden with the\nXFILESEARCHPATH environment variable) are searched for for\napplication-specific resources. For example, application\ndefault resources are usually kept in\n/usr/share/X11/app-defaults/. See the <i>X Toolkit\nIntrinsics - C Language Interface</i> manual for\ndetails.\n\n<p style=\"margin-left:11%;\"><b>XENVIRONMENT</b>\n\n<p style=\"margin-left:23%;\">Any user- and machine-specific\nresources may be specified by setting the XENVIRONMENT\nenvironment variable to the name of a resource file to be\nloaded by all applications. If this variable is not defined,\na file named <i>$HOME</i>/.Xdefaults-<i>hostname</i> is\nlooked for instead, where <i>hostname</i> is the name of the\nhost where the application is executing.\n\n<p style=\"margin-left:11%;\"><b>-xrm</b>\n<i>resourcestring</i>\n\n<p style=\"margin-left:23%;\">Resources can also be specified\nfrom the command line. The <i>resourcestring</i> is a single\nresource name and value as shown above. Note that if the\nstring contains characters interpreted by the shell (e.g.,\nasterisk), they must be quoted. Any number of <b>-xrm</b>\narguments may be given on the command line.\n\nProgram\nresources are organized into groups called <i>classes</i>,\nso that collections of individual resources (each of which\nare called <i>instances</i>) can be set all at once. By\nconvention, the instance name of a resource begins with a\nlowercase letter and class name with an upper case letter.\nMultiple word resources are concatenated with the first\nletter of the succeeding words capitalized. Applications\nwritten with the X Toolkit Intrinsics will have at least the\nfollowing resources: <b><br>\nbackground (</b>class <b>Background)</b>\n\n<p style=\"margin-left:23%;\">This resource specifies the\ncolor to use for the window background.\n\n<p style=\"margin-left:11%;\"><b>borderWidth (</b>class\n<b>BorderWidth)</b>\n\n<p style=\"margin-left:23%;\">This resource specifies the\nwidth in pixels of the window border.\n\n<p style=\"margin-left:11%;\"><b>borderColor (</b>class\n<b>BorderColor)</b>\n\n<p style=\"margin-left:23%;\">This resource specifies the\ncolor to use for the window border.\n\nMost\napplications using the X Toolkit Intrinsics also have the\nresource <b>foreground</b> (class <b>Foreground</b>),\nspecifying the color to use for text and graphics within the\nwindow.\n\nBy combining\nclass and instance specifications, application preferences\ncan be set quickly and easily. Users of color displays will\nfrequently want to set Background and Foreground classes to\nparticular defaults. Specific color instances such as text\ncursors can then be overridden without having to define all\nof the related resources. For example,\n\nbitmap*Dashed:\noff <br>\nXTerm*cursorColor: gold <br>\nXTerm*multiScroll: on <br>\nXTerm*jumpScroll: on <br>\nXTerm*reverseWrap: on <br>\nXTerm*curses: on <br>\nXTerm*Font: 6x10 <br>\nXTerm*scrollBar: on <br>\nXTerm*scrollbar*thickness: 5 <br>\nXTerm*multiClickTime: 500 <br>\nXTerm*charClass: 33:48,37:48,45-47:48,64:48 <br>\nXTerm*cutNewline: off <br>\nXTerm*cutToBeginningOfLine: off <br>\nXTerm*titeInhibit: on <br>\nXTerm*ttyModes: intr ^c erase ^? kill ^u <br>\nXLoad*Background: gold <br>\nXLoad*Foreground: red <br>\nXLoad*highlight: black <br>\nXLoad*borderWidth: 0 <br>\nemacs*Geometry: 80x65-0-0 <br>\nemacs*Background: rgb:5b/76/86 <br>\nemacs*Foreground: white <br>\nemacs*Cursor: white <br>\nemacs*BorderColor: white <br>\nemacs*Font: 6x10 <br>\nxmag*geometry: -0-0 <br>\nxmag*borderColor: white\n\nIf these\nresources were stored in a file called <i>.Xresources</i> in\nyour home directory, they could be added to any existing\nresources in the server with the following command:\n\n% xrdb -merge\n$HOME/.Xresources\n\nThis is\nfrequently how user-friendly startup scripts merge\nuser-specific defaults into any site-wide defaults. All\nsites are encouraged to set up convenient ways of\nautomatically loading resources. See the <i>Xlib</i> manual\nsection <i>Resource Manager Functions</i> for more\ninformation.\n\n<h2>ENVIRONMENT\n<a name=\"ENVIRONMENT\"></a>\n</h2>\n\n\n\n<b>DISPLAY</b>\n\n<p style=\"margin-left:22%;\">This is the only mandatory\nenvironment variable. It must point to an X server. See\nsection &quot;Display Names&quot; above.\n\n<p style=\"margin-left:11%;\"><b>XAUTHORITY</b>\n\n<p style=\"margin-left:22%;\">This must point to a file that\ncontains authorization data. The default is\n<i>$HOME/.Xauthority</i>. See <a href=\"https://man.page/7/Xsecurity\">Xsecurity(7)</a>,\n<a href=\"https://man.page/1/xauth\">xauth(1)</a>, <a href=\"https://man.page/1/xdm\">xdm(1)</a>, <a href=\"https://man.page/3/Xau\">Xau(3)</a>.\n\n<p style=\"margin-left:11%;\"><b>ICEAUTHORITY</b>\n\n<p style=\"margin-left:22%;\">This must point to a file that\ncontains authorization data. The default is\n<i>$HOME/.ICEauthority</i>.\n\n<p style=\"margin-left:11%;\"><b>LC_ALL</b>, <b>LC_CTYPE</b>,\n<b>LANG</b>\n\n<p style=\"margin-left:22%;\">The first non-empty value among\nthese three determines the current locale&rsquo;s facet for\ncharacter handling, and in particular the default text\nencoding. See <a href=\"https://man.page/7/locale\">locale(7)</a>, <a href=\"https://man.page/3/setlocale\">setlocale(3)</a>,\n<a href=\"https://man.page/1/locale\">locale(1)</a>.\n\n<p style=\"margin-left:11%;\"><b>XMODIFIERS</b>\n\n<p style=\"margin-left:22%;\">This variable can be set to\ncontain additional information important for the current\nlocale setting. Typically set to\n<i>@im=&lt;input-method&gt;</i> to enable a particular input\nmethod. See <a href=\"https://man.page/3/XSetLocaleModifiers\">XSetLocaleModifiers(3)</a>.\n\n<p style=\"margin-left:11%;\"><b>XLOCALEDIR</b>\n\n<p style=\"margin-left:22%;\">This must point to a directory\ncontaining the locale.alias file and Compose and XLC_LOCALE\nfile hierarchies for all locales. The default value is\n<i>/usr/share/X11/locale</i>.\n\n<p style=\"margin-left:11%;\"><b>XENVIRONMENT</b>\n\n<p style=\"margin-left:22%;\">This must point to a file\ncontaining X resources. The default is\n<i>$HOME/.Xdefaults-&lt;hostname&gt;</i>. Unlike\n<i>$HOME/.Xresources</i>, it is consulted each time an X\napplication starts.\n\n<p style=\"margin-left:11%;\"><b>XFILESEARCHPATH</b>\n\n<p style=\"margin-left:22%;\">This must contain a colon\nseparated list of path templates, where libXt will search\nfor resource files. The default value consists of\n\n\n<p style=\"margin-left:22%; margin-top: 1em\">/etc/X11/%L/%T/%N%C%S:\\\n<br>\n/etc/X11/%l/%T/%N%C%S:\\ <br>\n/etc/X11/%T/%N%C%S:\\ <br>\n/etc/X11/%L/%T/%N%S:\\ <br>\n/etc/X11/%l/%T/%N%S:\\ <br>\n/etc/X11/%T/%N%S:\\ <br>\n/usr/share/X11/%L/%T/%N%C%S:\\ <br>\n/usr/share/X11/%l/%T/%N%C%S:\\ <br>\n/usr/share/X11/%T/%N%C%S:\\ <br>\n/usr/share/X11/%L/%T/%N%S:\\ <br>\n/usr/share/X11/%l/%T/%N%S:\\ <br>\n/usr/share/X11/%T/%N%S:\\ <br>\n/usr/lib/x86_64-linux-gnu/X11/%L/%T/%N%C%S:\\ <br>\n/usr/lib/x86_64-linux-gnu/X11/%l/%T/%N%C%S:\\ <br>\n/usr/lib/x86_64-linux-gnu/X11/%T/%N%C%S:\\ <br>\n/usr/lib/x86_64-linux-gnu/X11/%L/%T/%N%S:\\ <br>\n/usr/lib/x86_64-linux-gnu/X11/%l/%T/%N%S:\\ <br>\n/usr/lib/x86_64-linux-gnu/X11/%T/%N%S\n\n<p style=\"margin-left:22%; margin-top: 1em\">A path template\nis transformed to a pathname by substituting:\n\n<p style=\"margin-left:22%; margin-top: 1em\">%D =&gt; the\nimplementation-specific default path <br>\n%N =&gt; name (basename) being searched for <br>\n%T =&gt; type (dirname) being searched for <br>\n%S =&gt; suffix being searched for <br>\n%C =&gt; value of the resource &quot;customization&quot;\n<br>\n(class &quot;Customization&quot;) <br>\n%L =&gt; the locale name <br>\n%l =&gt; the locale&rsquo;s language (part before\n&rsquo;_&rsquo;) <br>\n%t =&gt; the locale&rsquo;s territory (part after\n&rsquo;_&rsquo; but before &rsquo;.&rsquo;) <br>\n%c =&gt; the locale&rsquo;s encoding (part after\n&rsquo;.&rsquo;)\n\n<p style=\"margin-left:11%;\"><b>XUSERFILESEARCHPATH</b>\n\n<p style=\"margin-left:22%;\">This must contain a colon\nseparated list of path templates, where libXt will search\nfor user dependent resource files. The default value is:\n\n\n<p style=\"margin-left:22%; margin-top: 1em\">$XAPPLRESDIR/%L/%N%C:\\\n<br>\n$XAPPLRESDIR/%l/%N%C:\\ <br>\n$XAPPLRESDIR/%N%C:\\ <br>\n$HOME/%N%C:\\ <br>\n$XAPPLRESDIR/%L/%N:\\ <br>\n$XAPPLRESDIR/%l/%N:\\ <br>\n$XAPPLRESDIR/%N:\\ <br>\n$HOME/%N\n\n<p style=\"margin-left:22%; margin-top: 1em\">$XAPPLRESDIR\ndefaults to <i>$HOME</i>, see below.\n\n<p style=\"margin-left:22%; margin-top: 1em\">A path template\nis transformed to a pathname by substituting:\n\n<p style=\"margin-left:22%; margin-top: 1em\">%D =&gt; the\nimplementation-specific default path <br>\n%N =&gt; name (basename) being searched for <br>\n%T =&gt; type (dirname) being searched for <br>\n%S =&gt; suffix being searched for <br>\n%C =&gt; value of the resource &quot;customization&quot;\n<br>\n(class &quot;Customization&quot;) <br>\n%L =&gt; the locale name <br>\n%l =&gt; the locale&rsquo;s language (part before\n&rsquo;_&rsquo;) <br>\n%t =&gt; the locale&rsquo;s territory (part after\n&rsquo;_&rsquo; but before &rsquo;.&rsquo;) <br>\n%c =&gt; the locale&rsquo;s encoding (part after\n&rsquo;.&rsquo;)\n\n<p style=\"margin-left:11%;\"><b>XAPPLRESDIR</b>\n\n<p style=\"margin-left:22%;\">This must point to a base\ndirectory where the user stores the application dependent\nresource files. The default value is <i>$HOME</i>. Only used\nif XUSERFILESEARCHPATH is not set.\n\n<p style=\"margin-left:11%;\"><b>XKEYSYMDB</b>\n\n<p style=\"margin-left:22%;\">This must point to a file\ncontaining nonstandard keysym definitions. The default value\nis <i>/usr/share/X11/XKeysymDB</i>.\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>XCMSDB</b></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>This must point to a color name database file. The\ndefault value is</td></tr>\n</table>\n\n\n<p style=\"margin-left:22%;\"><i>/usr/lib/x86_64-linux-gnu/X11/Xcms.txt</i>.\n\n<p style=\"margin-left:11%;\"><b>RESOURCE_NAME</b>\n\n<p style=\"margin-left:22%;\">This serves as main identifier\nfor resources belonging to the program being executed. It\ndefaults to the basename of pathname of the program.\n\n<p style=\"margin-left:11%;\"><b>SESSION_MANAGER</b>\n\n<p style=\"margin-left:22%;\">Denotes the session manager to\nwhich the application should connect. See <a href=\"https://man.page/1/xsm\">xsm(1)</a>,\n<a href=\"https://man.page/1/rstart\">rstart(1)</a>.\n\n<p style=\"margin-left:11%;\"><b>XF86BIGFONT_DISABLE</b>\n\n<p style=\"margin-left:22%;\">Setting this variable to a\nnon-empty value disables the XFree86-Bigfont extension. This\nextension is a mechanism to reduce the memory consumption of\nbig fonts by use of shared memory.\n\n<b>XKB_FORCE\n<br>\nXKB_DISABLE <br>\nXKB_DEBUG <br>\n_XKB_CHARSET <br>\n_XKB_LOCALE_CHARSETS <br>\n_XKB_OPTIONS_ENABLE <br>\n_XKB_LATIN1_LOOKUP <br>\n_XKB_CONSUME_LOOKUP_MODS <br>\n_XKB_CONSUME_SHIFT_AND_LOCK <br>\n_XKB_IGNORE_NEW_KEYBOARDS <br>\n_XKB_CONTROL_FALLBACK <br>\n_XKB_COMP_LED _XKB_COMP_FAIL_BEEP</b>\n\nThese variables\ninfluence the X Keyboard Extension.\n\n<h2>EXAMPLES\n<a name=\"EXAMPLES\"></a>\n</h2>\n\n\nThe following\nis a collection of sample command lines for some of the more\nfrequently used commands. For more information on a\nparticular command, please refer to that command&rsquo;s\nmanual page.\n\n% xrdb\n$HOME/.Xresources <br>\n% xmodmap -e &quot;keysym BackSpace = Delete&quot; <br>\n% mkfontdir /usr/local/lib/X11/otherfonts <br>\n% xset fp+ /usr/local/lib/X11/otherfonts <br>\n% xmodmap $HOME/.keymap.km <br>\n% xsetroot -solid &rsquo;rgbi:.8/.8/.8&rsquo; <br>\n% xset b 100 400 c 50 s 1800 r on <br>\n% xset q <br>\n% twm <br>\n% xmag <br>\n% xclock -geometry 48x48-0+0 -bg blue -fg white <br>\n% xeyes -geometry 48x48-48+0 <br>\n% xbiff -update 20 <br>\n% xlsfonts &rsquo;*helvetica*&rsquo; <br>\n% xwininfo -root <br>\n% xdpyinfo -display joesworkstation:0 <br>\n% xhost -joesworkstation <br>\n% xrefresh <br>\n% xwd | xwud <br>\n% bitmap companylogo.bm 32x32 <br>\n% xcalc -bg blue -fg magenta <br>\n% xterm -geometry 80x66-0-0 -name myxterm $*\n\n<h2>DIAGNOSTICS\n<a name=\"DIAGNOSTICS\"></a>\n</h2>\n\n\nA wide variety\nof error messages are generated from various programs. The\ndefault error handler in <i>Xlib</i> (also used by many\ntoolkits) uses standard resources to construct diagnostic\nmessages when errors occur. The defaults for these messages\nare usually stored in <i>usr/share/X11/XErrorDB</i>. If this\nfile is not present, error messages will be rather terse and\ncryptic.\n\nWhen the X\nToolkit Intrinsics encounter errors converting resource\nstrings to the appropriate internal format, no error\nmessages are usually printed. This is convenient when it is\ndesirable to have one set of resources across a variety of\ndisplays (e.g. color vs. monochrome, lots of fonts vs. very\nfew, etc.), although it can pose problems for trying to\ndetermine why an application might be failing. This behavior\ncan be overridden by the setting the\n<i>StringConversionWarnings</i> resource.\n\nTo force the X\nToolkit Intrinsics to always print string conversion error\nmessages, the following resource should be placed in the\nfile that gets loaded onto the RESOURCE_MANAGER property\nusing the <i>xrdb</i> program (frequently called\n<i>.Xresources</i> or <i>.Xres</i> in the user&rsquo;s home\ndirectory):\n\n\n*StringConversionWarnings:\non\n\nTo have\nconversion messages printed for just a particular\napplication, the appropriate instance name can be placed\nbefore the asterisk:\n\n\nxterm*StringConversionWarnings:\non\n\n<h2>SEE ALSO\n<a name=\"SEE ALSO\"></a>\n</h2>\n\n\n\n<a href=\"https://man.page/7/XOrgFoundation\">XOrgFoundation(7)</a>,\n<a href=\"https://man.page/7/XStandards\">XStandards(7)</a>, <a href=\"https://man.page/7/Xsecurity\">Xsecurity(7)</a>, <a href=\"https://man.page/1/appres\">appres(1)</a>,\n<a href=\"https://man.page/1/bdftopcf\">bdftopcf(1)</a>, <a href=\"https://man.page/1/bitmap\">bitmap(1)</a>, <a href=\"https://man.page/1/editres\">editres(1)</a>,\n<a href=\"https://man.page/1/fsinfo\">fsinfo(1)</a>, <a href=\"https://man.page/1/fslsfonts\">fslsfonts(1)</a>, <a href=\"https://man.page/1/fstobdf\">fstobdf(1)</a>,\n<a href=\"https://man.page/1/iceauth\">iceauth(1)</a>, <a href=\"https://man.page/1/imake\">imake(1)</a>, <a href=\"https://man.page/1/makedepend\">makedepend(1)</a>,\n<a href=\"https://man.page/1/mkfontdir\">mkfontdir(1)</a>, <a href=\"https://man.page/1/oclock\">oclock(1)</a>, <a href=\"https://man.page/1/proxymngr\">proxymngr(1)</a>,\n<a href=\"https://man.page/1/rgb\">rgb(1)</a>, <a href=\"https://man.page/1/resize\">resize(1)</a>, <a href=\"https://man.page/1/rstart\">rstart(1)</a>,\n<a href=\"https://man.page/1/smproxy\">smproxy(1)</a>, <a href=\"https://man.page/1/twm\">twm(1)</a>, <a href=\"https://man.page/1/x11perf\">x11perf(1)</a>,\n<a href=\"https://man.page/1/x11perfcomp\">x11perfcomp(1)</a>, <a href=\"https://man.page/1/xauth\">xauth(1)</a>,\n<a href=\"https://man.page/1/xclipboard\">xclipboard(1)</a>, <a href=\"https://man.page/1/xclock\">xclock(1)</a>, <a href=\"https://man.page/1/xcmsdb\">xcmsdb(1)</a>,\n<a href=\"https://man.page/1/xconsole\">xconsole(1)</a>, <a href=\"https://man.page/1/xdm\">xdm(1)</a>, <a href=\"https://man.page/1/xdpyinfo\">xdpyinfo(1)</a>,\n<a href=\"https://man.page/1/xfd\">xfd(1)</a>, <a href=\"https://man.page/1/xfindproxy\">xfindproxy(1)</a>, <a href=\"https://man.page/1/xfs\">xfs(1)</a>,\n<a href=\"https://man.page/1/xfwp\">xfwp(1)</a>, <a href=\"https://man.page/1/xhost\">xhost(1)</a>, <a href=\"https://man.page/1/xinit\">xinit(1)</a>,\n<a href=\"https://man.page/1/xkbbell\">xkbbell(1)</a>, <a href=\"https://man.page/1/xkbcomp\">xkbcomp(1)</a>, <a href=\"https://man.page/1/xkbevd\">xkbevd(1)</a>,\n<a href=\"https://man.page/1/xkbprint\">xkbprint(1)</a>, <a href=\"https://man.page/1/xkbvleds\">xkbvleds(1)</a>, <a href=\"https://man.page/1/xkbwatch\">xkbwatch(1)</a>,\n<a href=\"https://man.page/1/xkill\">xkill(1)</a>, <a href=\"https://man.page/1/xlogo\">xlogo(1)</a>, <a href=\"https://man.page/1/xlsatoms\">xlsatoms(1)</a>,\n<a href=\"https://man.page/1/xlsclients\">xlsclients(1)</a>, <a href=\"https://man.page/1/xlsfonts\">xlsfonts(1)</a>, <a href=\"https://man.page/1/xmag\">xmag(1)</a>,\n<a href=\"https://man.page/1/xmh\">xmh(1)</a>, <a href=\"https://man.page/1/xmodmap\">xmodmap(1)</a>, <a href=\"https://man.page/1/xprop\">xprop(1)</a>,\n<a href=\"https://man.page/1/xrdb\">xrdb(1)</a>, <a href=\"https://man.page/1/xrefresh\">xrefresh(1)</a>, <a href=\"https://man.page/1/xrx\">xrx(1)</a>,\n<a href=\"https://man.page/1/xset\">xset(1)</a>, <a href=\"https://man.page/1/xsetroot\">xsetroot(1)</a>, <a href=\"https://man.page/1/xsm\">xsm(1)</a>,\n<a href=\"https://man.page/1/xstdcmap\">xstdcmap(1)</a>, <a href=\"https://man.page/1/xterm\">xterm(1)</a>, <a href=\"https://man.page/1/xwd\">xwd(1)</a>,\n<a href=\"https://man.page/1/xwininfo\">xwininfo(1)</a>, <a href=\"https://man.page/1/xwud\">xwud(1)</a>. <a href=\"https://man.page/1/Xserver\">Xserver(1)</a>,\n<a href=\"https://man.page/1/Xorg\">Xorg(1)</a>, <a href=\"https://man.page/1/Xdmx\">Xdmx(1)</a>, <a href=\"https://man.page/1/Xephyr\">Xephyr(1)</a>,\n<a href=\"https://man.page/1/Xnest\">Xnest(1)</a>, <a href=\"https://man.page/1/Xquartz\">Xquartz(1)</a>, <a href=\"https://man.page/1/Xvfb\">Xvfb(1)</a>,\n<a href=\"https://man.page/1/Xvnc\">Xvnc(1)</a>, <a href=\"https://man.page/1/XWin\">XWin(1)</a>. <i>Xlib - C Language X\nInterface</i>, and <i>X Toolkit Intrinsics - C Language\nInterface</i>\n\n<h2>TRADEMARKS\n<a name=\"TRADEMARKS\"></a>\n</h2>\n\n\nX Window System\nis a trademark of The Open Group.\n\n<h2>AUTHORS\n<a name=\"AUTHORS\"></a>\n</h2>\n\n\nA cast of\nthousands, literally. Releases 6.7 and later are brought to\nyou by the X.Org Foundation. The names of all people who\nmade it a reality will be found in the individual documents\nand source files.\n\nReleases 6.6\nand 6.5 were done by The X.Org Group. Release 6.4 was done\nby The X Project Team. The Release 6.3 distribution was from\nThe X Consortium, Inc. The staff members at the X Consortium\nresponsible for that release were: Donna Converse\n(emeritus), Stephen Gildea (emeritus), Kaleb Keithley, Matt\nLandau (emeritus), Ralph Mor (emeritus), Janet\nO&rsquo;Halloran, Bob Scheifler, Ralph Swick, Dave Wiggins\n(emeritus), and Reed Augliere.\n\nThe X Window\nSystem standard was originally developed at the Laboratory\nfor Computer Science at the Massachusetts Institute of\nTechnology, and all rights thereto were assigned to the X\nConsortium on January 1, 1994. X Consortium, Inc. closed its\ndoors on December 31, 1996. All rights to the X Window\nSystem have been assigned to The Open Group.","body":"\n\n<h1 align=\"center\">X</h1>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<hr>\n\n\n<h2>NAME\n<a name=\"NAME\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">X - a portable,\nnetwork-transparent window system</p>\n\n<h2>OVERVIEW\n<a name=\"OVERVIEW\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The X Window\nSystem is a network transparent window system which runs on\na wide range of computing and graphics machines. It should\nbe relatively straightforward to build the X.Org Foundation\nsoftware distribution on most ANSI C and POSIX compliant\nsystems. Commercial implementations are also available for a\nwide range of platforms.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The X.Org\nFoundation requests that the following names be used when\nreferring to this software:</p>\n\n\n<p align=\"center\" style=\"margin-top: 1em\"><img src=\"grohtml-3532631.png\" alt=\"Image grohtml-3532631.png\"></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><i>X Window\nSystem</i> is a trademark of The Open Group.</p>\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">X Window System\nservers run on computers with bitmap displays. The server\ndistributes user input to and accepts output requests from\nvarious client programs through a variety of different\ninterprocess communication channels. Although the most\ncommon case is for the client programs to be running on the\nsame machine as the server, clients can be run transparently\nfrom other machines (including machines with different\narchitectures and operating systems) as well.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">X supports\noverlapping hierarchical subwindows and text and graphics\noperations, on both monochrome and color displays. For a\nfull explanation of the functions that are available, see\nthe <i>Xlib - C Language X Interface</i> manual, the <i>X\nWindow System Protocol</i> specification, the <i>X Toolkit\nIntrinsics - C Language Interface</i> manual, and various\ntoolkit documents.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The number of\nprograms that use <i>X</i> is quite large. Programs provided\nin the core X.Org Foundation distribution include: a\nterminal emulator, <i>xterm</i>; a window manager,\n<i>twm</i>; a display manager, <i>xdm</i>; a console\nredirect program, <i>xconsole</i>; a mail interface,\n<i>xmh</i>; a bitmap editor, <i>bitmap</i>; resource\nlisting/manipulation tools, <i>appres</i>, <i>editres</i>;\naccess control programs, <i>xauth</i>, <i>xhost</i>, and\n<i>iceauth</i>; user preference setting programs,\n<i>xrdb</i>, <i>xcmsdb</i>, <i>xset</i>, <i>xsetroot</i>,\n<i>xstdcmap</i>, and <i>xmodmap</i>; clocks, <i>xclock</i>\nand <i>oclock</i>; a font displayer, <i>xfd</i>; utilities\nfor listing information about fonts, windows, and displays,\n<i>xlsfonts</i>, <i>xwininfo</i>, <i>xlsclients</i>,\n<i>xdpyinfo</i>, <i>xlsatoms</i>, and <i>xprop</i>; screen\nimage manipulation utilities, <i>xwd</i>, <i>xwud</i>, and\n<i>xmag</i>; a performance measurement utility,\n<i>x11perf</i>; a font compiler, <i>bdftopcf</i>; a font\nserver and related utilities, <i>xfs</i>, <i>fsinfo</i>,\n<i>fslsfonts</i>, <i>fstobdf</i>; a display server and\nrelated utilities, <i>Xserver</i>, <i>rgb</i>,\n<i>mkfontdir</i>; a clipboard manager, <i>xclipboard</i>;\nkeyboard description compiler and related utilities,\n<i>xkbcomp</i>, <i>setxkbmap xkbprint</i>, <i>xkbbell</i>,\n<i>xkbevd</i>, <i>xkbvleds</i>, and <i>xkbwatch</i>; a\nutility to terminate clients, <i>xkill</i>; a firewall\nsecurity proxy, <i>xfwp</i>; a proxy manager to control\nthem, <i>proxymngr</i>; a utility to find proxies,\n<i>xfindproxy</i>; web browser plug-ins, <i>libxrx.so</i>\nand <i>libxrxnest.so</i>; an RX MIME-type helper program,\n<i>xrx</i>; and a utility to cause part or all of the screen\nto be redrawn, <i>xrefresh</i>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Many other\nutilities, window managers, games, toolkits, etc. are\nincluded as user-contributed software in the X.Org\nFoundation distribution, or are available on the Internet.\nSee your site administrator for details.</p>\n\n<h2>STARTING UP\n<a name=\"STARTING UP\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">There are two\nmain ways of getting the X server and an initial set of\nclient applications started. The particular method used\ndepends on what operating system you are running and whether\nor not you use other window systems in addition to X.\n<b><br>\nDisplay Manager</b></p>\n\n<p style=\"margin-left:23%;\">If you want to always have X\nrunning on your display, your site administrator can set\nyour machine up to use a Display Manager such as <i>xdm</i>,\n<i>gdm</i>, or <i>kdm</i>. This program is typically started\nby the system at boot time and takes care of keeping the\nserver running and getting users logged in. If you are\nrunning one of these display managers, you will normally see\na window on the screen welcoming you to the system and\nasking for your login information. Simply type them in as\nyou would at a normal terminal. If you make a mistake, the\ndisplay manager will display an error message and ask you to\ntry again. After you have successfully logged in, the\ndisplay manager will start up your X environment. The\ndocumentation for the display manager you use can provide\nmore details.</p>\n\n<p style=\"margin-left:11%;\"><i>xinit</i> <b>(run manually\nfrom the shell)</b></p>\n\n<p style=\"margin-left:23%;\">Sites that support more than\none window system might choose to use the <i>xinit</i>\nprogram for starting X manually. If this is true for your\nmachine, your site administrator will probably have provided\na program named &quot;x11&quot;, &quot;startx&quot;, or\n&quot;xstart&quot; that will do site-specific initialization\n(such as loading convenient default resources, running a\nwindow manager, displaying a clock, and starting several\nterminal emulators) in a nice way. If not, you can build\nsuch a script using the <i>xinit</i> program. This utility\nsimply runs one user-specified program to start the server,\nruns another to start up any desired clients, and then waits\nfor either to finish. Since either or both of the\nuser-specified programs may be a shell script, this gives\nsubstantial flexibility at the expense of a nice interface.\nFor this reason, <i>xinit</i> is not intended for end\nusers.</p>\n\n<h2>DISPLAY NAMES\n<a name=\"DISPLAY NAMES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">From the\nuser&rsquo;s perspective, every X server has a <i>display\nname</i> of the form:</p>\n\n\n<p style=\"margin-left:22%; margin-top: 1em\"><i>hostname:displaynumber.screennumber</i></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This\ninformation is used by the application to determine how it\nshould connect to the server and which screen it should use\nby default (on displays with multiple monitors): <i><br>\nhostname</i></p>\n\n<p style=\"margin-left:23%;\">The <i>hostname</i> specifies\nthe name of the machine to which the display is physically\nconnected. If the hostname is not given, the most efficient\nway of communicating to a server on the same machine will be\nused.</p>\n\n<p style=\"margin-left:11%;\"><i>displaynumber</i></p>\n\n<p style=\"margin-left:23%;\">The phrase &quot;display&quot;\nis usually used to refer to a collection of monitors that\nshare a common set of input devices (keyboard, mouse,\ntablet, etc.). Most workstations tend to only have one\ndisplay. Larger, multi-user systems, however, frequently\nhave several displays so that more than one person can be\ndoing graphics work at once. To avoid confusion, each\ndisplay on a machine is assigned a <i>display number</i>\n(beginning at 0) when the X server for that display is\nstarted. The display number must always be given in a\ndisplay name.</p>\n\n<p style=\"margin-left:11%;\"><i>screennumber</i></p>\n\n<p style=\"margin-left:23%;\">Some displays share their input\ndevices among two or more monitors. These may be configured\nas a single logical screen, which allows windows to move\nacross screens, or as individual screens, each with their\nown set of windows. If configured such that each monitor has\nits own set of windows, each screen is assigned a <i>screen\nnumber</i> (beginning at 0) when the X server for that\ndisplay is started. If the screen number is not given,\nscreen 0 will be used.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">On POSIX\nsystems, the default display name is stored in your DISPLAY\nenvironment variable. This variable is set automatically by\nthe <i>xterm</i> terminal emulator. However, when you log\ninto another machine on a network, you may need to set\nDISPLAY by hand to point to your display. For example,</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">% setenv\nDISPLAY myws:0 <br>\n$ DISPLAY=myws:0; export DISPLAY</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The <i>ssh</i>\nprogram can be used to start an X program on a remote\nmachine; it automatically sets the DISPLAY variable\ncorrectly.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Finally, most X\nprograms accept a command line option of <b>-display</b>\n<i>displayname</i> to temporarily override the contents of\nDISPLAY. This is most commonly used to pop windows on\nanother person&rsquo;s screen or as part of a &quot;remote\nshell&quot; command to start an xterm pointing back to your\ndisplay. For example,</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">% xeyes\n-display joesws:0 -geometry 1000x1000+0+0 <br>\n% rsh big xterm -display myws:0 -ls &lt;/dev/null &amp;</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">X servers\nlisten for connections on a variety of different\ncommunications channels (network byte streams, shared\nmemory, etc.). Since there can be more than one way of\ncontacting a given server, The <i>hostname</i> part of the\ndisplay name is used to determine the type of channel (also\ncalled a transport layer) to be used. X servers generally\nsupport the following types of connections:</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p><i>local</i></p></td>\n<td width=\"5%\"></td>\n<td width=\"77%\">\n\n\n<p>The hostname part of the display name should be the\nempty string. For example: <i>:0</i>, <i>:1</i>, and\n<i>:0.1</i>. The most efficient local transport will be\nchosen.</p> </td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p><i>TCPIP</i></p></td>\n<td width=\"5%\"></td>\n<td width=\"77%\">\n\n\n<p>The hostname part of the display name should be the\nserver machine&rsquo;s hostname or IP address. Full Internet\nnames, abbreviated names, IPv4 addresses, and IPv6 addresses\nare all allowed. For example: <i>x.org:0</i>, <i>expo:0</i>,\n<i>[::1]:0</i>, <i>198.112.45.11:0</i>, <i>bigmachine:1</i>,\nand <i>hydra:0.1</i>.</p></td></tr>\n</table>\n\n<h2>ACCESS CONTROL\n<a name=\"ACCESS CONTROL\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">An X server can\nuse several types of access control. Mechanisms provided in\nRelease 7 are:</p>\n\n\n<p align=\"center\" style=\"margin-top: 1em\"><img src=\"grohtml-3532632.png\" alt=\"Image grohtml-3532632.png\"></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><i>Xdm</i>\ninitializes access control for the server and also places\nauthorization information in a file accessible to the\nuser.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Normally, the\nlist of hosts from which connections are always accepted\nshould be empty, so that only clients with are explicitly\nauthorized can connect to the display. When you add entries\nto the host list (with <i>xhost</i>), the server no longer\nperforms any authorization on connections from those\nmachines. Be careful with this.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The file from\nwhich <i>Xlib</i> extracts authorization data can be\nspecified with the environment variable <b>XAUTHORITY</b>,\nand defaults to the file <b>.Xauthority</b> in the home\ndirectory. <i>Xdm</i> uses <b>$HOME/.Xauthority</b> and will\ncreate it or merge in authorization records if it already\nexists when a user logs in.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If you use\nseveral machines and share a common home directory across\nall of the machines by means of a network file system, you\nnever really have to worry about authorization files, the\nsystem should work correctly by default. Otherwise, as the\nauthorization files are machine-independent, you can simply\ncopy the files to share them. To manage authorization files,\nuse <i>xauth</i>. This program allows you to extract records\nand insert them into other files. Using this, you can send\nauthorization to remote machines when you login, if the\nremote machine does not share a common home directory with\nyour local machine. Note that authorization information\ntransmitted &rsquo;&rsquo;in the clear&rsquo;&rsquo; through\na network file system or using <i>ftp</i> or <i>rcp</i> can\nbe &rsquo;&rsquo;stolen&rsquo;&rsquo; by a network\neavesdropper, and as such may enable unauthorized access. In\nmany environments, this level of security is not a concern,\nbut if it is, you need to know the exact semantics of the\nparticular authorization data to know if this is actually a\nproblem.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">For more\ninformation on access control, see the <i>Xsecurity</i>(7)\nmanual page.</p>\n\n<h2>GEOMETRY SPECIFICATIONS\n<a name=\"GEOMETRY SPECIFICATIONS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">One of the\nadvantages of using window systems instead of hardwired\nterminals is that applications don&rsquo;t have to be\nrestricted to a particular size or location on the screen.\nAlthough the layout of windows on a display is controlled by\nthe window manager that the user is running (described\nbelow), most X programs accept a command line argument of\nthe form <b>-geometry</b> <i>WIDTHxHEIGHT+XOFF+YOFF</i>\n(where <i>WIDTH</i>, <i>HEIGHT</i>, <i>XOFF</i>, and\n<i>YOFF</i> are numbers) for specifying a preferred size and\nlocation for this application&rsquo;s main window.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n<i>WIDTH</i> and <i>HEIGHT</i> parts of the geometry\nspecification are usually measured in either pixels or\ncharacters, depending on the application. The <i>XOFF</i>\nand <i>YOFF</i> parts are measured in pixels and are used to\nspecify the distance of the window from the left or right\nand top and bottom edges of the screen, respectively. Both\ntypes of offsets are measured from the indicated edge of the\nscreen to the corresponding edge of the window. The X offset\nmay be specified in the following ways:</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p style=\"margin-top: 1em\"><i>+XOFF</i></p></td>\n<td width=\"5%\"></td>\n<td width=\"77%\">\n\n\n<p style=\"margin-top: 1em\">The left edge of the window is\nto be placed <i>XOFF</i> pixels in from the left edge of the\nscreen (i.e., the X coordinate of the window&rsquo;s origin\nwill be <i>XOFF</i>). <i>XOFF</i> may be negative, in which\ncase the window&rsquo;s left edge will be off the\nscreen.</p> </td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p><i>-XOFF</i></p></td>\n<td width=\"5%\"></td>\n<td width=\"77%\">\n\n\n<p>The right edge of the window is to be placed <i>XOFF</i>\npixels in from the right edge of the screen. <i>XOFF</i> may\nbe negative, in which case the window&rsquo;s right edge\nwill be off the screen.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The Y offset\nhas similar meanings:</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p style=\"margin-top: 1em\"><i>+YOFF</i></p></td>\n<td width=\"5%\"></td>\n<td width=\"77%\">\n\n\n<p style=\"margin-top: 1em\">The top edge of the window is to\nbe <i>YOFF</i> pixels below the top edge of the screen\n(i.e., the Y coordinate of the window&rsquo;s origin will be\n<i>YOFF</i>). <i>YOFF</i> may be negative, in which case the\nwindow&rsquo;s top edge will be off the screen.</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p><i>-YOFF</i></p></td>\n<td width=\"5%\"></td>\n<td width=\"77%\">\n\n\n<p>The bottom edge of the window is to be <i>YOFF</i>\npixels above the bottom edge of the screen. <i>YOFF</i> may\nbe negative, in which case the window&rsquo;s bottom edge\nwill be off the screen.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Offsets must be\ngiven as pairs; in other words, in order to specify either\n<i>XOFF</i> or <i>YOFF</i> both must be present. Windows can\nbe placed in the four corners of the screen using the\nfollowing specifications:</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"6%\">\n\n\n<p style=\"margin-top: 1em\"><i>+0+0</i></p></td>\n<td width=\"6%\"></td>\n<td width=\"37%\">\n\n\n<p style=\"margin-top: 1em\">upper left hand corner.</p></td>\n<td width=\"40%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"6%\">\n\n\n<p><i>-0+0</i></p></td>\n<td width=\"6%\"></td>\n<td width=\"37%\">\n\n\n<p>upper right hand corner.</p></td>\n<td width=\"40%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"6%\">\n\n\n<p><i>-0-0</i></p></td>\n<td width=\"6%\"></td>\n<td width=\"37%\">\n\n\n<p>lower right hand corner.</p></td>\n<td width=\"40%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"6%\">\n\n\n<p><i>+0-0</i></p></td>\n<td width=\"6%\"></td>\n<td width=\"37%\">\n\n\n<p>lower left hand corner.</p></td>\n<td width=\"40%\">\n</td></tr>\n</table>\n\n<p style=\"margin-left:11%; margin-top: 1em\">In the\nfollowing examples, a terminal emulator is placed in roughly\nthe center of the screen and a load average monitor,\nmailbox, and clock are placed in the upper right hand\ncorner:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">xterm -fn 6x10\n-geometry 80x24+30+200 &amp; <br>\nxclock -geometry 48x48-0+0 &amp; <br>\nxload -geometry 48x48-96+0 &amp; <br>\nxbiff -geometry 48x48-48+0 &amp;</p>\n\n<h2>WINDOW MANAGERS\n<a name=\"WINDOW MANAGERS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The layout of\nwindows on the screen is controlled by special programs\ncalled <i>window managers</i>. Although many window managers\nwill honor geometry specifications as given, others may\nchoose to ignore them (requiring the user to explicitly draw\nthe window&rsquo;s region on the screen with the pointer,\nfor example).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Since window\nmanagers are regular (albeit complex) client programs, a\nvariety of different user interfaces can be built. The X.Org\nFoundation distribution comes with a window manager named\n<i>twm</i> which supports overlapping windows, popup menus,\npoint-and-click or click-to-type input models, title bars,\nnice icons (and an icon manager for those who don&rsquo;t\nlike separate icon windows).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">See the\nuser-contributed software in the X.Org Foundation\ndistribution for other popular window managers.</p>\n\n<h2>FONT NAMES\n<a name=\"FONT NAMES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Collections of\ncharacters for displaying text and symbols in X are known as\n<i>fonts</i>. A font typically contains images that share a\ncommon appearance and look nice together (for example, a\nsingle size, boldness, slant, and character set). Similarly,\ncollections of fonts that are based on a common type face\n(the variations are usually called roman, bold, italic, bold\nitalic, oblique, and bold oblique) are called\n<i>families</i>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Fonts come in\nvarious sizes. The X server supports <i>scalable</i> fonts,\nmeaning it is possible to create a font of arbitrary size\nfrom a single source for the font. The server supports\nscaling from <i>outline</i> fonts and <i>bitmap</i> fonts.\nScaling from outline fonts usually produces significantly\nbetter results than scaling from bitmap fonts.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">An X server can\nobtain fonts from individual files stored in directories in\nthe file system, or from one or more font servers, or from a\nmixtures of directories and font servers. The list of places\nthe server looks when trying to find a font is controlled by\nits <i>font path</i>. Although most installations will\nchoose to have the server start up with all of the commonly\nused font directories in the font path, the font path can be\nchanged at any time with the <i>xset</i> program. However,\nit is important to remember that the directory names are on\nthe <b>server</b>&rsquo;s machine, not on the\napplication&rsquo;s.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Bitmap font\nfiles are usually created by compiling a textual font\ndescription into binary form, using <i>bdftopcf</i>. Font\ndatabases are created by running the <i>mkfontdir</i>\nprogram in the directory containing the source or compiled\nversions of the fonts. Whenever fonts are added to a\ndirectory, <i>mkfontdir</i> should be rerun so that the\nserver can find the new fonts. To make the server reread the\nfont database, reset the font path with the <i>xset</i>\nprogram. For example, to add a font to a private directory,\nthe following commands could be used:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">% cp\nnewfont.pcf ~/myfonts <br>\n% mkfontdir ~/myfonts <br>\n% xset fp rehash</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n<i>xfontsel</i> and <i>xlsfonts</i> programs can be used to\nbrowse through the fonts available on a server. Font names\ntend to be fairly long as they contain all of the\ninformation needed to uniquely identify individual fonts.\nHowever, the X server supports wildcarding of font names, so\nthe full specification</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><i>-adobe-courier-medium-r-normal--10-100-75-75-m-60-iso8859-1</i></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">might be\nabbreviated as:</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><i>-*-courier-medium-r-normal--*-100-*-*-*-*-iso8859-1</i></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Because the\nshell also has special meanings for <i>*</i> and <i>?</i>,\nwildcarded font names should be quoted:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">% xlsfonts -fn\n&rsquo;-*-courier-medium-r-normal--*-100-*-*-*-*-*-*&rsquo;</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n<i>xlsfonts</i> program can be used to list all of the fonts\nthat match a given pattern. With no arguments, it lists all\navailable fonts. This will usually list the same font at\nmany different sizes. To see just the base scalable font\nnames, try using one of the following patterns:</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><i>-*-*-*-*-*-*-0-0-0-0-*-0-*-*\n<br>\n-*-*-*-*-*-*-0-0-75-75-*-0-*-* <br>\n-*-*-*-*-*-*-0-0-100-100-*-0-*-*</i></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To convert one\nof the resulting names into a font at a specific size,\nreplace one of the first two zeros with a nonzero value. The\nfield containing the first zero is for the pixel size;\nreplace it with a specific height in pixels to name a font\nat that size. Alternatively, the field containing the second\nzero is for the point size; replace it with a specific size\nin decipoints (there are 722.7 decipoints to the inch) to\nname a font at that size. The last zero is an average width\nfield, measured in tenths of pixels; some servers will\nanamorphically scale if this value is specified.</p>\n\n<h2>FONT SERVER NAMES\n<a name=\"FONT SERVER NAMES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">One of the\nfollowing forms can be used to name a font server that\naccepts TCP connections:</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">tcp/<i>hostname</i>:<i>port</i>\n<br>\ntcp/<i>hostname</i>:<i>port</i>/<i>cataloguelist</i></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n<i>hostname</i> specifies the name (or decimal numeric\naddress) of the machine on which the font server is running.\nThe <i>port</i> is the decimal TCP port on which the font\nserver is listening for connections. The\n<i>cataloguelist</i> specifies a list of catalogue names,\nwith &rsquo;+&rsquo; as a separator.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Examples:\n<i>tcp/x.org:7100</i>,\n<i>tcp/198.112.45.11:7100/all</i>.</p>\n\n<h2>COLOR NAMES\n<a name=\"COLOR NAMES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Most\napplications provide ways of tailoring (usually through\nresources or command line arguments) the colors of various\nelements in the text and graphics they display. A color can\nbe specified either by an abstract color name, or by a\nnumerical color specification. The numerical specification\ncan identify a color in either device-dependent (RGB) or\ndevice-independent terms. Color strings are\ncase-insensitive.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">X supports the\nuse of abstract color names, for example, &quot;red&quot;,\n&quot;blue&quot;. A value for this abstract name is obtained\nby searching one or more color name databases. <i>Xlib</i>\nfirst searches zero or more client-side databases; the\nnumber, location, and content of these databases is\nimplementation dependent. If the name is not found, the\ncolor is looked up in the X server&rsquo;s database. The\ntext form of this database is commonly stored in the file\n<i>usr/share/X11/rgb.txt</i>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A numerical\ncolor specification consists of a color space name and a set\nof values in the following syntax:</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><i>&lt;color_space_name&gt;</i>:<i>&lt;value&gt;/.../&lt;value&gt;</i></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">An RGB Device\nspecification is identified by the prefix &quot;rgb:&quot;\nand has the following syntax:</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">rgb:<i>&lt;red&gt;/&lt;green&gt;/&lt;blue&gt;</i></p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><i>&lt;red&gt;</i>,\n<i>&lt;green&gt;</i>, <i>&lt;blue&gt;</i> := <i>h</i> |\n<i>hh</i> | <i>hhh</i> | <i>hhhh <br>\nh</i> := single hexadecimal digits</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Note that\n<i>h</i> indicates the value scaled in 4 bits, <i>hh</i> the\nvalue scaled in 8 bits, <i>hhh</i> the value scaled in 12\nbits, and <i>hhhh</i> the value scaled in 16 bits,\nrespectively. These values are passed directly to the X\nserver, and are assumed to be gamma corrected.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The eight\nprimary colors can be represented as:</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\">\n</td>\n<td width=\"8%\"></td>\n<td width=\"77%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"8%\">\n</td>\n<td width=\"77%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"8%\">\n</td>\n<td width=\"77%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"8%\"></td>\n<td width=\"77%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"8%\">\n</td>\n<td width=\"77%\">\n</td></tr>\n</table>\n\n\n<p align=\"center\"><img src=\"grohtml-3532633.png\" alt=\"Image grohtml-3532633.png\"></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">For backward\ncompatibility, an older syntax for RGB Device is supported,\nbut its continued use is not encouraged. The syntax is an\ninitial sharp sign character followed by a numeric\nspecification, in one of the following formats:</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"15%\"></td>\n<td width=\"8%\"></td>\n<td width=\"8%\">\n</td>\n<td width=\"69%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"15%\"></td>\n<td width=\"8%\"></td>\n<td width=\"8%\">\n</td>\n<td width=\"69%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"15%\"></td>\n<td width=\"8%\"></td>\n<td width=\"8%\"></td>\n<td width=\"69%\">\n</td></tr>\n</table>\n\n\n<p align=\"center\"><img src=\"grohtml-3532634.png\" alt=\"Image grohtml-3532634.png\"></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The R, G, and B\nrepresent single hexadecimal digits. When fewer than 16 bits\neach are specified, they represent the most-significant bits\nof the value (unlike the &quot;rgb:&quot; syntax, in which\nvalues are scaled). For example, #3a7 is the same as\n#3000a0007000.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">An RGB\nintensity specification is identified by the prefix\n&quot;rgbi:&quot; and has the following syntax:</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">rgbi:<i>&lt;red&gt;/&lt;green&gt;/&lt;blue&gt;</i></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The red, green,\nand blue are floating point values between 0.0 and 1.0,\ninclusive. They represent linear intensity values, with 1.0\nindicating full intensity, 0.5 half intensity, and so on.\nThese values will be gamma corrected by <i>Xlib</i> before\nbeing sent to the X server. The input format for these\nvalues is an optional sign, a string of numbers possibly\ncontaining a decimal point, and an optional exponent field\ncontaining an E or e followed by a possibly signed integer\nstring.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The standard\ndevice-independent string specifications have the following\nsyntax:</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"31%\"></td>\n<td width=\"7%\"></td>\n<td width=\"62%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"31%\"></td>\n<td width=\"7%\"></td>\n<td width=\"62%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"31%\"></td>\n<td width=\"7%\"></td>\n<td width=\"62%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"31%\"></td>\n<td width=\"7%\"></td>\n<td width=\"62%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"31%\"></td>\n<td width=\"7%\"></td>\n<td width=\"62%\">\n</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"31%\"></td>\n<td width=\"7%\"></td>\n<td width=\"62%\">\n</td></tr>\n</table>\n\n\n<p align=\"center\"><img src=\"grohtml-3532635.png\" alt=\"Image grohtml-3532635.png\"></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">All of the\nvalues (C, H, V, X, Y, Z, a, b, u, v, y, x) are floating\npoint values. Some of the values are constrained to be\nbetween zero and some upper bound; the upper bounds are\ngiven in parentheses above. The syntax for these values is\nan optional &rsquo;+&rsquo; or &rsquo;-&rsquo; sign, a\nstring of digits possibly containing a decimal point, and an\noptional exponent field consisting of an &rsquo;E&rsquo; or\n&rsquo;e&rsquo; followed by an optional &rsquo;+&rsquo; or\n&rsquo;-&rsquo; followed by a string of digits.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">For more\ninformation on device independent color, see the <i>Xlib</i>\nreference manual.</p>\n\n<h2>KEYBOARDS\n<a name=\"KEYBOARDS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The X keyboard\nmodel is broken into two layers: server-specific codes\n(called <i>keycodes</i>) which represent the physical keys,\nand server-independent symbols (called <i>keysyms</i>) which\nrepresent the letters or words that appear on the keys. Two\ntables are kept in the server for converting keycodes to\nkeysyms: <i><br>\nmodifier list</i></p>\n\n<p style=\"margin-left:23%;\">Some keys (such as Shift,\nControl, and Caps Lock) are known as <i>modifier</i> and are\nused to select different symbols that are attached to a\nsingle key (such as Shift-a generates a capital A, and\nControl-l generates a control character ^L). The server\nkeeps a list of keycodes corresponding to the various\nmodifier keys. Whenever a key is pressed or released, the\nserver generates an <i>event</i> that contains the keycode\nof the indicated key as well as a mask that specifies which\nof the modifier keys are currently pressed. Most servers set\nup this list to initially contain the various shift,\ncontrol, and shift lock keys on the keyboard.</p>\n\n<p style=\"margin-left:11%;\"><i>keymap table</i></p>\n\n<p style=\"margin-left:23%;\">Applications translate event\nkeycodes and modifier masks into keysyms using a <i>keysym\ntable</i> which contains one row for each keycode and one\ncolumn for various modifier states. This table is\ninitialized by the server to correspond to normal typewriter\nconventions. The exact semantics of how the table is\ninterpreted to produce keysyms depends on the particular\nprogram, libraries, and language input method used, but the\nfollowing conventions for the first four keysyms in each row\nare generally adhered to:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The first four\nelements of the list are split into two groups of keysyms.\nGroup 1 contains the first and second keysyms; Group 2\ncontains the third and fourth keysyms. Within each group, if\nthe first element is alphabetic and the the second element\nis the special keysym <i>NoSymbol</i>, then the group is\ntreated as equivalent to a group in which the first element\nis the lowercase letter and the second element is the\nuppercase letter.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Switching\nbetween groups is controlled by the keysym named MODE\nSWITCH, by attaching that keysym to some key and attaching\nthat key to any one of the modifiers Mod1 through Mod5. This\nmodifier is called the &rsquo;&rsquo;group\nmodifier.&rsquo;&rsquo; Group 1 is used when the group\nmodifier is off, and Group 2 is used when the group modifier\nis on.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Within a group,\nthe modifier state determines which keysym to use. The first\nkeysym is used when the Shift and Lock modifiers are off.\nThe second keysym is used when the Shift modifier is on,\nwhen the Lock modifier is on and the second keysym is\nuppercase alphabetic, or when the Lock modifier is on and is\ninterpreted as ShiftLock. Otherwise, when the Lock modifier\nis on and is interpreted as CapsLock, the state of the Shift\nmodifier is applied first to select a keysym; but if that\nkeysym is lowercase alphabetic, then the corresponding\nuppercase keysym is used instead.</p>\n\n<h2>OPTIONS\n<a name=\"OPTIONS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Most X programs\nattempt to use the same names for command line options and\narguments. All applications written with the X Toolkit\nIntrinsics automatically accept the following options:\n<b><br>\n-display</b> <i>display</i></p>\n\n<p style=\"margin-left:23%;\">This option specifies the name\nof the X server to use.</p>\n\n<p style=\"margin-left:11%;\"><b>-geometry</b>\n<i>geometry</i></p>\n\n<p style=\"margin-left:23%;\">This option specifies the\ninitial size and location of the window.</p>\n\n<p style=\"margin-left:11%;\"><b>-bg</b> <i>color</i><b>,\n-background</b> <i>color</i></p>\n\n<p style=\"margin-left:23%;\">Either option specifies the\ncolor to use for the window background.</p>\n\n<p style=\"margin-left:11%;\"><b>-bd</b> <i>color</i><b>,\n-bordercolor</b> <i>color</i></p>\n\n<p style=\"margin-left:23%;\">Either option specifies the\ncolor to use for the window border.</p>\n\n<p style=\"margin-left:11%;\"><b>-bw</b> <i>number</i><b>,\n-borderwidth</b> <i>number</i></p>\n\n<p style=\"margin-left:23%;\">Either option specifies the\nwidth in pixels of the window border.</p>\n\n<p style=\"margin-left:11%;\"><b>-fg</b> <i>color</i><b>,\n-foreground</b> <i>color</i></p>\n\n<p style=\"margin-left:23%;\">Either option specifies the\ncolor to use for text or graphics.</p>\n\n<p style=\"margin-left:11%;\"><b>-fn</b> <i>font</i><b>,\n-font</b> <i>font</i></p>\n\n<p style=\"margin-left:23%;\">Either option specifies the\nfont to use for displaying text.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"11%\">\n\n\n<p><b>-iconic</b></p></td>\n<td width=\"1%\"></td>\n<td width=\"77%\">\n\n\n<p>This option indicates that the user would prefer that\nthe application&rsquo;s windows initially not be visible as\nif the windows had be immediately iconified by the user.\nWindow managers may choose not to honor the\napplication&rsquo;s request.</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"11%\">\n\n\n<p><b>-name</b></p></td>\n<td width=\"1%\"></td>\n<td width=\"77%\">\n\n\n<p>This option specifies the name under which resources for\nthe application should be found. This option is useful in\nshell aliases to distinguish between invocations of an\napplication, without resorting to creating links to alter\nthe executable file name.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-rv</b>, <b>-reverse</b></p>\n\n<p style=\"margin-left:23%;\">Either option indicates that\nthe program should simulate reverse video if possible, often\nby swapping the foreground and background colors. Not all\nprograms honor this or implement it correctly. It is usually\nonly used on monochrome displays.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"4%\">\n\n\n<p><b>+rv</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"77%\">\n\n\n<p>This option indicates that the program should not\nsimulate reverse video. This is used to override any\ndefaults since reverse video doesn&rsquo;t always work\nproperly.</p> </td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-selectionTimeout</b></p>\n\n<p style=\"margin-left:23%;\">This option specifies the\ntimeout in milliseconds within which two communicating\napplications must respond to one another for a selection\nrequest.</p>\n\n<p style=\"margin-left:11%;\"><b>-synchronous</b></p>\n\n<p style=\"margin-left:23%;\">This option indicates that\nrequests to the X server should be sent synchronously,\ninstead of asynchronously. Since <i>Xlib</i> normally\nbuffers requests to the server, errors do not necessarily\nget reported immediately after they occur. This option turns\noff the buffering so that the application can be debugged.\nIt should never be used with a working program.</p>\n\n<p style=\"margin-left:11%;\"><b>-title</b> <i>string</i></p>\n\n<p style=\"margin-left:23%;\">This option specifies the title\nto be used for this window. This information is sometimes\nused by a window manager to provide some sort of header\nidentifying the window.</p>\n\n<p style=\"margin-left:11%;\"><b>-xnllanguage</b>\n<i>language[_territory][.codeset]</i></p>\n\n<p style=\"margin-left:23%;\">This option specifies the\nlanguage, territory, and codeset for use in resolving\nresource and other filenames.</p>\n\n<p style=\"margin-left:11%;\"><b>-xrm</b>\n<i>resourcestring</i></p>\n\n<p style=\"margin-left:23%;\">This option specifies a\nresource name and value to override any defaults. It is also\nvery useful for setting resources that don&rsquo;t have\nexplicit command line arguments.</p>\n\n<h2>RESOURCES\n<a name=\"RESOURCES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">To make the\ntailoring of applications to personal preferences easier, X\nprovides a mechanism for storing default values for program\nresources (e.g. background color, window title, etc.) that\nis used by programs that use toolkits based on the X Toolkit\nIntrinsics library libXt. (Programs using the common Gtk+\nand Qt toolkits use other configuration mechanisms.)\nResources are specified as strings that are read in from\nvarious places when an application is run. Program\ncomponents are named in a hierarchical fashion, with each\nnode in the hierarchy identified by a class and an instance\nname. At the top level is the class and instance name of the\napplication itself. By convention, the class name of the\napplication is the same as the program name, but with the\nfirst letter capitalized (e.g. <i>Bitmap</i> or\n<i>Emacs</i>) although some programs that begin with the\nletter &rsquo;&rsquo;x&rsquo;&rsquo; also capitalize the\nsecond letter for historical reasons.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The precise\nsyntax for resources is:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">ResourceLine =\nComment | IncludeFile | ResourceSpec | &lt;empty line&gt;\n<br>\nComment = &quot;!&quot; {&lt;any character except null or\nnewline&gt;} <br>\nIncludeFile = &quot;#&quot; WhiteSpace &quot;include&quot;\nWhiteSpace FileName WhiteSpace <br>\nFileName = &lt;valid filename for operating system&gt; <br>\nResourceSpec = WhiteSpace ResourceName WhiteSpace\n&quot;:&quot; WhiteSpace Value <br>\nResourceName = [Binding] {Component Binding} ComponentName\n<br>\nBinding = &quot;.&quot; | &quot;*&quot; <br>\nWhiteSpace = {&lt;space&gt; | &lt;horizontal tab&gt;} <br>\nComponent = &quot;?&quot; | ComponentName <br>\nComponentName = NameChar {NameChar} <br>\nNameChar = &quot;a&quot;-&quot;z&quot; |\n&quot;A&quot;-&quot;Z&quot; | &quot;0&quot;-&quot;9&quot; |\n&quot;_&quot; | &quot;-&quot; <br>\nValue = {&lt;any character except null or unescaped\nnewline&gt;}</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Elements\nseparated by vertical bar (|) are alternatives. Curly braces\n({...}) indicate zero or more repetitions of the enclosed\nelements. Square brackets ([...]) indicate that the enclosed\nelement is optional. Quotes (&quot;...&quot;) are used\naround literal characters.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">IncludeFile\nlines are interpreted by replacing the line with the\ncontents of the specified file. The word &quot;include&quot;\nmust be in lowercase. The filename is interpreted relative\nto the directory of the file in which the line occurs (for\nexample, if the filename contains no directory or contains a\nrelative directory specification).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If a\nResourceName contains a contiguous sequence of two or more\nBinding characters, the sequence will be replaced with\nsingle &quot;.&quot; character if the sequence contains only\n&quot;.&quot; characters, otherwise the sequence will be\nreplaced with a single &quot;*&quot; character.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A resource\ndatabase never contains more than one entry for a given\nResourceName. If a resource file contains multiple lines\nwith the same ResourceName, the last line in the file is\nused.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Any whitespace\ncharacter before or after the name or colon in a\nResourceSpec are ignored. To allow a Value to begin with\nwhitespace, the two-character sequence\n&rsquo;&rsquo;\\<i>space</i>&rsquo;&rsquo; (backslash\nfollowed by space) is recognized and replaced by a space\ncharacter, and the two-character sequence\n&rsquo;&rsquo;\\<i>tab</i>&rsquo;&rsquo; (backslash followed\nby horizontal tab) is recognized and replaced by a\nhorizontal tab character. To allow a Value to contain\nembedded newline characters, the two-character sequence\n&rsquo;&rsquo;\\n&rsquo;&rsquo; is recognized and replaced by\na newline character. To allow a Value to be broken across\nmultiple lines in a text file, the two-character sequence\n&rsquo;&rsquo;\\<i>newline</i>&rsquo;&rsquo; (backslash\nfollowed by newline) is recognized and removed from the\nvalue. To allow a Value to contain arbitrary character\ncodes, the four-character sequence\n&rsquo;&rsquo;\\<i>nnn</i>&rsquo;&rsquo;, where each <i>n</i>\nis a digit character in the range of\n&rsquo;&rsquo;0&rsquo;&rsquo;-&rsquo;&rsquo;7&rsquo;&rsquo;,\nis recognized and replaced with a single byte that contains\nthe octal value specified by the sequence. Finally, the\ntwo-character sequence &rsquo;&rsquo;\\\\&rsquo;&rsquo; is\nrecognized and replaced with a single backslash.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">When an\napplication looks for the value of a resource, it specifies\na complete path in the hierarchy, with both class and\ninstance names. However, resource values are usually given\nwith only partially specified names and classes, using\npattern matching constructs. An asterisk (*) is a loose\nbinding and is used to represent any number of intervening\ncomponents, including none. A period (.) is a tight binding\nand is used to separate immediately adjacent components. A\nquestion mark (?) is used to match any single component name\nor class. A database entry cannot end in a loose binding;\nthe final component (which cannot be &quot;?&quot;) must be\nspecified. The lookup algorithm searches the resource\ndatabase for the entry that most closely matches (is most\nspecific for) the full name and class being queried. When\nmore than one database entry matches the full name and\nclass, precedence rules are used to select just one.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The full name\nand class are scanned from left to right (from highest level\nin the hierarchy to lowest), one component at a time. At\neach level, the corresponding component and/or binding of\neach matching entry is determined, and these matching\ncomponents and bindings are compared according to precedence\nrules. Each of the rules is applied at each level, before\nmoving to the next level, until a rule selects a single\nentry over all others. The rules (in order of precedence)\nare:</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p>1.</p></td>\n<td width=\"4%\"></td>\n<td width=\"82%\">\n\n\n<p>An entry that contains a matching component (whether\nname, class, or &quot;?&quot;) takes precedence over entries\nthat elide the level (that is, entries that match the level\nin a loose binding).</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p>2.</p></td>\n<td width=\"4%\"></td>\n<td width=\"82%\">\n\n\n<p>An entry with a matching name takes precedence over both\nentries with a matching class and entries that match using\n&quot;?&quot;. An entry with a matching class takes\nprecedence over entries that match using &quot;?&quot;.</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p>3.</p></td>\n<td width=\"4%\"></td>\n<td width=\"82%\">\n\n\n<p>An entry preceded by a tight binding takes precedence\nover entries preceded by a loose binding.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Programs based\non the X Toolkit Intrinsics obtain resources from the\nfollowing sources (other programs usually support some\nsubset of these sources): <b><br>\nRESOURCE_MANAGER root window property</b></p>\n\n<p style=\"margin-left:23%;\">Any global resources that\nshould be available to clients on all machines should be\nstored in the RESOURCE_MANAGER property on the root window\nof the first screen using the <i>xrdb</i> program. This is\nfrequently taken care of when the user starts up X through\nthe display manager or <i>xinit</i>.</p>\n\n<p style=\"margin-left:11%;\"><b>SCREEN_RESOURCES root window\nproperty</b></p>\n\n<p style=\"margin-left:23%;\">Any resources specific to a\ngiven screen (e.g. colors) that should be available to\nclients on all machines should be stored in the\nSCREEN_RESOURCES property on the root window of that screen.\nThe <i>xrdb</i> program will sort resources automatically\nand place them in RESOURCE_MANAGER or SCREEN_RESOURCES, as\nappropriate.</p>\n\n<p style=\"margin-left:11%;\"><b>application-specific\nfiles</b></p>\n\n<p style=\"margin-left:23%;\">Directories named by the\nenvironment variable XUSERFILESEARCHPATH or the environment\nvariable XAPPLRESDIR (which names a single directory and\nshould end with a &rsquo;/&rsquo; on POSIX systems), plus\ndirectories in a standard place (usually under\n/usr/share/X11/, but this can be overridden with the\nXFILESEARCHPATH environment variable) are searched for for\napplication-specific resources. For example, application\ndefault resources are usually kept in\n/usr/share/X11/app-defaults/. See the <i>X Toolkit\nIntrinsics - C Language Interface</i> manual for\ndetails.</p>\n\n<p style=\"margin-left:11%;\"><b>XENVIRONMENT</b></p>\n\n<p style=\"margin-left:23%;\">Any user- and machine-specific\nresources may be specified by setting the XENVIRONMENT\nenvironment variable to the name of a resource file to be\nloaded by all applications. If this variable is not defined,\na file named <i>$HOME</i>/.Xdefaults-<i>hostname</i> is\nlooked for instead, where <i>hostname</i> is the name of the\nhost where the application is executing.</p>\n\n<p style=\"margin-left:11%;\"><b>-xrm</b>\n<i>resourcestring</i></p>\n\n<p style=\"margin-left:23%;\">Resources can also be specified\nfrom the command line. The <i>resourcestring</i> is a single\nresource name and value as shown above. Note that if the\nstring contains characters interpreted by the shell (e.g.,\nasterisk), they must be quoted. Any number of <b>-xrm</b>\narguments may be given on the command line.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Program\nresources are organized into groups called <i>classes</i>,\nso that collections of individual resources (each of which\nare called <i>instances</i>) can be set all at once. By\nconvention, the instance name of a resource begins with a\nlowercase letter and class name with an upper case letter.\nMultiple word resources are concatenated with the first\nletter of the succeeding words capitalized. Applications\nwritten with the X Toolkit Intrinsics will have at least the\nfollowing resources: <b><br>\nbackground (</b>class <b>Background)</b></p>\n\n<p style=\"margin-left:23%;\">This resource specifies the\ncolor to use for the window background.</p>\n\n<p style=\"margin-left:11%;\"><b>borderWidth (</b>class\n<b>BorderWidth)</b></p>\n\n<p style=\"margin-left:23%;\">This resource specifies the\nwidth in pixels of the window border.</p>\n\n<p style=\"margin-left:11%;\"><b>borderColor (</b>class\n<b>BorderColor)</b></p>\n\n<p style=\"margin-left:23%;\">This resource specifies the\ncolor to use for the window border.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Most\napplications using the X Toolkit Intrinsics also have the\nresource <b>foreground</b> (class <b>Foreground</b>),\nspecifying the color to use for text and graphics within the\nwindow.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">By combining\nclass and instance specifications, application preferences\ncan be set quickly and easily. Users of color displays will\nfrequently want to set Background and Foreground classes to\nparticular defaults. Specific color instances such as text\ncursors can then be overridden without having to define all\nof the related resources. For example,</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">bitmap*Dashed:\noff <br>\nXTerm*cursorColor: gold <br>\nXTerm*multiScroll: on <br>\nXTerm*jumpScroll: on <br>\nXTerm*reverseWrap: on <br>\nXTerm*curses: on <br>\nXTerm*Font: 6x10 <br>\nXTerm*scrollBar: on <br>\nXTerm*scrollbar*thickness: 5 <br>\nXTerm*multiClickTime: 500 <br>\nXTerm*charClass: 33:48,37:48,45-47:48,64:48 <br>\nXTerm*cutNewline: off <br>\nXTerm*cutToBeginningOfLine: off <br>\nXTerm*titeInhibit: on <br>\nXTerm*ttyModes: intr ^c erase ^? kill ^u <br>\nXLoad*Background: gold <br>\nXLoad*Foreground: red <br>\nXLoad*highlight: black <br>\nXLoad*borderWidth: 0 <br>\nemacs*Geometry: 80x65-0-0 <br>\nemacs*Background: rgb:5b/76/86 <br>\nemacs*Foreground: white <br>\nemacs*Cursor: white <br>\nemacs*BorderColor: white <br>\nemacs*Font: 6x10 <br>\nxmag*geometry: -0-0 <br>\nxmag*borderColor: white</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If these\nresources were stored in a file called <i>.Xresources</i> in\nyour home directory, they could be added to any existing\nresources in the server with the following command:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">% xrdb -merge\n$HOME/.Xresources</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This is\nfrequently how user-friendly startup scripts merge\nuser-specific defaults into any site-wide defaults. All\nsites are encouraged to set up convenient ways of\nautomatically loading resources. See the <i>Xlib</i> manual\nsection <i>Resource Manager Functions</i> for more\ninformation.</p>\n\n<h2>ENVIRONMENT\n<a name=\"ENVIRONMENT\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>DISPLAY</b></p>\n\n<p style=\"margin-left:22%;\">This is the only mandatory\nenvironment variable. It must point to an X server. See\nsection &quot;Display Names&quot; above.</p>\n\n<p style=\"margin-left:11%;\"><b>XAUTHORITY</b></p>\n\n<p style=\"margin-left:22%;\">This must point to a file that\ncontains authorization data. The default is\n<i>$HOME/.Xauthority</i>. See <a href=\"https://man.page/7/Xsecurity\">Xsecurity(7)</a>,\n<a href=\"https://man.page/1/xauth\">xauth(1)</a>, <a href=\"https://man.page/1/xdm\">xdm(1)</a>, <a href=\"https://man.page/3/Xau\">Xau(3)</a>.</p>\n\n<p style=\"margin-left:11%;\"><b>ICEAUTHORITY</b></p>\n\n<p style=\"margin-left:22%;\">This must point to a file that\ncontains authorization data. The default is\n<i>$HOME/.ICEauthority</i>.</p>\n\n<p style=\"margin-left:11%;\"><b>LC_ALL</b>, <b>LC_CTYPE</b>,\n<b>LANG</b></p>\n\n<p style=\"margin-left:22%;\">The first non-empty value among\nthese three determines the current locale&rsquo;s facet for\ncharacter handling, and in particular the default text\nencoding. See <a href=\"https://man.page/7/locale\">locale(7)</a>, <a href=\"https://man.page/3/setlocale\">setlocale(3)</a>,\n<a href=\"https://man.page/1/locale\">locale(1)</a>.</p>\n\n<p style=\"margin-left:11%;\"><b>XMODIFIERS</b></p>\n\n<p style=\"margin-left:22%;\">This variable can be set to\ncontain additional information important for the current\nlocale setting. Typically set to\n<i>@im=&lt;input-method&gt;</i> to enable a particular input\nmethod. See <a href=\"https://man.page/3/XSetLocaleModifiers\">XSetLocaleModifiers(3)</a>.</p>\n\n<p style=\"margin-left:11%;\"><b>XLOCALEDIR</b></p>\n\n<p style=\"margin-left:22%;\">This must point to a directory\ncontaining the locale.alias file and Compose and XLC_LOCALE\nfile hierarchies for all locales. The default value is\n<i>/usr/share/X11/locale</i>.</p>\n\n<p style=\"margin-left:11%;\"><b>XENVIRONMENT</b></p>\n\n<p style=\"margin-left:22%;\">This must point to a file\ncontaining X resources. The default is\n<i>$HOME/.Xdefaults-&lt;hostname&gt;</i>. Unlike\n<i>$HOME/.Xresources</i>, it is consulted each time an X\napplication starts.</p>\n\n<p style=\"margin-left:11%;\"><b>XFILESEARCHPATH</b></p>\n\n<p style=\"margin-left:22%;\">This must contain a colon\nseparated list of path templates, where libXt will search\nfor resource files. The default value consists of</p>\n\n\n<p style=\"margin-left:22%; margin-top: 1em\">/etc/X11/%L/%T/%N%C%S:\\\n<br>\n/etc/X11/%l/%T/%N%C%S:\\ <br>\n/etc/X11/%T/%N%C%S:\\ <br>\n/etc/X11/%L/%T/%N%S:\\ <br>\n/etc/X11/%l/%T/%N%S:\\ <br>\n/etc/X11/%T/%N%S:\\ <br>\n/usr/share/X11/%L/%T/%N%C%S:\\ <br>\n/usr/share/X11/%l/%T/%N%C%S:\\ <br>\n/usr/share/X11/%T/%N%C%S:\\ <br>\n/usr/share/X11/%L/%T/%N%S:\\ <br>\n/usr/share/X11/%l/%T/%N%S:\\ <br>\n/usr/share/X11/%T/%N%S:\\ <br>\n/usr/lib/x86_64-linux-gnu/X11/%L/%T/%N%C%S:\\ <br>\n/usr/lib/x86_64-linux-gnu/X11/%l/%T/%N%C%S:\\ <br>\n/usr/lib/x86_64-linux-gnu/X11/%T/%N%C%S:\\ <br>\n/usr/lib/x86_64-linux-gnu/X11/%L/%T/%N%S:\\ <br>\n/usr/lib/x86_64-linux-gnu/X11/%l/%T/%N%S:\\ <br>\n/usr/lib/x86_64-linux-gnu/X11/%T/%N%S</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">A path template\nis transformed to a pathname by substituting:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">%D =&gt; the\nimplementation-specific default path <br>\n%N =&gt; name (basename) being searched for <br>\n%T =&gt; type (dirname) being searched for <br>\n%S =&gt; suffix being searched for <br>\n%C =&gt; value of the resource &quot;customization&quot;\n<br>\n(class &quot;Customization&quot;) <br>\n%L =&gt; the locale name <br>\n%l =&gt; the locale&rsquo;s language (part before\n&rsquo;_&rsquo;) <br>\n%t =&gt; the locale&rsquo;s territory (part after\n&rsquo;_&rsquo; but before &rsquo;.&rsquo;) <br>\n%c =&gt; the locale&rsquo;s encoding (part after\n&rsquo;.&rsquo;)</p>\n\n<p style=\"margin-left:11%;\"><b>XUSERFILESEARCHPATH</b></p>\n\n<p style=\"margin-left:22%;\">This must contain a colon\nseparated list of path templates, where libXt will search\nfor user dependent resource files. The default value is:</p>\n\n\n<p style=\"margin-left:22%; margin-top: 1em\">$XAPPLRESDIR/%L/%N%C:\\\n<br>\n$XAPPLRESDIR/%l/%N%C:\\ <br>\n$XAPPLRESDIR/%N%C:\\ <br>\n$HOME/%N%C:\\ <br>\n$XAPPLRESDIR/%L/%N:\\ <br>\n$XAPPLRESDIR/%l/%N:\\ <br>\n$XAPPLRESDIR/%N:\\ <br>\n$HOME/%N</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">$XAPPLRESDIR\ndefaults to <i>$HOME</i>, see below.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">A path template\nis transformed to a pathname by substituting:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">%D =&gt; the\nimplementation-specific default path <br>\n%N =&gt; name (basename) being searched for <br>\n%T =&gt; type (dirname) being searched for <br>\n%S =&gt; suffix being searched for <br>\n%C =&gt; value of the resource &quot;customization&quot;\n<br>\n(class &quot;Customization&quot;) <br>\n%L =&gt; the locale name <br>\n%l =&gt; the locale&rsquo;s language (part before\n&rsquo;_&rsquo;) <br>\n%t =&gt; the locale&rsquo;s territory (part after\n&rsquo;_&rsquo; but before &rsquo;.&rsquo;) <br>\n%c =&gt; the locale&rsquo;s encoding (part after\n&rsquo;.&rsquo;)</p>\n\n<p style=\"margin-left:11%;\"><b>XAPPLRESDIR</b></p>\n\n<p style=\"margin-left:22%;\">This must point to a base\ndirectory where the user stores the application dependent\nresource files. The default value is <i>$HOME</i>. Only used\nif XUSERFILESEARCHPATH is not set.</p>\n\n<p style=\"margin-left:11%;\"><b>XKEYSYMDB</b></p>\n\n<p style=\"margin-left:22%;\">This must point to a file\ncontaining nonstandard keysym definitions. The default value\nis <i>/usr/share/X11/XKeysymDB</i>.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>XCMSDB</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>This must point to a color name database file. The\ndefault value is</p></td></tr>\n</table>\n\n\n<p style=\"margin-left:22%;\"><i>/usr/lib/x86_64-linux-gnu/X11/Xcms.txt</i>.</p>\n\n<p style=\"margin-left:11%;\"><b>RESOURCE_NAME</b></p>\n\n<p style=\"margin-left:22%;\">This serves as main identifier\nfor resources belonging to the program being executed. It\ndefaults to the basename of pathname of the program.</p>\n\n<p style=\"margin-left:11%;\"><b>SESSION_MANAGER</b></p>\n\n<p style=\"margin-left:22%;\">Denotes the session manager to\nwhich the application should connect. See <a href=\"https://man.page/1/xsm\">xsm(1)</a>,\n<a href=\"https://man.page/1/rstart\">rstart(1)</a>.</p>\n\n<p style=\"margin-left:11%;\"><b>XF86BIGFONT_DISABLE</b></p>\n\n<p style=\"margin-left:22%;\">Setting this variable to a\nnon-empty value disables the XFree86-Bigfont extension. This\nextension is a mechanism to reduce the memory consumption of\nbig fonts by use of shared memory.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>XKB_FORCE\n<br>\nXKB_DISABLE <br>\nXKB_DEBUG <br>\n_XKB_CHARSET <br>\n_XKB_LOCALE_CHARSETS <br>\n_XKB_OPTIONS_ENABLE <br>\n_XKB_LATIN1_LOOKUP <br>\n_XKB_CONSUME_LOOKUP_MODS <br>\n_XKB_CONSUME_SHIFT_AND_LOCK <br>\n_XKB_IGNORE_NEW_KEYBOARDS <br>\n_XKB_CONTROL_FALLBACK <br>\n_XKB_COMP_LED _XKB_COMP_FAIL_BEEP</b></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">These variables\ninfluence the X Keyboard Extension.</p>\n\n<h2>EXAMPLES\n<a name=\"EXAMPLES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The following\nis a collection of sample command lines for some of the more\nfrequently used commands. For more information on a\nparticular command, please refer to that command&rsquo;s\nmanual page.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">% xrdb\n$HOME/.Xresources <br>\n% xmodmap -e &quot;keysym BackSpace = Delete&quot; <br>\n% mkfontdir /usr/local/lib/X11/otherfonts <br>\n% xset fp+ /usr/local/lib/X11/otherfonts <br>\n% xmodmap $HOME/.keymap.km <br>\n% xsetroot -solid &rsquo;rgbi:.8/.8/.8&rsquo; <br>\n% xset b 100 400 c 50 s 1800 r on <br>\n% xset q <br>\n% twm <br>\n% xmag <br>\n% xclock -geometry 48x48-0+0 -bg blue -fg white <br>\n% xeyes -geometry 48x48-48+0 <br>\n% xbiff -update 20 <br>\n% xlsfonts &rsquo;*helvetica*&rsquo; <br>\n% xwininfo -root <br>\n% xdpyinfo -display joesworkstation:0 <br>\n% xhost -joesworkstation <br>\n% xrefresh <br>\n% xwd | xwud <br>\n% bitmap companylogo.bm 32x32 <br>\n% xcalc -bg blue -fg magenta <br>\n% xterm -geometry 80x66-0-0 -name myxterm $*</p>\n\n<h2>DIAGNOSTICS\n<a name=\"DIAGNOSTICS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">A wide variety\nof error messages are generated from various programs. The\ndefault error handler in <i>Xlib</i> (also used by many\ntoolkits) uses standard resources to construct diagnostic\nmessages when errors occur. The defaults for these messages\nare usually stored in <i>usr/share/X11/XErrorDB</i>. If this\nfile is not present, error messages will be rather terse and\ncryptic.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">When the X\nToolkit Intrinsics encounter errors converting resource\nstrings to the appropriate internal format, no error\nmessages are usually printed. This is convenient when it is\ndesirable to have one set of resources across a variety of\ndisplays (e.g. color vs. monochrome, lots of fonts vs. very\nfew, etc.), although it can pose problems for trying to\ndetermine why an application might be failing. This behavior\ncan be overridden by the setting the\n<i>StringConversionWarnings</i> resource.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To force the X\nToolkit Intrinsics to always print string conversion error\nmessages, the following resource should be placed in the\nfile that gets loaded onto the RESOURCE_MANAGER property\nusing the <i>xrdb</i> program (frequently called\n<i>.Xresources</i> or <i>.Xres</i> in the user&rsquo;s home\ndirectory):</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">*StringConversionWarnings:\non</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To have\nconversion messages printed for just a particular\napplication, the appropriate instance name can be placed\nbefore the asterisk:</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">xterm*StringConversionWarnings:\non</p>\n\n<h2>SEE ALSO\n<a name=\"SEE ALSO\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><a href=\"https://man.page/7/XOrgFoundation\">XOrgFoundation(7)</a>,\n<a href=\"https://man.page/7/XStandards\">XStandards(7)</a>, <a href=\"https://man.page/7/Xsecurity\">Xsecurity(7)</a>, <a href=\"https://man.page/1/appres\">appres(1)</a>,\n<a href=\"https://man.page/1/bdftopcf\">bdftopcf(1)</a>, <a href=\"https://man.page/1/bitmap\">bitmap(1)</a>, <a href=\"https://man.page/1/editres\">editres(1)</a>,\n<a href=\"https://man.page/1/fsinfo\">fsinfo(1)</a>, <a href=\"https://man.page/1/fslsfonts\">fslsfonts(1)</a>, <a href=\"https://man.page/1/fstobdf\">fstobdf(1)</a>,\n<a href=\"https://man.page/1/iceauth\">iceauth(1)</a>, <a href=\"https://man.page/1/imake\">imake(1)</a>, <a href=\"https://man.page/1/makedepend\">makedepend(1)</a>,\n<a href=\"https://man.page/1/mkfontdir\">mkfontdir(1)</a>, <a href=\"https://man.page/1/oclock\">oclock(1)</a>, <a href=\"https://man.page/1/proxymngr\">proxymngr(1)</a>,\n<a href=\"https://man.page/1/rgb\">rgb(1)</a>, <a href=\"https://man.page/1/resize\">resize(1)</a>, <a href=\"https://man.page/1/rstart\">rstart(1)</a>,\n<a href=\"https://man.page/1/smproxy\">smproxy(1)</a>, <a href=\"https://man.page/1/twm\">twm(1)</a>, <a href=\"https://man.page/1/x11perf\">x11perf(1)</a>,\n<a href=\"https://man.page/1/x11perfcomp\">x11perfcomp(1)</a>, <a href=\"https://man.page/1/xauth\">xauth(1)</a>,\n<a href=\"https://man.page/1/xclipboard\">xclipboard(1)</a>, <a href=\"https://man.page/1/xclock\">xclock(1)</a>, <a href=\"https://man.page/1/xcmsdb\">xcmsdb(1)</a>,\n<a href=\"https://man.page/1/xconsole\">xconsole(1)</a>, <a href=\"https://man.page/1/xdm\">xdm(1)</a>, <a href=\"https://man.page/1/xdpyinfo\">xdpyinfo(1)</a>,\n<a href=\"https://man.page/1/xfd\">xfd(1)</a>, <a href=\"https://man.page/1/xfindproxy\">xfindproxy(1)</a>, <a href=\"https://man.page/1/xfs\">xfs(1)</a>,\n<a href=\"https://man.page/1/xfwp\">xfwp(1)</a>, <a href=\"https://man.page/1/xhost\">xhost(1)</a>, <a href=\"https://man.page/1/xinit\">xinit(1)</a>,\n<a href=\"https://man.page/1/xkbbell\">xkbbell(1)</a>, <a href=\"https://man.page/1/xkbcomp\">xkbcomp(1)</a>, <a href=\"https://man.page/1/xkbevd\">xkbevd(1)</a>,\n<a href=\"https://man.page/1/xkbprint\">xkbprint(1)</a>, <a href=\"https://man.page/1/xkbvleds\">xkbvleds(1)</a>, <a href=\"https://man.page/1/xkbwatch\">xkbwatch(1)</a>,\n<a href=\"https://man.page/1/xkill\">xkill(1)</a>, <a href=\"https://man.page/1/xlogo\">xlogo(1)</a>, <a href=\"https://man.page/1/xlsatoms\">xlsatoms(1)</a>,\n<a href=\"https://man.page/1/xlsclients\">xlsclients(1)</a>, <a href=\"https://man.page/1/xlsfonts\">xlsfonts(1)</a>, <a href=\"https://man.page/1/xmag\">xmag(1)</a>,\n<a href=\"https://man.page/1/xmh\">xmh(1)</a>, <a href=\"https://man.page/1/xmodmap\">xmodmap(1)</a>, <a href=\"https://man.page/1/xprop\">xprop(1)</a>,\n<a href=\"https://man.page/1/xrdb\">xrdb(1)</a>, <a href=\"https://man.page/1/xrefresh\">xrefresh(1)</a>, <a href=\"https://man.page/1/xrx\">xrx(1)</a>,\n<a href=\"https://man.page/1/xset\">xset(1)</a>, <a href=\"https://man.page/1/xsetroot\">xsetroot(1)</a>, <a href=\"https://man.page/1/xsm\">xsm(1)</a>,\n<a href=\"https://man.page/1/xstdcmap\">xstdcmap(1)</a>, <a href=\"https://man.page/1/xterm\">xterm(1)</a>, <a href=\"https://man.page/1/xwd\">xwd(1)</a>,\n<a href=\"https://man.page/1/xwininfo\">xwininfo(1)</a>, <a href=\"https://man.page/1/xwud\">xwud(1)</a>. <a href=\"https://man.page/1/Xserver\">Xserver(1)</a>,\n<a href=\"https://man.page/1/Xorg\">Xorg(1)</a>, <a href=\"https://man.page/1/Xdmx\">Xdmx(1)</a>, <a href=\"https://man.page/1/Xephyr\">Xephyr(1)</a>,\n<a href=\"https://man.page/1/Xnest\">Xnest(1)</a>, <a href=\"https://man.page/1/Xquartz\">Xquartz(1)</a>, <a href=\"https://man.page/1/Xvfb\">Xvfb(1)</a>,\n<a href=\"https://man.page/1/Xvnc\">Xvnc(1)</a>, <a href=\"https://man.page/1/XWin\">XWin(1)</a>. <i>Xlib - C Language X\nInterface</i>, and <i>X Toolkit Intrinsics - C Language\nInterface</i></p>\n\n<h2>TRADEMARKS\n<a name=\"TRADEMARKS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">X Window System\nis a trademark of The Open Group.</p>\n\n<h2>AUTHORS\n<a name=\"AUTHORS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">A cast of\nthousands, literally. Releases 6.7 and later are brought to\nyou by the X.Org Foundation. The names of all people who\nmade it a reality will be found in the individual documents\nand source files.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Releases 6.6\nand 6.5 were done by The X.Org Group. Release 6.4 was done\nby The X Project Team. The Release 6.3 distribution was from\nThe X Consortium, Inc. The staff members at the X Consortium\nresponsible for that release were: Donna Converse\n(emeritus), Stephen Gildea (emeritus), Kaleb Keithley, Matt\nLandau (emeritus), Ralph Mor (emeritus), Janet\nO&rsquo;Halloran, Bob Scheifler, Ralph Swick, Dave Wiggins\n(emeritus), and Reed Augliere.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The X Window\nSystem standard was originally developed at the Laboratory\nfor Computer Science at the Massachusetts Institute of\nTechnology, and all rights thereto were assigned to the X\nConsortium on January 1, 1994. X Consortium, Inc. closed its\ndoors on December 31, 1996. All rights to the X Window\nSystem have been assigned to The Open Group.</p>\n<hr>\n","headings":["<a href=\"#NAME\">NAME</a>","<a href=\"#OVERVIEW\">OVERVIEW</a>","<a href=\"#DESCRIPTION\">DESCRIPTION</a>","<a href=\"#STARTING UP\">STARTING UP</a>","<a href=\"#DISPLAY NAMES\">DISPLAY NAMES</a>","<a href=\"#ACCESS CONTROL\">ACCESS CONTROL</a>","<a href=\"#GEOMETRY SPECIFICATIONS\">GEOMETRY SPECIFICATIONS</a>","<a href=\"#WINDOW MANAGERS\">WINDOW MANAGERS</a>","<a href=\"#FONT NAMES\">FONT NAMES</a>","<a href=\"#FONT SERVER NAMES\">FONT SERVER NAMES</a>","<a href=\"#COLOR NAMES\">COLOR NAMES</a>","<a href=\"#KEYBOARDS\">KEYBOARDS</a>","<a href=\"#OPTIONS\">OPTIONS</a>","<a href=\"#RESOURCES\">RESOURCES</a>","<a href=\"#ENVIRONMENT\">ENVIRONMENT</a>","<a href=\"#EXAMPLES\">EXAMPLES</a>","<a href=\"#DIAGNOSTICS\">DIAGNOSTICS</a>","<a href=\"#SEE ALSO\">SEE ALSO</a>","<a href=\"#TRADEMARKS\">TRADEMARKS</a>","<a href=\"#AUTHORS\">AUTHORS</a>"],"level":7}