{"name":"sol","body":"\n\n<h1 align=\"center\">SOL</h1>\n\n\n\n\n\n\n\n\n\n<hr>\n\n\n<h2>NAME\n<a name=\"NAME\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">AisleRiot - a\ncollection of card games which are easy to play with the aid\nof a mouse.</p>\n\n<h2>SYNOPSIS\n<a name=\"SYNOPSIS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>sol</b>\n[<i>options</i>]</p>\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">This manual\npage documents briefly the <b>sol</b> command. For more\ninformation, please refer to the excellent GNOME help for\n<b>AisleRiot</b></p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>AisleRiot</b>\n(also known as <b>Solitaire</b> or <b>sol</b>) is a\ncollection of card games which are easy to play with the aid\nof a mouse. The rules for the games have been coded for your\npleasure in the GNOME scripting language (Scheme).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The following\ngames can be selected from within the program, or by using a\ncommand line switch:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">Peek, Auld Lang\nSyne, Fortunes, Seahaven, King Albert, First Law, Straight\nUp, Jumbo, Accordion, Ten Across, Plait, Lady Jane, Gypsy,\nNeighbor, Jamestown, Osmosis, Kings Audience, Glenwood, Gay\nGordons, Monte Carlo, Kansas, Camelot, Fourteen, Scorpion,\nIsabel, Escalator, Agnes, Bristol, Quatorze, Bear River,\nGold Mine, Athena, Spiderette, Chessboard, Backbone, Yukon,\nUnion Square, Eight Off, Napoleons Tomb, Forty Thieves,\nStreets And Alleys, Maze, Clock, Pileon, Canfield, Thirteen,\nBakers Game, Triple Peaks, Easthaven, Terrace, Aunt Mary,\nCarpet, Sir Tommy, Diamond Mine, Yield, Labyrinth, Thieves,\nSaratoga, Cruel, Block Ten, Will O The Wisp, Odessa, Eagle\nWing, Treize, Zebra, Cover, Elevator, Fortress, Giant,\nSpider, Gaps, Bakers Dozen, Whitehead, Freecell, Helsinki,\nSpider Three Decks, Scuffle, Poker, Klondike Three Decks,\nValentine, Royal East, Thumb And Pouch, Klondike, Doublets,\nTemplate, Golf, Westhaven, Beleaguered Castle, Hopscotch,\nEliminator, Aunt Mary, Hamilton, Wall</p>\n\n<h2>OPTIONS\n<a name=\"OPTIONS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">AisleRiot\naccepts the following options, besides the usual Gtk+/GNOME\nswitches: <b><br>\n-v, --variation=NAME</b></p>\n\n<p style=\"margin-left:22%;\">Select the game to play</p>\n\n<p style=\"margin-left:11%;\"><b>--display=DISPLAY</b></p>\n\n<p style=\"margin-left:22%;\">X display to use</p>\n\n<h2>USAGE\n<a name=\"USAGE\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">This text is\ntaken verbatim from the AisleRiot Manual V2.12.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Moving the\ncards is reasonably obvious. Assuming you have a\nright-handed mouse, left-click on a card and drag it\nsomewhere. Release the mouse button to deposit the card.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If a card can\nbe moved to the foundation(s), you do not need to drag it.\nYou can double-click on it and it will move. If a sequence\nof cards can be moved to the foundations, you can generally\nmove the sequence as one move.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Double clicking\na card will send it to a foundation, if that is possible.\nThis is useful for cleaning up large numbers of cards at the\nend of a successful game.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">In games which\nhave a stock pile you can redeal it by clicking on the empty\nspace where it was. Be warned that some games only let you\ndo this a limited number of time. Watch for the Redeals Left\nmessage at the bottom of the window.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A useful tip to\nknow is that right-clicking on a face-up card which is\npartially obscured by a card laid over it will raise it so\nthat you can see what it is.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">There is an\nalternative way to move cards. By selecting <b>Click to\nmove</b> from the <b>Control</b> menu you can click once to\npick up a card and then click again to place it. This can be\nfaster than dragging and will be easier on your hand since\nyou don&rsquo;t have to hold the mouse down. However, it may\ntake a while to get used to.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Some games have\noptions to change the way the game is played. For example\nKlondike can be played with either single card deals or\nthree-card deals. In these games there is a separate menu\nwith the game&rsquo;s name. You can only change the rules of\nthe game at the beginning of the game -- the menu will be\ninactive during the game.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Statistics on\nhow well you have done at a particular game are available by\nselecting <b>Statistics</b> from the Game menu. Only games\nwhere you actually start moving cards are counted. The\nstatistics are here for your own enjoyment, there are\nnumerous ways to cheat and it is unwise to make\ncomparisons.</p>\n\n<h2>HOMEPAGE\n<a name=\"HOMEPAGE\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">https://wiki.gnome.org/Apps/Aisleriot</p>\n\n<h2>AUTHOR\n<a name=\"AUTHOR\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">This manual\npage was written by Martin Ferrari\n&lt;martin.ferrari@gmail.com&gt;, for the Debian system (but\nmay be used by others). You can find the list of authors and\nmore information about AisleRiot in\n<i>/usr/share/doc/aisleriot</i>.</p>\n<hr>\n","headings":["<a href=\"#NAME\">NAME</a>","<a href=\"#SYNOPSIS\">SYNOPSIS</a>","<a href=\"#DESCRIPTION\">DESCRIPTION</a>","<a href=\"#OPTIONS\">OPTIONS</a>","<a href=\"#USAGE\">USAGE</a>","<a href=\"#HOMEPAGE\">HOMEPAGE</a>","<a href=\"#AUTHOR\">AUTHOR</a>"],"level":6}