{"name":"apt.conf","description":"apt.conf -\nConfiguration file for APT\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\n\n/etc/apt/apt.conf\nis the main configuration file shared by all the tools in\nthe APT suite of tools, though it is by no means the only\nplace options can be set. The suite also shares a common\ncommand line parser to provide a uniform environment.\n\nWhen an APT\ntool starts up it will read the configuration files in the\nfollowing order:\n\n<p style=\"margin-left:17%; margin-top: 1em\">1. the file\nspecified by the <b>APT_CONFIG</b> environment variable (if\nany)\n\n<p style=\"margin-left:17%; margin-top: 1em\">2. all files in\nDir::Etc::Parts in alphanumeric ascending order which have\neither no or &quot;conf&quot; as filename extension and\nwhich only contain alphanumeric, hyphen (-), underscore (_)\nand period (.) characters. Otherwise APT will print a notice\nthat it has ignored a file, unless that file matches a\npattern in the Dir::Ignore-Files-Silently configuration list\n- in which case it will be silently ignored.\n\n<p style=\"margin-left:17%; margin-top: 1em\">3. the main\nconfiguration file specified by Dir::Etc::main\n\n<p style=\"margin-left:17%; margin-top: 1em\">4. all options\nset in the binary specific configuration subtree are moved\ninto the root of the tree.\n\n<p style=\"margin-left:17%; margin-top: 1em\">5. the command\nline options are applied to override the configuration\ndirectives or to load even more configuration files.\n\n<h2>SYNTAX\n<a name=\"SYNTAX\"></a>\n</h2>\n\n\nThe\nconfiguration file is organized in a tree with options\norganized into functional groups. Option specification is\ngiven with a double colon notation; for instance\nAPT::Get::Assume-Yes is an option within the APT tool group,\nfor the Get tool. Options do not inherit from their parent\ngroups.\n\nSyntactically\nthe configuration language is modeled after what the ISC\ntools such as bind and dhcp use. Lines starting with // are\ntreated as comments (ignored), as well as all text between\n/* and */, just like C/C++ comments. Lines starting with #\nare also treated as comments. Each line is of the form\nAPT::Get::Assume-Yes &quot;true&quot;;. The quotation marks\nand trailing semicolon are required. The value must be on\none line, and there is no kind of string concatenation.\nValues must not include backslashes or extra quotation\nmarks. Option names are made up of alphanumeric characters\nand the characters &quot;/-:._+&quot;. A new scope can be\nopened with curly braces, like this:\n\n<p style=\"margin-left:17%; margin-top: 1em\">APT { <br>\nGet { <br>\nAssume-Yes &quot;true&quot;; <br>\nFix-Broken &quot;true&quot;; <br>\n}; <br>\n};\n\nwith newlines\nplaced to make it more readable. Lists can be created by\nopening a scope and including a single string enclosed in\nquotes followed by a semicolon. Multiple entries can be\nincluded, separated by a semicolon.\n\n\n<p style=\"margin-left:17%; margin-top: 1em\">DPkg::Pre-Install-Pkgs\n{&quot;/usr/sbin/dpkg-preconfigure --apt&quot;;};\n\nIn general the\nsample configuration file\n/usr/share/doc/apt/examples/configure-index.gz is a good\nguide for how it should look.\n\nCase is not\nsignificant in names of configuration items, so in the\nprevious example you could use dpkg::pre-install-pkgs.\n\nNames for the\nconfiguration items are optional if a list is defined as can\nbe seen in the DPkg::Pre-Install-Pkgs example above. If you\ndon't specify a name a new entry will simply add a new\noption to the list. If you specify a name you can override\nthe option in the same way as any other option by\nreassigning a new value to the option.\n\nTwo special\ncommands are defined: #include (which is deprecated and not\nsupported by alternative implementations) and #clear.\n#include will include the given file, unless the filename\nends in a slash, in which case the whole directory is\nincluded. #clear is used to erase a part of the\nconfiguration tree. The specified element and all its\ndescendants are erased. (Note that these lines also need to\nend with a semicolon.)\n\nThe #clear\ncommand is the only way to delete a list or a complete\nscope. Reopening a scope (or using the syntax described\nbelow with an appended ::) will <i>not</i> override\npreviously written entries. Options can only be overridden\nby addressing a new value to them - lists and scopes can't\nbe overridden, only cleared.\n\nAll of the APT\ntools take an -o option which allows an arbitrary\nconfiguration directive to be specified on the command line.\nThe syntax is a full option name (APT::Get::Assume-Yes for\ninstance) followed by an equals sign then the new value of\nthe option. To append a new element to a list, add a\ntrailing :: to the name of the list. (As you might suspect,\nthe scope syntax can't be used on the command line.)\n\nNote that\nappending items to a list using :: only works for one item\nper line, and that you should not use it in combination with\nthe scope syntax (which adds :: implicitly). Using both\nsyntaxes together will trigger a bug which some users\nunfortunately depend on: an option with the unusual name\n&quot;::&quot; which acts like every other option with a\nname. This introduces many problems; for one thing, users\nwho write multiple lines in this <i>wrong</i> syntax in the\nhope of appending to a list will achieve the opposite, as\nonly the last assignment for this option &quot;::&quot; will\nbe used. Future versions of APT will raise errors and stop\nworking if they encounter this misuse, so please correct\nsuch statements now while APT doesn't explicitly complain\nabout them.\n\n<h2>THE APT GROUP\n<a name=\"THE APT GROUP\"></a>\n</h2>\n\n\nThis group of\noptions controls general APT behavior as well as holding the\noptions for all of the tools.\n\n\n<b>Architecture</b>\n\n<p style=\"margin-left:17%;\">System Architecture; sets the\narchitecture to use when fetching files and parsing package\nlists. The internal default is the architecture apt was\ncompiled for.\n\n\n<b>Architectures</b>\n\n<p style=\"margin-left:17%;\">All Architectures the system\nsupports. For instance, CPUs implementing the amd64 (also\ncalled x86-64) instruction set are also able to execute\nbinaries compiled for the i386 (x86) instruction set. This\nlist is used when fetching files and parsing package lists.\nThe initial default is always the system's native\narchitecture (APT::Architecture), and foreign architectures\nare added to the default list when they are registered via\n<b>dpkg --add-architecture</b>.\n\n\n<b>Compressor</b>\n\n<p style=\"margin-left:17%;\">This scope defines which\ncompression formats are supported, how compression and\ndecompression can be performed if support for this format\nisn't built into apt directly and a cost-value indicating\nhow costly it is to compress something in this format. As an\nexample the following configuration stanza would allow apt\nto download and uncompress as well as create and store files\nwith the low-cost .reversed file extension which it will\npass to the command <b>rev</b> without additional\ncommandline parameters for compression and\nuncompression:\n\n\n<p style=\"margin-left:23%; margin-top: 1em\">APT::Compressor::rev\n{\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"85%\">\n\n\n<p>Name &quot;rev&quot;;</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"85%\">\n\n\n<p>Extension &quot;.reversed&quot;;</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"85%\">\n\n\n<p>Binary &quot;rev&quot;;</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"85%\">\n\n\n<p>CompressArg {};</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"85%\">\n\n\n<p>UncompressArg {};</td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"85%\">\n\n\n<p>Cost &quot;10&quot;;</td></tr>\n</table>\n\n<p style=\"margin-left:23%;\">};\n\n\n<b>Build-Profiles</b>\n\n<p style=\"margin-left:17%;\">List of all build profiles\nenabled for build-dependency resolution, without the\n&quot;profile.&quot; namespace prefix. By default this list\nis empty. The <b>DEB_BUILD_PROFILES</b> as used by\n<a href=\"https://man.page/1/dpkg-buildpackage\">dpkg-buildpackage(1)</a> overrides the list notation.\n\n\n<b>Default-Release</b>\n\n<p style=\"margin-left:17%;\">Default release to install\npackages from if more than one version is available.\nContains release name, codename or release version.\nExamples: 'stable', 'testing', 'unstable', 'bullseye',\n'bookworm', '4.0', '5.0*'. See also\n<a href=\"https://man.page/5/apt_preferences\">apt_preferences(5)</a>.\n\n\n<b>Ignore-Hold</b>\n\n<p style=\"margin-left:17%;\">Ignore held packages; this\nglobal option causes the problem resolver to ignore held\npackages in its decision making.\n\n\n<b>Clean-Installed</b>\n\n<p style=\"margin-left:17%;\">Defaults to on. When turned on\nthe autoclean feature will remove any packages which can no\nlonger be downloaded from the cache. If turned off then\npackages that are locally installed are also excluded from\ncleaning - but note that APT provides no direct means to\nreinstall them.\n\n\n<b>Immediate-Configure</b>\n\n<p style=\"margin-left:17%;\">Defaults to on, which will\ncause APT to install essential and important packages as\nsoon as possible in an install/upgrade operation, in order\nto limit the effect of a failing <a href=\"https://man.page/1/dpkg\">dpkg(1)</a> call. If\nthis option is disabled, APT treats an important package in\nthe same way as an extra package: between the unpacking of\nthe package A and its configuration there can be many other\nunpack or configuration calls for other unrelated packages\nB, C etc. If these cause the <a href=\"https://man.page/1/dpkg\">dpkg(1)</a> call to fail\n(e.g. because package B's maintainer scripts generate an\nerror), this results in a system state in which package A is\nunpacked but unconfigured - so any package depending on A is\nnow no longer guaranteed to work, as its dependency on A is\nno longer satisfied.\n\n<p style=\"margin-left:17%; margin-top: 1em\">The immediate\nconfiguration marker is also applied in the potentially\nproblematic case of circular dependencies, since a\ndependency with the immediate flag is equivalent to a\nPre-Dependency. In theory this allows APT to recognise a\nsituation in which it is unable to perform immediate\nconfiguration, abort, and suggest to the user that the\noption should be temporarily deactivated in order to allow\nthe operation to proceed. Note the use of the word\n&quot;theory&quot; here; in the real world this problem has\nrarely been encountered, in non-stable distribution\nversions, and was caused by wrong dependencies of the\npackage in question or by a system in an already broken\nstate; so you should not blindly disable this option, as the\nscenario mentioned above is not the only problem it can help\nto prevent in the first place.\n\n<p style=\"margin-left:17%; margin-top: 1em\">Before a big\noperation like dist-upgrade is run with this option disabled\nyou should try to explicitly install the package APT is\nunable to configure immediately; but please make sure you\nalso report your problem to your distribution and to the APT\nteam with the bug link below, so they can work on improving\nor correcting the upgrade process.\n\n\n<b>Force-LoopBreak</b>\n\n<p style=\"margin-left:17%;\">Never enable this option unless\nyou <i>really</i> know what you are doing. It permits APT to\ntemporarily remove an essential package to break a\nConflicts/Conflicts or Conflicts/Pre-Depends loop between\ntwo essential packages. <i>Such a loop should never exist\nand is a grave bug</i>. This option will work if the\nessential packages are not <b>tar</b>, <b>gzip</b>,\n<b>libc</b>, <b>dpkg</b>, <b>dash</b> or anything that those\npackages depend on.\n\n\n<b>Cache-Start</b>,\n<b>Cache-Grow</b>, <b>Cache-Limit</b>\n\n<p style=\"margin-left:17%;\">APT uses since version 0.7.26 a\nresizable memory mapped cache file to store the available\ninformation. Cache-Start acts as a hint of the size the\ncache will grow to, and is therefore the amount of memory\nAPT will request at startup. The default value is 20971520\nbytes (~20 MB). Note that this amount of space needs to be\navailable for APT; otherwise it will likely fail\nungracefully, so for memory restricted devices this value\nshould be lowered while on systems with a lot of configured\nsources it should be increased. Cache-Grow defines in bytes\nwith the default of 1048576 (~1 MB) how much the cache size\nwill be increased in the event the space defined by\nCache-Start is not enough. This value will be applied again\nand again until either the cache is big enough to store all\ninformation or the size of the cache reaches the\nCache-Limit. The default of Cache-Limit is 0 which stands\nfor no limit. If Cache-Grow is set to 0 the automatic growth\nof the cache is disabled.\n\n\n<b>Build-Essential</b>\n\n<p style=\"margin-left:17%;\">Defines which packages are\nconsidered essential build dependencies.\n\n<b>Get</b>\n\n<p style=\"margin-left:17%;\">The Get subsection controls the\n<b>apt-get</b>(8) tool; please see its documentation for\nmore information about the options here.\n\n\n<b>Cache</b>\n\n<p style=\"margin-left:17%;\">The Cache subsection controls\nthe <b>apt-cache</b>(8) tool; please see its documentation\nfor more information about the options here.\n\n\n<b>CDROM</b>\n\n<p style=\"margin-left:17%;\">The CDROM subsection controls\nthe <b>apt-cdrom</b>(8) tool; please see its documentation\nfor more information about the options here.\n\n<h2>THE ACQUIRE GROUP\n<a name=\"THE ACQUIRE GROUP\"></a>\n</h2>\n\n\nThe Acquire\ngroup of options controls the download of packages as well\nas the various &quot;acquire methods&quot; responsible for\nthe download itself (see also <b>sources.list</b>(5)).\n\n\n<b>Check-Date</b>\n\n<p style=\"margin-left:17%;\">Security related option\ndefaulting to true, enabling time-related checks. Disabling\nit means that the machine's time cannot be trusted, and APT\nwill hence disable all time-related checks, such as\n<b>Check-Valid-Until</b> and verifying that the Date field\nof a release file is not in the future.\n\n\n<b>Max-FutureTime</b>\n\n<p style=\"margin-left:17%;\">Maximum time (in seconds)\nbefore its creation (as indicated by the Date header) that\nthe Release file should be considered valid. The default\nvalue is 10. Archive specific settings can be made by\nappending the label of the archive to the option name.\nPreferably, the same can be achieved for specific\n<b>sources.list</b>(5) entries by using the\n<b>Date-Max-Future</b> option there.\n\n\n<b>Check-Valid-Until</b>\n\n<p style=\"margin-left:17%;\">Security related option\ndefaulting to true, as giving a Release file's validation an\nexpiration date prevents replay attacks over a long\ntimescale, and can also for example help users to identify\nmirrors that are no longer updated - but the feature depends\non the correctness of the clock on the user system. Archive\nmaintainers are encouraged to create Release files with the\nValid-Until header, but if they don't or a stricter value is\ndesired the Max-ValidTime option below can be used. The\n<b>Check-Valid-Until</b> option of <b>sources.list</b>(5)\nentries should be preferred to disable the check selectively\ninstead of using this global override.\n\n\n<b>Max-ValidTime</b>\n\n<p style=\"margin-left:17%;\">Maximum time (in seconds) after\nits creation (as indicated by the Date header) that the\nRelease file should be considered valid. If the Release file\nitself includes a Valid-Until header the earlier date of the\ntwo is used as the expiration date. The default value is 0\nwhich stands for &quot;valid forever&quot;. Archive specific\nsettings can be made by appending the label of the archive\nto the option name. Preferably, the same can be achieved for\nspecific <b>sources.list</b>(5) entries by using the\n<b>Valid-Until-Max</b> option there.\n\n\n<b>Min-ValidTime</b>\n\n<p style=\"margin-left:17%;\">Minimum time (in seconds) after\nits creation (as indicated by the Date header) that the\nRelease file should be considered valid. Use this if you\nneed to use a seldom updated (local) mirror of a more\nfrequently updated archive with a Valid-Until header instead\nof completely disabling the expiration date checking.\nArchive specific settings can and should be used by\nappending the label of the archive to the option name.\nPreferably, the same can be achieved for specific\n<b>sources.list</b>(5) entries by using the\n<b>Valid-Until-Min</b> option there.\n\n\n<b>AllowTLS</b>\n\n<p style=\"margin-left:17%;\">Allow use of the internal TLS\nsupport in the http method. If set to false, this completely\ndisables support for TLS in apt's own methods (excluding the\ncurl-based https method). No TLS-related functions will be\ncalled anymore.\n\n\n<b>PDiffs</b>\n\n<p style=\"margin-left:17%;\">Try to download deltas called\nPDiffs for indexes (like Packages files) instead of\ndownloading whole ones. True by default. Preferably, this\ncan be set for specific <b>sources.list</b>(5) entries or\nindex files by using the <b>PDiffs</b> option there.\n\n<p style=\"margin-left:17%; margin-top: 1em\">Two sub-options\nto limit the use of PDiffs are also available: FileLimit can\nbe used to specify a maximum number of PDiff files should be\ndownloaded to update a file. SizeLimit on the other hand is\nthe maximum percentage of the size of all patches compared\nto the size of the targeted file. If one of these limits is\nexceeded the complete file is downloaded instead of the\npatches.\n\n\n<b>By-Hash</b>\n\n<p style=\"margin-left:17%;\">Try to download indexes via an\nURI constructed from a hashsum of the expected file rather\nthan downloaded via a well-known stable filename. True by\ndefault, but automatically disabled if the source indicates\nno support for it. Usage can be forced with the special\nvalue &quot;force&quot;. Preferably, this can be set for\nspecific <b>sources.list</b>(5) entries or index files by\nusing the <b>By-Hash</b> option there.\n\n\n<b>Queue-Mode</b>\n\n<p style=\"margin-left:17%;\">Queuing mode; Queue-Mode can be\none of host or access which determines how APT parallelizes\noutgoing connections. host means that one connection per\ntarget host will be opened, access means that one connection\nper URI type will be opened.\n\n\n<b>Retries</b>\n\n<p style=\"margin-left:17%;\">Number of retries to perform.\nIf this is non-zero APT will retry failed files the given\nnumber of times.\n\n\n<b>Source-Symlinks</b>\n\n<p style=\"margin-left:17%;\">Use symlinks for source\narchives. If set to true then source archives will be\nsymlinked when possible instead of copying. True is the\ndefault.\n\n<b>http\nhttps</b>\n\n<p style=\"margin-left:17%;\">The options in these scopes\nconfigure APT's acquire transports for the protocols HTTP\nand HTTPS and are documented in the\n<a href=\"https://man.page/1/apt-transport-http\">apt-transport-http(1)</a> and\n<a href=\"https://man.page/1/apt-transport-https\">apt-transport-https(1)</a> manpages respectively.\n\n<b>ftp</b>\n\n<p style=\"margin-left:17%;\">ftp::Proxy sets the default\nproxy to use for FTP URIs. It is in the standard form of\nftp://[[user][:pass]@]host[:port]/. Per host proxies can\nalso be specified by using the form ftp::Proxy::&lt;host&gt;\nwith the special keyword DIRECT meaning to use no proxies.\nIf no one of the above settings is specified,\n<b>ftp_proxy</b> environment variable will be used. To use\nan FTP proxy you will have to set the ftp::ProxyLogin script\nin the configuration file. This entry specifies the commands\nto send to tell the proxy server what to connect to. Please\nsee /usr/share/doc/apt/examples/configure-index.gz for an\nexample of how to do this. The substitution variables\nrepresenting the corresponding URI component are\n$(PROXY_USER), $(PROXY_PASS), $(SITE_USER), $(SITE_PASS),\n$(SITE) and $(SITE_PORT).\n\n<p style=\"margin-left:17%; margin-top: 1em\">The option\ntimeout sets the timeout timer used by the method; this\nvalue applies to the connection as well as the data\ntimeout.\n\n<p style=\"margin-left:17%; margin-top: 1em\">Several\nsettings are provided to control passive mode. Generally it\nis safe to leave passive mode on; it works in nearly every\nenvironment. However, some situations require that passive\nmode be disabled and port mode FTP used instead. This can be\ndone globally or for connections that go through a proxy or\nfor a specific host (see the sample config file for\nexamples).\n\n<p style=\"margin-left:17%; margin-top: 1em\">It is possible\nto proxy FTP over HTTP by setting the <b>ftp_proxy</b>\nenvironment variable to an HTTP URL - see the discussion of\nthe http method above for syntax. You cannot set this in the\nconfiguration file and it is not recommended to use FTP over\nHTTP due to its low efficiency.\n\n<p style=\"margin-left:17%; margin-top: 1em\">The setting\nForceExtended controls the use of RFC2428 EPSV and EPRT\ncommands. The default is false, which means these commands\nare only used if the control connection is IPv6. Setting\nthis to true forces their use even on IPv4 connections. Note\nthat most FTP servers do not support RFC2428.\n\n\n<b>cdrom</b>\n\n<p style=\"margin-left:17%;\">For URIs using the cdrom\nmethod, the only configurable option is the mount point,\ncdrom::Mount, which must be the mount point for the CD-ROM\n(or DVD, or whatever) drive as specified in /etc/fstab. It\nis possible to provide alternate mount and unmount commands\nif your mount point cannot be listed in the fstab. The\nsyntax is to put\n\n<p style=\"margin-left:23%; margin-top: 1em\">/cdrom/::Mount\n&quot;foo&quot;;\n\n<p style=\"margin-left:17%; margin-top: 1em\">within the\ncdrom block. It is important to have the trailing slash.\nUnmount commands can be specified using UMount.\n\n\n<b>gpgv</b>\n\n<p style=\"margin-left:17%;\">For GPGV URIs the only\nconfigurable option is gpgv::Options, which passes\nadditional parameters to gpgv.\n\n\n<b>CompressionTypes</b>\n\n<p style=\"margin-left:17%;\">List of compression types which\nare understood by the acquire methods. Files like Packages\ncan be available in various compression formats. By default\nthe acquire methods can decompress and recompress many\ncommon formats like <b>xz</b> and <b>gzip</b>; with this\nscope the supported formats can be queried, modified as well\nas support for more formats added (see also\n<b>APT::Compressor</b>). The syntax for this is:\n\n\n<p style=\"margin-left:23%; margin-top: 1em\">Acquire::CompressionTypes::<i>FileExtension</i>\n&quot;<i>Methodname</i>&quot;;\n\n<p style=\"margin-left:17%; margin-top: 1em\">Also, the Order\nsubgroup can be used to define in which order the acquire\nsystem will try to download the compressed files. The\nacquire system will try the first and proceed with the next\ncompression type in this list on error, so to prefer one\nover the other type simply add the preferred type first -\ntypes not already added will be implicitly appended to the\nend of the list, so e.g.\n\n\n<p style=\"margin-left:23%; margin-top: 1em\">Acquire::CompressionTypes::Order::\n&quot;gz&quot;;\n\n<p style=\"margin-left:17%; margin-top: 1em\">can be used to\nprefer <b>gzip</b> compressed files over all other\ncompression formats. If <b>xz</b> should be preferred over\n<b>gzip</b> and <b>bzip2</b> the configure setting should\nlook like this:\n\n\n<p style=\"margin-left:23%; margin-top: 1em\">Acquire::CompressionTypes::Order\n{ &quot;xz&quot;; &quot;gz&quot;; };\n\n<p style=\"margin-left:17%; margin-top: 1em\">It is not\nneeded to add bz2 to the list explicitly as it will be added\nautomatically.\n\n<p style=\"margin-left:17%; margin-top: 1em\">Note that the\nDir::Bin::<i>Methodname</i> will be checked at run time. If\nthis option has been set and support for this format isn't\ndirectly built into apt, the method will only be used if\nthis file exists; e.g. for the bzip2 method (the inbuilt)\nsetting is:\n\n\n<p style=\"margin-left:23%; margin-top: 1em\">Dir::Bin::bzip2\n&quot;/bin/bzip2&quot;;\n\n<p style=\"margin-left:17%; margin-top: 1em\">Note also that\nlist entries specified on the command line will be added at\nthe end of the list specified in the configuration files,\nbut before the default entries. To prefer a type in this\ncase over the ones specified in the configuration files you\ncan set the option direct - not in list style. This will not\noverride the defined list; it will only prefix the list with\nthis type.\n\n<p style=\"margin-left:17%; margin-top: 1em\">The special\ntype uncompressed can be used to give uncompressed files a\npreference, but note that most archives don't provide\nuncompressed files so this is mostly only usable for local\nmirrors.\n\n\n<b>GzipIndexes</b>\n\n<p style=\"margin-left:17%;\">When downloading gzip\ncompressed indexes (Packages, Sources, or Translations),\nkeep them gzip compressed locally instead of unpacking them.\nThis saves quite a lot of disk space at the expense of more\nCPU requirements when building the local package caches.\nFalse by default.\n\n\n<b>Languages</b>\n\n<p style=\"margin-left:17%;\">The Languages subsection\ncontrols which Translation files are downloaded and in which\norder APT tries to display the description-translations. APT\nwill try to display the first available description in the\nlanguage which is listed first. Languages can be defined\nwith their short or long language codes. Note that not all\narchives provide Translation files for every language - the\nlong language codes are especially rare.\n\n<p style=\"margin-left:17%; margin-top: 1em\">The default\nlist includes &quot;environment&quot; and &quot;en&quot;.\n&quot;environment&quot; has a special meaning here: it will\nbe replaced at runtime with the language codes extracted\nfrom the LC_MESSAGES environment variable. It will also\nensure that these codes are not included twice in the list.\nIf LC_MESSAGES is set to &quot;C&quot; only the\nTranslation-en file (if available) will be used. To force\nAPT to use no Translation file use the setting\nAcquire::Languages=none. &quot;none&quot; is another special\nmeaning code which will stop the search for a suitable\nTranslation file. This tells APT to download these\ntranslations too, without actually using them unless the\nenvironment specifies the languages. So the following\nexample configuration will result in the order &quot;en,\nde&quot; in an English locale or &quot;de, en&quot; in a\nGerman one. Note that &quot;fr&quot; is downloaded, but not\nused unless APT is used in a French locale (where the order\nwould be &quot;fr, de, en&quot;).\n\n\n<p style=\"margin-left:23%; margin-top: 1em\">Acquire::Languages\n{ &quot;environment&quot;; &quot;de&quot;; &quot;en&quot;;\n&quot;none&quot;; &quot;fr&quot;; };\n\n<p style=\"margin-left:17%; margin-top: 1em\">Note: To\nprevent problems resulting from APT being executed in\ndifferent environments (e.g. by different users or by other\nprograms) all Translation files which are found in\n/var/lib/apt/lists/ will be added to the end of the list\n(after an implicit &quot;none&quot;).\n\n\n<b>ForceIPv4</b>\n\n<p style=\"margin-left:17%;\">When downloading, force to use\nonly the IPv4 protocol.\n\n\n<b>ForceIPv6</b>\n\n<p style=\"margin-left:17%;\">When downloading, force to use\nonly the IPv6 protocol.\n\n\n<b>MaxReleaseFileSize</b>\n\n<p style=\"margin-left:17%;\">The maximum file size of\nRelease/Release.gpg/InRelease files. The default is\n10MB.\n\n\n<b>EnableSrvRecords</b>\n\n<p style=\"margin-left:17%;\">This option controls if apt\nwill use the DNS SRV server record as specified in RFC 2782\nto select an alternative server to connect to. The default\nis &quot;true&quot;.\n\n\n<b>AllowInsecureRepositories</b>\n\n<p style=\"margin-left:17%;\">Allow update operations to load\ndata files from repositories without sufficient security\ninformation. The default value is &quot;false&quot;.\nConcept, implications as well as alternatives are detailed\nin <b>apt-secure</b>(8).\n\n\n<b>AllowWeakRepositories</b>\n\n<p style=\"margin-left:17%;\">Allow update operations to load\ndata files from repositories which provide security\ninformation, but these are deemed no longer\ncryptographically strong enough. The default value is\n&quot;false&quot;. Concept, implications as well as\nalternatives are detailed in <b>apt-secure</b>(8).\n\n\n<b>AllowDowngradeToInsecureRepositories</b>\n\n<p style=\"margin-left:17%;\">Allow that a repository that\nwas previously gpg signed to become unsigned during an\nupdate operation. When there is no valid signature for a\npreviously trusted repository apt will refuse the update.\nThis option can be used to override this protection. You\nalmost certainly never want to enable this. The default is\nfalse. Concept, implications as well as alternatives are\ndetailed in <b>apt-secure</b>(8).\n\n\n<b>Changelogs::URI</b>\nscope\n\n<p style=\"margin-left:17%;\">Acquiring changelogs can only\nbe done if an URI is known from where to get them.\nPreferable the Release file indicates this in a 'Changelogs'\nfield. If this isn't available the Label/Origin field of the\nRelease file is used to check if a\nAcquire::Changelogs::URI::Label::<i>LABEL</i> or\nAcquire::Changelogs::URI::Origin::<i>ORIGIN</i> option\nexists and if so this value is taken. The value in the\nRelease file can be overridden with\nAcquire::Changelogs::URI::Override::Label::<i>LABEL</i> or\nAcquire::Changelogs::URI::Override::Origin::<i>ORIGIN</i>.\nThe value should be a normal URI to a text file, except that\npackage specific data is replaced with the placeholder\n@CHANGEPATH@. The value for it is: 1. if the package is from\na component (e.g. main) this is the first part otherwise it\nis omitted, 2. the first letter of source package name,\nexcept if the source package name starts with 'lib' in which\ncase it will be the first four letters. 3. The complete\nsource package name. 4. the complete name again and 5. the\nsource version. The first (if present), second, third and\nfourth part are separated by a slash ('/') and between the\nfourth and fifth part is an underscore ('_'). The special\nvalue 'no' is available for this option indicating that this\nsource can't be used to acquire changelog files from.\nAnother source will be tried if available in this case.\n\n<h2>BINARY SPECIFIC CONFIGURATION\n<a name=\"BINARY SPECIFIC CONFIGURATION\"></a>\n</h2>\n\n\nEspecially with\nthe introduction of the <b>apt</b> binary it can be useful\nto set certain options only for a specific binary as even\noptions which look like they would effect only a certain\nbinary like <b>APT::Get::Show-Versions</b> effect\n<b>apt-get</b> as well as <b>apt</b>.\n\nSetting an\noption for a specific binary only can be achieved by setting\nthe option inside the <b>Binary::</b><i>specific-binary</i>\nscope. Setting the option <b>APT::Get::Show-Versions</b> for\nthe <b>apt</b> only can e.g. by done by setting\n<b>Binary::apt::APT::Get::Show-Versions</b> instead.\n\nNote that as\nseen in the DESCRIPTION section further above you can't set\nbinary-specific options on the commandline itself nor in\nconfiguration files loaded via the commandline.\n\n<h2>DIRECTORIES\n<a name=\"DIRECTORIES\"></a>\n</h2>\n\n\nThe Dir::State\nsection has directories that pertain to local state\ninformation. lists is the directory to place downloaded\npackage lists in and status is the name of the\n<a href=\"https://man.page/1/dpkg\">dpkg(1)</a> status file. preferences is the name of the\nAPT preferences file. Dir::State contains the default\ndirectory to prefix on all sub-items if they do not start\nwith / or ./.\n\nDir::Cache\ncontains locations pertaining to local cache information,\nsuch as the two package caches srcpkgcache and pkgcache as\nwell as the location to place downloaded archives,\nDir::Cache::archives. Generation of caches can be turned off\nby setting pkgcache or srcpkgcache to &quot;&quot;. This\nwill slow down startup but save disk space. It is probably\npreferable to turn off the pkgcache rather than the\nsrcpkgcache. Like Dir::State the default directory is\ncontained in Dir::Cache\n\nDir::Etc\ncontains the location of configuration files, sourcelist\ngives the location of the sourcelist and main is the default\nconfiguration file (setting has no effect, unless it is done\nfrom the config file specified by <b>APT_CONFIG</b>).\n\nThe Dir::Parts\nsetting reads in all the config fragments in lexical order\nfrom the directory specified. After this is done then the\nmain config file is loaded.\n\nBinary programs\nare pointed to by Dir::Bin. Dir::Bin::Methods specifies the\nlocation of the method handlers and gzip, bzip2, lzma, dpkg,\napt-get dpkg-source dpkg-buildpackage and apt-cache specify\nthe location of the respective programs.\n\nThe\nconfiguration item RootDir has a special meaning. If set,\nall paths will be relative to RootDir, <i>even paths that\nare specified absolutely</i>. So, for instance, if RootDir\nis set to /tmp/staging and Dir::State::status is set to\n/var/lib/dpkg/status, then the status file will be looked up\nin /tmp/staging/var/lib/dpkg/status. If you want to prefix\nonly relative paths, set Dir instead.\n\nThe\nIgnore-Files-Silently list can be used to specify which\nfiles APT should silently ignore while parsing the files in\nthe fragment directories. Per default a file which ends with\n.disabled, ~, .bak or .dpkg-[a-z]+ is silently ignored. As\nseen in the last default value these patterns can use\nregular expression syntax.\n\n<h2>APT IN DSELECT\n<a name=\"APT IN DSELECT\"></a>\n</h2>\n\n\nWhen APT is\nused as a <a href=\"https://man.page/1/dselect\">dselect(1)</a> method several configuration\ndirectives control the default behavior. These are in the\nDSelect section.\n\n\n<b>Clean</b>\n\n<p style=\"margin-left:17%;\">Cache Clean mode; this value\nmay be one of always, prompt, auto, pre-auto and never.\nalways and prompt will remove all packages from the cache\nafter upgrading, prompt (the default) does so conditionally.\nauto removes only those packages which are no longer\ndownloadable (replaced with a new version for instance).\npre-auto performs this action before downloading new\npackages.\n\n\n<b>options</b>\n\n<p style=\"margin-left:17%;\">The contents of this variable\nare passed to <b>apt-get</b>(8) as command line options when\nit is run for the install phase.\n\n\n<b>Updateoptions</b>\n\n<p style=\"margin-left:17%;\">The contents of this variable\nare passed to <b>apt-get</b>(8) as command line options when\nit is run for the update phase.\n\n\n<b>PromptAfterUpdate</b>\n\n<p style=\"margin-left:17%;\">If true the [U]pdate operation\nin <a href=\"https://man.page/1/dselect\">dselect(1)</a> will always prompt to continue. The\ndefault is to prompt only on error.\n\n<h2>HOW APT CALLS DPKG(1)\n<a name=\"HOW APT CALLS DPKG(1)\"></a>\n</h2>\n\n\nSeveral\nconfiguration directives control how APT invokes\n<a href=\"https://man.page/1/dpkg\">dpkg(1)</a>. These are in the DPkg section.\n\n\n<b>options</b>\n\n<p style=\"margin-left:17%;\">This is a list of options to\npass to <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>. The options must be specified using\nthe list notation and each list item is passed as a single\nargument to <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>.\n\n\n<b>Path</b>\n\n<p style=\"margin-left:17%;\">This is a string that defines\nthe <b>PATH</b> environment variable used when running dpkg.\nIt may be set to any valid value of that environment\nvariable; or the empty string, in which case the variable is\nnot changed.\n\n\n<b>Pre-Invoke</b>,\n<b>Post-Invoke</b>\n\n<p style=\"margin-left:17%;\">This is a list of shell\ncommands to run before/after invoking <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>. Like\noptions this must be specified in list notation. The\ncommands are invoked in order using /bin/sh; should any fail\nAPT will abort.\n\n\n<b>Pre-Install-Pkgs</b>\n\n<p style=\"margin-left:17%;\">This is a list of shell\ncommands to run before invoking <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>. Like options\nthis must be specified in list notation. The commands are\ninvoked in order using /bin/sh; should any fail APT will\nabort. APT will pass the filenames of all .deb files it is\ngoing to install to the commands, one per line on the\nrequested file descriptor, defaulting to standard input.\n\n<p style=\"margin-left:17%; margin-top: 1em\">Version 2 of\nthis protocol sends more information through the requested\nfile descriptor: a line with the text VERSION 2, the APT\nconfiguration space, and a list of package actions with\nfilename and version information.\n\n<p style=\"margin-left:17%; margin-top: 1em\">Each\nconfiguration directive line has the form key=value. Special\ncharacters (equal signs, newlines, nonprintable characters,\nquotation marks, and percent signs in key and newlines,\nnonprintable characters, and percent signs in value) are\n%-encoded. Lists are represented by multiple key::=value\nlines with the same key. The configuration section ends with\na blank line.\n\n<p style=\"margin-left:17%; margin-top: 1em\">Package action\nlines consist of five fields in Version 2: package name\n(without architecture qualification even if foreign), old\nversion, direction of version change (&lt; for upgrades,\n&gt; for downgrades, = for no change), new version, action.\nThe version fields are &quot;-&quot; for no version at all\n(for example when installing a package for the first time;\nno version is treated as earlier than any real version, so\nthat is an upgrade, indicated as - &lt; 1.23.4). The action\nfield is &quot;**CONFIGURE**&quot; if the package is being\nconfigured, &quot;**REMOVE**&quot; if it is being removed,\nor the filename of a .deb file if it is being unpacked.\n\n<p style=\"margin-left:17%; margin-top: 1em\">In Version 3\nafter each version field follows the architecture of this\nversion, which is &quot;-&quot; if there is no version, and\na field showing the MultiArch type &quot;same&quot;,\n&quot;foreign&quot;, &quot;allowed&quot; or\n&quot;none&quot;. Note that &quot;none&quot; is an incorrect\ntypename which is just kept to remain compatible, it should\nbe read as &quot;no&quot; and users are encouraged to\nsupport both.\n\n<p style=\"margin-left:17%; margin-top: 1em\">The version of\nthe protocol to be used for the command <i>cmd</i> can be\nchosen by setting DPkg::Tools::options::<i>cmd</i>::Version\naccordingly, the default being version 1. If APT isn't\nsupporting the requested version it will send the\ninformation in the highest version it has support for\ninstead.\n\n<p style=\"margin-left:17%; margin-top: 1em\">The file\ndescriptor to be used to send the information can be\nrequested with DPkg::Tools::options::<i>cmd</i>::InfoFD\nwhich defaults to 0 for standard input and is available\nsince version 0.9.11. Support for the option can be detected\nby looking for the environment variable\n<b>APT_HOOK_INFO_FD</b> which contains the number of the\nused file descriptor as a confirmation.\n\n\n<b>Run-Directory</b>\n\n<p style=\"margin-left:17%;\">APT chdirs to this directory\nbefore invoking <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>, the default is /.\n\n\n<b>Build-options</b>\n\n<p style=\"margin-left:17%;\">These options are passed to\n<a href=\"https://man.page/1/dpkg-buildpackage\">dpkg-buildpackage(1)</a> when compiling packages; the\ndefault is to disable signing and produce all binaries.\n\n\n<b>DPkg::ConfigurePending</b>\n\n<p style=\"margin-left:17%;\">If this option is set APT will\ncall <b>dpkg --configure --pending</b> to let <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>\nhandle all required configurations and triggers. This option\nis activated by default, but deactivating it could be useful\nif you want to run APT multiple times in a row - e.g. in an\ninstaller. In this scenario you could deactivate this option\nin all but the last run.\n\n<h2>PERIODIC AND ARCHIVES OPTIONS\n<a name=\"PERIODIC AND ARCHIVES OPTIONS\"></a>\n</h2>\n\n\nAPT::Periodic\nand APT::Archives groups of options configure behavior of\napt periodic updates, which is done by the\n/usr/lib/apt/apt.systemd.daily script. See the top of this\nscript for the brief documentation of these options.\n\n<h2>DEBUG OPTIONS\n<a name=\"DEBUG OPTIONS\"></a>\n</h2>\n\n\nEnabling\noptions in the Debug:: section will cause debugging\ninformation to be sent to the standard error stream of the\nprogram utilizing the apt libraries, or enable special\nprogram modes that are primarily useful for debugging the\nbehavior of apt. Most of these options are not interesting\nto a normal user, but a few may be:\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\nDebug::pkgProblemResolver enables output about the decisions\nmade by dist-upgrade, upgrade, install, remove, purge.\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\nDebug::NoLocking disables all file locking. This can be used\nto run some operations (for instance, apt-get -s install) as\na non-root user.\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\nDebug::pkgDPkgPM prints out the actual command line each\ntime that apt invokes <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>.\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\nDebug::IdentCdrom disables the inclusion of statfs data in\nCD-ROM IDs.\n\nA full list of\ndebugging options to apt follows.\n\n\n<b>Debug::Acquire::cdrom</b>\n\n<p style=\"margin-left:17%;\">Print information related to\naccessing cdrom:// sources.\n\n\n<b>Debug::Acquire::ftp</b>\n\n<p style=\"margin-left:17%;\">Print information related to\ndownloading packages using FTP.\n\n\n<b>Debug::Acquire::http</b>\n\n<p style=\"margin-left:17%;\">Print information related to\ndownloading packages using HTTP.\n\n\n<b>Debug::Acquire::https</b>\n\n<p style=\"margin-left:17%;\">Print information related to\ndownloading packages using HTTPS.\n\n\n<b>Debug::Acquire::gpgv</b>\n\n<p style=\"margin-left:17%;\">Print information related to\nverifying cryptographic signatures using gpg.\n\n\n<b>Debug::aptcdrom</b>\n\n<p style=\"margin-left:17%;\">Output information about the\nprocess of accessing collections of packages stored on\nCD-ROMs.\n\n\n<b>Debug::BuildDeps</b>\n\n<p style=\"margin-left:17%;\">Describes the process of\nresolving build-dependencies in <b>apt-get</b>(8).\n\n\n<b>Debug::Hashes</b>\n\n<p style=\"margin-left:17%;\">Output each cryptographic hash\nthat is generated by the apt libraries.\n\n\n<b>Debug::IdentCDROM</b>\n\n<p style=\"margin-left:17%;\">Do not include information from\nstatfs, namely the number of used and free blocks on the\nCD-ROM filesystem, when generating an ID for a CD-ROM.\n\n\n<b>Debug::NoLocking</b>\n\n<p style=\"margin-left:17%;\">Disable all file locking. For\ninstance, this will allow two instances of &ldquo;apt-get\nupdate&rdquo; to run at the same time.\n\n\n<b>Debug::pkgAcquire</b>\n\n<p style=\"margin-left:17%;\">Log when items are added to or\nremoved from the global download queue.\n\n\n<b>Debug::pkgAcquire::Auth</b>\n\n<p style=\"margin-left:17%;\">Output status messages and\nerrors related to verifying checksums and cryptographic\nsignatures of downloaded files.\n\n\n<b>Debug::pkgAcquire::Diffs</b>\n\n<p style=\"margin-left:17%;\">Output information about\ndownloading and applying package index list diffs, and\nerrors relating to package index list diffs.\n\n\n<b>Debug::pkgAcquire::RRed</b>\n\n<p style=\"margin-left:17%;\">Output information related to\npatching apt package lists when downloading index diffs\ninstead of full indices.\n\n\n<b>Debug::pkgAcquire::Worker</b>\n\n<p style=\"margin-left:17%;\">Log all interactions with the\nsub-processes that actually perform downloads.\n\n\n<b>Debug::pkgAutoRemove</b>\n\n<p style=\"margin-left:17%;\">Log events related to the\nautomatically-installed status of packages and to the\nremoval of unused packages.\n\n\n<b>Debug::pkgDepCache::AutoInstall</b>\n\n<p style=\"margin-left:17%;\">Generate debug messages\ndescribing which packages are being automatically installed\nto resolve dependencies. This corresponds to the initial\nauto-install pass performed in, e.g., apt-get install, and\nnot to the full apt dependency resolver; see\nDebug::pkgProblemResolver for that.\n\n\n<b>Debug::pkgDepCache::Marker</b>\n\n<p style=\"margin-left:17%;\">Generate debug messages\ndescribing which packages are marked as keep/install/remove\nwhile the ProblemResolver does his work. Each addition or\ndeletion may trigger additional actions; they are shown\nindented two additional spaces under the original entry. The\nformat for each line is MarkKeep, MarkDelete or MarkInstall\nfollowed by package-name &lt;a.b.c -&gt; d.e.f | x.y.z&gt;\n(section) where a.b.c is the current version of the package,\nd.e.f is the version considered for installation and x.y.z\nis a newer version, but not considered for installation\n(because of a low pin score). The later two can be omitted\nif there is none or if it is the same as the installed\nversion. section is the name of the section the package\nappears in.\n\n\n<b>Debug::pkgDPkgPM</b>\n\n<p style=\"margin-left:17%;\">When invoking <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>,\noutput the precise command line with which it is being\ninvoked, with arguments separated by a single space\ncharacter.\n\n\n<b>Debug::pkgDPkgProgressReporting</b>\n\n<p style=\"margin-left:17%;\">Output all the data received\nfrom <a href=\"https://man.page/1/dpkg\">dpkg(1)</a> on the status file descriptor and any\nerrors encountered while parsing it.\n\n\n<b>Debug::pkgOrderList</b>\n\n<p style=\"margin-left:17%;\">Generate a trace of the\nalgorithm that decides the order in which apt should pass\npackages to <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>.\n\n\n<b>Debug::pkgPackageManager</b>\n\n<p style=\"margin-left:17%;\">Output status messages tracing\nthe steps performed when invoking <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>.\n\n\n<b>Debug::pkgPolicy</b>\n\n<p style=\"margin-left:17%;\">Output the priority of each\npackage list on startup.\n\n\n<b>Debug::pkgProblemResolver</b>\n\n<p style=\"margin-left:17%;\">Trace the execution of the\ndependency resolver (this applies only to what happens when\na complex dependency problem is encountered).\n\n\n<b>Debug::pkgProblemResolver::ShowScores</b>\n\n<p style=\"margin-left:17%;\">Display a list of all installed\npackages with their calculated score used by the\npkgProblemResolver. The description of the package is the\nsame as described in Debug::pkgDepCache::Marker\n\n\n<b>Debug::sourceList</b>\n\n<p style=\"margin-left:17%;\">Print information about the\nvendors read from /etc/apt/vendors.list.\n\n\n<b>Debug::RunScripts</b>\n\n<p style=\"margin-left:17%;\">Display the external commands\nthat are called by apt hooks. This includes e.g. the config\noptions DPkg::{Pre,Post}-Invoke or\nAPT::Update::{Pre,Post}-Invoke.\n\n<h2>EXAMPLES\n<a name=\"EXAMPLES\"></a>\n</h2>\n\n\n\n/usr/share/doc/apt/examples/configure-index.gz\nis a configuration file showing example values for all\npossible options.\n\n<h2>FILES\n<a name=\"FILES\"></a>\n</h2>\n\n\n\n/etc/apt/apt.conf\n\n<p style=\"margin-left:17%;\">APT configuration file.\nConfiguration Item: Dir::Etc::Main.\n\n\n/etc/apt/apt.conf.d/\n\n<p style=\"margin-left:17%;\">APT configuration file\nfragments. Configuration Item: Dir::Etc::Parts.\n\n<h2>SEE ALSO\n<a name=\"SEE ALSO\"></a>\n</h2>\n\n\n\n<b>apt-cache</b>(8),\n<b>apt-config</b>(8), <a href=\"https://man.page/5/apt_preferences\">apt_preferences(5)</a>.\n\n<h2>BUGS\n<a name=\"BUGS\"></a>\n</h2>\n\n\n\n<b><font color=\"#0000FF\">APT\nbug page</font></b>\n<small><font color=\"#000000\">[1]</font></small>\n<font color=\"#000000\">. If you wish to report a bug in APT,\nplease see /usr/share/doc/debian/bug-reporting.txt or the\n<a href=\"https://man.page/1/reportbug\">reportbug(1)</a> command.</font>\n\n<h2>AUTHORS\n<a name=\"AUTHORS\"></a>\n</h2>\n\n\n\n<font color=\"#000000\"><b>Jason\nGunthorpe</b></font>\n\n\n<font color=\"#000000\"><b>APT\nteam</b></font>\n\n\n<font color=\"#000000\"><b>Daniel\nBurrows</b> &lt;dburrows@debian.org&gt;</font>\n\n<p style=\"margin-left:17%;\"><font color=\"#000000\">Initial\ndocumentation of Debug::*.</font>\n\n<h2>NOTES\n<a name=\"NOTES\"></a>\n</h2>\n\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"12%\"></td>\n<td width=\"3%\">\n\n\n\n<p style=\"margin-top: 1em\"><font color=\"#000000\">1.</font> </td>\n<td width=\"2%\"></td>\n<td width=\"18%\">\n\n\n<p style=\"margin-top: 1em\"><font color=\"#000000\">APT bug\npage</font> </td>\n<td width=\"65%\">\n</td></tr>\n</table>\n\n\n<p style=\"margin-left:17%;\"><font color=\"#000000\">http://bugs.debian.org/src:apt</font>","body":"\n\n<h1 align=\"center\">APT.CONF</h1>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<hr>\n\n\n<h2>NAME\n<a name=\"NAME\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">apt.conf -\nConfiguration file for APT</p>\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">/etc/apt/apt.conf\nis the main configuration file shared by all the tools in\nthe APT suite of tools, though it is by no means the only\nplace options can be set. The suite also shares a common\ncommand line parser to provide a uniform environment.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">When an APT\ntool starts up it will read the configuration files in the\nfollowing order:</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">1. the file\nspecified by the <b>APT_CONFIG</b> environment variable (if\nany)</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">2. all files in\nDir::Etc::Parts in alphanumeric ascending order which have\neither no or &quot;conf&quot; as filename extension and\nwhich only contain alphanumeric, hyphen (-), underscore (_)\nand period (.) characters. Otherwise APT will print a notice\nthat it has ignored a file, unless that file matches a\npattern in the Dir::Ignore-Files-Silently configuration list\n- in which case it will be silently ignored.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">3. the main\nconfiguration file specified by Dir::Etc::main</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">4. all options\nset in the binary specific configuration subtree are moved\ninto the root of the tree.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">5. the command\nline options are applied to override the configuration\ndirectives or to load even more configuration files.</p>\n\n<h2>SYNTAX\n<a name=\"SYNTAX\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nconfiguration file is organized in a tree with options\norganized into functional groups. Option specification is\ngiven with a double colon notation; for instance\nAPT::Get::Assume-Yes is an option within the APT tool group,\nfor the Get tool. Options do not inherit from their parent\ngroups.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Syntactically\nthe configuration language is modeled after what the ISC\ntools such as bind and dhcp use. Lines starting with // are\ntreated as comments (ignored), as well as all text between\n/* and */, just like C/C++ comments. Lines starting with #\nare also treated as comments. Each line is of the form\nAPT::Get::Assume-Yes &quot;true&quot;;. The quotation marks\nand trailing semicolon are required. The value must be on\none line, and there is no kind of string concatenation.\nValues must not include backslashes or extra quotation\nmarks. Option names are made up of alphanumeric characters\nand the characters &quot;/-:._+&quot;. A new scope can be\nopened with curly braces, like this:</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">APT { <br>\nGet { <br>\nAssume-Yes &quot;true&quot;; <br>\nFix-Broken &quot;true&quot;; <br>\n}; <br>\n};</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">with newlines\nplaced to make it more readable. Lists can be created by\nopening a scope and including a single string enclosed in\nquotes followed by a semicolon. Multiple entries can be\nincluded, separated by a semicolon.</p>\n\n\n<p style=\"margin-left:17%; margin-top: 1em\">DPkg::Pre-Install-Pkgs\n{&quot;/usr/sbin/dpkg-preconfigure --apt&quot;;};</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">In general the\nsample configuration file\n/usr/share/doc/apt/examples/configure-index.gz is a good\nguide for how it should look.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Case is not\nsignificant in names of configuration items, so in the\nprevious example you could use dpkg::pre-install-pkgs.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Names for the\nconfiguration items are optional if a list is defined as can\nbe seen in the DPkg::Pre-Install-Pkgs example above. If you\ndon't specify a name a new entry will simply add a new\noption to the list. If you specify a name you can override\nthe option in the same way as any other option by\nreassigning a new value to the option.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Two special\ncommands are defined: #include (which is deprecated and not\nsupported by alternative implementations) and #clear.\n#include will include the given file, unless the filename\nends in a slash, in which case the whole directory is\nincluded. #clear is used to erase a part of the\nconfiguration tree. The specified element and all its\ndescendants are erased. (Note that these lines also need to\nend with a semicolon.)</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The #clear\ncommand is the only way to delete a list or a complete\nscope. Reopening a scope (or using the syntax described\nbelow with an appended ::) will <i>not</i> override\npreviously written entries. Options can only be overridden\nby addressing a new value to them - lists and scopes can't\nbe overridden, only cleared.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">All of the APT\ntools take an -o option which allows an arbitrary\nconfiguration directive to be specified on the command line.\nThe syntax is a full option name (APT::Get::Assume-Yes for\ninstance) followed by an equals sign then the new value of\nthe option. To append a new element to a list, add a\ntrailing :: to the name of the list. (As you might suspect,\nthe scope syntax can't be used on the command line.)</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Note that\nappending items to a list using :: only works for one item\nper line, and that you should not use it in combination with\nthe scope syntax (which adds :: implicitly). Using both\nsyntaxes together will trigger a bug which some users\nunfortunately depend on: an option with the unusual name\n&quot;::&quot; which acts like every other option with a\nname. This introduces many problems; for one thing, users\nwho write multiple lines in this <i>wrong</i> syntax in the\nhope of appending to a list will achieve the opposite, as\nonly the last assignment for this option &quot;::&quot; will\nbe used. Future versions of APT will raise errors and stop\nworking if they encounter this misuse, so please correct\nsuch statements now while APT doesn't explicitly complain\nabout them.</p>\n\n<h2>THE APT GROUP\n<a name=\"THE APT GROUP\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">This group of\noptions controls general APT behavior as well as holding the\noptions for all of the tools.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Architecture</b></p>\n\n<p style=\"margin-left:17%;\">System Architecture; sets the\narchitecture to use when fetching files and parsing package\nlists. The internal default is the architecture apt was\ncompiled for.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Architectures</b></p>\n\n<p style=\"margin-left:17%;\">All Architectures the system\nsupports. For instance, CPUs implementing the amd64 (also\ncalled x86-64) instruction set are also able to execute\nbinaries compiled for the i386 (x86) instruction set. This\nlist is used when fetching files and parsing package lists.\nThe initial default is always the system's native\narchitecture (APT::Architecture), and foreign architectures\nare added to the default list when they are registered via\n<b>dpkg --add-architecture</b>.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Compressor</b></p>\n\n<p style=\"margin-left:17%;\">This scope defines which\ncompression formats are supported, how compression and\ndecompression can be performed if support for this format\nisn't built into apt directly and a cost-value indicating\nhow costly it is to compress something in this format. As an\nexample the following configuration stanza would allow apt\nto download and uncompress as well as create and store files\nwith the low-cost .reversed file extension which it will\npass to the command <b>rev</b> without additional\ncommandline parameters for compression and\nuncompression:</p>\n\n\n<p style=\"margin-left:23%; margin-top: 1em\">APT::Compressor::rev\n{</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"85%\">\n\n\n<p>Name &quot;rev&quot;;</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"85%\">\n\n\n<p>Extension &quot;.reversed&quot;;</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"85%\">\n\n\n<p>Binary &quot;rev&quot;;</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"85%\">\n\n\n<p>CompressArg {};</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"85%\">\n\n\n<p>UncompressArg {};</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"8%\"></td>\n<td width=\"7%\"></td>\n<td width=\"85%\">\n\n\n<p>Cost &quot;10&quot;;</p></td></tr>\n</table>\n\n<p style=\"margin-left:23%;\">};</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Build-Profiles</b></p>\n\n<p style=\"margin-left:17%;\">List of all build profiles\nenabled for build-dependency resolution, without the\n&quot;profile.&quot; namespace prefix. By default this list\nis empty. The <b>DEB_BUILD_PROFILES</b> as used by\n<a href=\"https://man.page/1/dpkg-buildpackage\">dpkg-buildpackage(1)</a> overrides the list notation.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Default-Release</b></p>\n\n<p style=\"margin-left:17%;\">Default release to install\npackages from if more than one version is available.\nContains release name, codename or release version.\nExamples: 'stable', 'testing', 'unstable', 'bullseye',\n'bookworm', '4.0', '5.0*'. See also\n<a href=\"https://man.page/5/apt_preferences\">apt_preferences(5)</a>.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Ignore-Hold</b></p>\n\n<p style=\"margin-left:17%;\">Ignore held packages; this\nglobal option causes the problem resolver to ignore held\npackages in its decision making.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Clean-Installed</b></p>\n\n<p style=\"margin-left:17%;\">Defaults to on. When turned on\nthe autoclean feature will remove any packages which can no\nlonger be downloaded from the cache. If turned off then\npackages that are locally installed are also excluded from\ncleaning - but note that APT provides no direct means to\nreinstall them.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Immediate-Configure</b></p>\n\n<p style=\"margin-left:17%;\">Defaults to on, which will\ncause APT to install essential and important packages as\nsoon as possible in an install/upgrade operation, in order\nto limit the effect of a failing <a href=\"https://man.page/1/dpkg\">dpkg(1)</a> call. If\nthis option is disabled, APT treats an important package in\nthe same way as an extra package: between the unpacking of\nthe package A and its configuration there can be many other\nunpack or configuration calls for other unrelated packages\nB, C etc. If these cause the <a href=\"https://man.page/1/dpkg\">dpkg(1)</a> call to fail\n(e.g. because package B's maintainer scripts generate an\nerror), this results in a system state in which package A is\nunpacked but unconfigured - so any package depending on A is\nnow no longer guaranteed to work, as its dependency on A is\nno longer satisfied.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">The immediate\nconfiguration marker is also applied in the potentially\nproblematic case of circular dependencies, since a\ndependency with the immediate flag is equivalent to a\nPre-Dependency. In theory this allows APT to recognise a\nsituation in which it is unable to perform immediate\nconfiguration, abort, and suggest to the user that the\noption should be temporarily deactivated in order to allow\nthe operation to proceed. Note the use of the word\n&quot;theory&quot; here; in the real world this problem has\nrarely been encountered, in non-stable distribution\nversions, and was caused by wrong dependencies of the\npackage in question or by a system in an already broken\nstate; so you should not blindly disable this option, as the\nscenario mentioned above is not the only problem it can help\nto prevent in the first place.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Before a big\noperation like dist-upgrade is run with this option disabled\nyou should try to explicitly install the package APT is\nunable to configure immediately; but please make sure you\nalso report your problem to your distribution and to the APT\nteam with the bug link below, so they can work on improving\nor correcting the upgrade process.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Force-LoopBreak</b></p>\n\n<p style=\"margin-left:17%;\">Never enable this option unless\nyou <i>really</i> know what you are doing. It permits APT to\ntemporarily remove an essential package to break a\nConflicts/Conflicts or Conflicts/Pre-Depends loop between\ntwo essential packages. <i>Such a loop should never exist\nand is a grave bug</i>. This option will work if the\nessential packages are not <b>tar</b>, <b>gzip</b>,\n<b>libc</b>, <b>dpkg</b>, <b>dash</b> or anything that those\npackages depend on.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Cache-Start</b>,\n<b>Cache-Grow</b>, <b>Cache-Limit</b></p>\n\n<p style=\"margin-left:17%;\">APT uses since version 0.7.26 a\nresizable memory mapped cache file to store the available\ninformation. Cache-Start acts as a hint of the size the\ncache will grow to, and is therefore the amount of memory\nAPT will request at startup. The default value is 20971520\nbytes (~20 MB). Note that this amount of space needs to be\navailable for APT; otherwise it will likely fail\nungracefully, so for memory restricted devices this value\nshould be lowered while on systems with a lot of configured\nsources it should be increased. Cache-Grow defines in bytes\nwith the default of 1048576 (~1 MB) how much the cache size\nwill be increased in the event the space defined by\nCache-Start is not enough. This value will be applied again\nand again until either the cache is big enough to store all\ninformation or the size of the cache reaches the\nCache-Limit. The default of Cache-Limit is 0 which stands\nfor no limit. If Cache-Grow is set to 0 the automatic growth\nof the cache is disabled.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Build-Essential</b></p>\n\n<p style=\"margin-left:17%;\">Defines which packages are\nconsidered essential build dependencies.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Get</b></p>\n\n<p style=\"margin-left:17%;\">The Get subsection controls the\n<b>apt-get</b>(8) tool; please see its documentation for\nmore information about the options here.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Cache</b></p>\n\n<p style=\"margin-left:17%;\">The Cache subsection controls\nthe <b>apt-cache</b>(8) tool; please see its documentation\nfor more information about the options here.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>CDROM</b></p>\n\n<p style=\"margin-left:17%;\">The CDROM subsection controls\nthe <b>apt-cdrom</b>(8) tool; please see its documentation\nfor more information about the options here.</p>\n\n<h2>THE ACQUIRE GROUP\n<a name=\"THE ACQUIRE GROUP\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The Acquire\ngroup of options controls the download of packages as well\nas the various &quot;acquire methods&quot; responsible for\nthe download itself (see also <b>sources.list</b>(5)).</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Check-Date</b></p>\n\n<p style=\"margin-left:17%;\">Security related option\ndefaulting to true, enabling time-related checks. Disabling\nit means that the machine's time cannot be trusted, and APT\nwill hence disable all time-related checks, such as\n<b>Check-Valid-Until</b> and verifying that the Date field\nof a release file is not in the future.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Max-FutureTime</b></p>\n\n<p style=\"margin-left:17%;\">Maximum time (in seconds)\nbefore its creation (as indicated by the Date header) that\nthe Release file should be considered valid. The default\nvalue is 10. Archive specific settings can be made by\nappending the label of the archive to the option name.\nPreferably, the same can be achieved for specific\n<b>sources.list</b>(5) entries by using the\n<b>Date-Max-Future</b> option there.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Check-Valid-Until</b></p>\n\n<p style=\"margin-left:17%;\">Security related option\ndefaulting to true, as giving a Release file's validation an\nexpiration date prevents replay attacks over a long\ntimescale, and can also for example help users to identify\nmirrors that are no longer updated - but the feature depends\non the correctness of the clock on the user system. Archive\nmaintainers are encouraged to create Release files with the\nValid-Until header, but if they don't or a stricter value is\ndesired the Max-ValidTime option below can be used. The\n<b>Check-Valid-Until</b> option of <b>sources.list</b>(5)\nentries should be preferred to disable the check selectively\ninstead of using this global override.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Max-ValidTime</b></p>\n\n<p style=\"margin-left:17%;\">Maximum time (in seconds) after\nits creation (as indicated by the Date header) that the\nRelease file should be considered valid. If the Release file\nitself includes a Valid-Until header the earlier date of the\ntwo is used as the expiration date. The default value is 0\nwhich stands for &quot;valid forever&quot;. Archive specific\nsettings can be made by appending the label of the archive\nto the option name. Preferably, the same can be achieved for\nspecific <b>sources.list</b>(5) entries by using the\n<b>Valid-Until-Max</b> option there.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Min-ValidTime</b></p>\n\n<p style=\"margin-left:17%;\">Minimum time (in seconds) after\nits creation (as indicated by the Date header) that the\nRelease file should be considered valid. Use this if you\nneed to use a seldom updated (local) mirror of a more\nfrequently updated archive with a Valid-Until header instead\nof completely disabling the expiration date checking.\nArchive specific settings can and should be used by\nappending the label of the archive to the option name.\nPreferably, the same can be achieved for specific\n<b>sources.list</b>(5) entries by using the\n<b>Valid-Until-Min</b> option there.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>AllowTLS</b></p>\n\n<p style=\"margin-left:17%;\">Allow use of the internal TLS\nsupport in the http method. If set to false, this completely\ndisables support for TLS in apt's own methods (excluding the\ncurl-based https method). No TLS-related functions will be\ncalled anymore.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>PDiffs</b></p>\n\n<p style=\"margin-left:17%;\">Try to download deltas called\nPDiffs for indexes (like Packages files) instead of\ndownloading whole ones. True by default. Preferably, this\ncan be set for specific <b>sources.list</b>(5) entries or\nindex files by using the <b>PDiffs</b> option there.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Two sub-options\nto limit the use of PDiffs are also available: FileLimit can\nbe used to specify a maximum number of PDiff files should be\ndownloaded to update a file. SizeLimit on the other hand is\nthe maximum percentage of the size of all patches compared\nto the size of the targeted file. If one of these limits is\nexceeded the complete file is downloaded instead of the\npatches.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>By-Hash</b></p>\n\n<p style=\"margin-left:17%;\">Try to download indexes via an\nURI constructed from a hashsum of the expected file rather\nthan downloaded via a well-known stable filename. True by\ndefault, but automatically disabled if the source indicates\nno support for it. Usage can be forced with the special\nvalue &quot;force&quot;. Preferably, this can be set for\nspecific <b>sources.list</b>(5) entries or index files by\nusing the <b>By-Hash</b> option there.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Queue-Mode</b></p>\n\n<p style=\"margin-left:17%;\">Queuing mode; Queue-Mode can be\none of host or access which determines how APT parallelizes\noutgoing connections. host means that one connection per\ntarget host will be opened, access means that one connection\nper URI type will be opened.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Retries</b></p>\n\n<p style=\"margin-left:17%;\">Number of retries to perform.\nIf this is non-zero APT will retry failed files the given\nnumber of times.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Source-Symlinks</b></p>\n\n<p style=\"margin-left:17%;\">Use symlinks for source\narchives. If set to true then source archives will be\nsymlinked when possible instead of copying. True is the\ndefault.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>http\nhttps</b></p>\n\n<p style=\"margin-left:17%;\">The options in these scopes\nconfigure APT's acquire transports for the protocols HTTP\nand HTTPS and are documented in the\n<a href=\"https://man.page/1/apt-transport-http\">apt-transport-http(1)</a> and\n<a href=\"https://man.page/1/apt-transport-https\">apt-transport-https(1)</a> manpages respectively.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>ftp</b></p>\n\n<p style=\"margin-left:17%;\">ftp::Proxy sets the default\nproxy to use for FTP URIs. It is in the standard form of\nftp://[[user][:pass]@]host[:port]/. Per host proxies can\nalso be specified by using the form ftp::Proxy::&lt;host&gt;\nwith the special keyword DIRECT meaning to use no proxies.\nIf no one of the above settings is specified,\n<b>ftp_proxy</b> environment variable will be used. To use\nan FTP proxy you will have to set the ftp::ProxyLogin script\nin the configuration file. This entry specifies the commands\nto send to tell the proxy server what to connect to. Please\nsee /usr/share/doc/apt/examples/configure-index.gz for an\nexample of how to do this. The substitution variables\nrepresenting the corresponding URI component are\n$(PROXY_USER), $(PROXY_PASS), $(SITE_USER), $(SITE_PASS),\n$(SITE) and $(SITE_PORT).</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">The option\ntimeout sets the timeout timer used by the method; this\nvalue applies to the connection as well as the data\ntimeout.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Several\nsettings are provided to control passive mode. Generally it\nis safe to leave passive mode on; it works in nearly every\nenvironment. However, some situations require that passive\nmode be disabled and port mode FTP used instead. This can be\ndone globally or for connections that go through a proxy or\nfor a specific host (see the sample config file for\nexamples).</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">It is possible\nto proxy FTP over HTTP by setting the <b>ftp_proxy</b>\nenvironment variable to an HTTP URL - see the discussion of\nthe http method above for syntax. You cannot set this in the\nconfiguration file and it is not recommended to use FTP over\nHTTP due to its low efficiency.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">The setting\nForceExtended controls the use of RFC2428 EPSV and EPRT\ncommands. The default is false, which means these commands\nare only used if the control connection is IPv6. Setting\nthis to true forces their use even on IPv4 connections. Note\nthat most FTP servers do not support RFC2428.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>cdrom</b></p>\n\n<p style=\"margin-left:17%;\">For URIs using the cdrom\nmethod, the only configurable option is the mount point,\ncdrom::Mount, which must be the mount point for the CD-ROM\n(or DVD, or whatever) drive as specified in /etc/fstab. It\nis possible to provide alternate mount and unmount commands\nif your mount point cannot be listed in the fstab. The\nsyntax is to put</p>\n\n<p style=\"margin-left:23%; margin-top: 1em\">/cdrom/::Mount\n&quot;foo&quot;;</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">within the\ncdrom block. It is important to have the trailing slash.\nUnmount commands can be specified using UMount.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>gpgv</b></p>\n\n<p style=\"margin-left:17%;\">For GPGV URIs the only\nconfigurable option is gpgv::Options, which passes\nadditional parameters to gpgv.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>CompressionTypes</b></p>\n\n<p style=\"margin-left:17%;\">List of compression types which\nare understood by the acquire methods. Files like Packages\ncan be available in various compression formats. By default\nthe acquire methods can decompress and recompress many\ncommon formats like <b>xz</b> and <b>gzip</b>; with this\nscope the supported formats can be queried, modified as well\nas support for more formats added (see also\n<b>APT::Compressor</b>). The syntax for this is:</p>\n\n\n<p style=\"margin-left:23%; margin-top: 1em\">Acquire::CompressionTypes::<i>FileExtension</i>\n&quot;<i>Methodname</i>&quot;;</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Also, the Order\nsubgroup can be used to define in which order the acquire\nsystem will try to download the compressed files. The\nacquire system will try the first and proceed with the next\ncompression type in this list on error, so to prefer one\nover the other type simply add the preferred type first -\ntypes not already added will be implicitly appended to the\nend of the list, so e.g.</p>\n\n\n<p style=\"margin-left:23%; margin-top: 1em\">Acquire::CompressionTypes::Order::\n&quot;gz&quot;;</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">can be used to\nprefer <b>gzip</b> compressed files over all other\ncompression formats. If <b>xz</b> should be preferred over\n<b>gzip</b> and <b>bzip2</b> the configure setting should\nlook like this:</p>\n\n\n<p style=\"margin-left:23%; margin-top: 1em\">Acquire::CompressionTypes::Order\n{ &quot;xz&quot;; &quot;gz&quot;; };</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">It is not\nneeded to add bz2 to the list explicitly as it will be added\nautomatically.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Note that the\nDir::Bin::<i>Methodname</i> will be checked at run time. If\nthis option has been set and support for this format isn't\ndirectly built into apt, the method will only be used if\nthis file exists; e.g. for the bzip2 method (the inbuilt)\nsetting is:</p>\n\n\n<p style=\"margin-left:23%; margin-top: 1em\">Dir::Bin::bzip2\n&quot;/bin/bzip2&quot;;</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Note also that\nlist entries specified on the command line will be added at\nthe end of the list specified in the configuration files,\nbut before the default entries. To prefer a type in this\ncase over the ones specified in the configuration files you\ncan set the option direct - not in list style. This will not\noverride the defined list; it will only prefix the list with\nthis type.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">The special\ntype uncompressed can be used to give uncompressed files a\npreference, but note that most archives don't provide\nuncompressed files so this is mostly only usable for local\nmirrors.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>GzipIndexes</b></p>\n\n<p style=\"margin-left:17%;\">When downloading gzip\ncompressed indexes (Packages, Sources, or Translations),\nkeep them gzip compressed locally instead of unpacking them.\nThis saves quite a lot of disk space at the expense of more\nCPU requirements when building the local package caches.\nFalse by default.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Languages</b></p>\n\n<p style=\"margin-left:17%;\">The Languages subsection\ncontrols which Translation files are downloaded and in which\norder APT tries to display the description-translations. APT\nwill try to display the first available description in the\nlanguage which is listed first. Languages can be defined\nwith their short or long language codes. Note that not all\narchives provide Translation files for every language - the\nlong language codes are especially rare.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">The default\nlist includes &quot;environment&quot; and &quot;en&quot;.\n&quot;environment&quot; has a special meaning here: it will\nbe replaced at runtime with the language codes extracted\nfrom the LC_MESSAGES environment variable. It will also\nensure that these codes are not included twice in the list.\nIf LC_MESSAGES is set to &quot;C&quot; only the\nTranslation-en file (if available) will be used. To force\nAPT to use no Translation file use the setting\nAcquire::Languages=none. &quot;none&quot; is another special\nmeaning code which will stop the search for a suitable\nTranslation file. This tells APT to download these\ntranslations too, without actually using them unless the\nenvironment specifies the languages. So the following\nexample configuration will result in the order &quot;en,\nde&quot; in an English locale or &quot;de, en&quot; in a\nGerman one. Note that &quot;fr&quot; is downloaded, but not\nused unless APT is used in a French locale (where the order\nwould be &quot;fr, de, en&quot;).</p>\n\n\n<p style=\"margin-left:23%; margin-top: 1em\">Acquire::Languages\n{ &quot;environment&quot;; &quot;de&quot;; &quot;en&quot;;\n&quot;none&quot;; &quot;fr&quot;; };</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Note: To\nprevent problems resulting from APT being executed in\ndifferent environments (e.g. by different users or by other\nprograms) all Translation files which are found in\n/var/lib/apt/lists/ will be added to the end of the list\n(after an implicit &quot;none&quot;).</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>ForceIPv4</b></p>\n\n<p style=\"margin-left:17%;\">When downloading, force to use\nonly the IPv4 protocol.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>ForceIPv6</b></p>\n\n<p style=\"margin-left:17%;\">When downloading, force to use\nonly the IPv6 protocol.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>MaxReleaseFileSize</b></p>\n\n<p style=\"margin-left:17%;\">The maximum file size of\nRelease/Release.gpg/InRelease files. The default is\n10MB.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>EnableSrvRecords</b></p>\n\n<p style=\"margin-left:17%;\">This option controls if apt\nwill use the DNS SRV server record as specified in RFC 2782\nto select an alternative server to connect to. The default\nis &quot;true&quot;.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>AllowInsecureRepositories</b></p>\n\n<p style=\"margin-left:17%;\">Allow update operations to load\ndata files from repositories without sufficient security\ninformation. The default value is &quot;false&quot;.\nConcept, implications as well as alternatives are detailed\nin <b>apt-secure</b>(8).</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>AllowWeakRepositories</b></p>\n\n<p style=\"margin-left:17%;\">Allow update operations to load\ndata files from repositories which provide security\ninformation, but these are deemed no longer\ncryptographically strong enough. The default value is\n&quot;false&quot;. Concept, implications as well as\nalternatives are detailed in <b>apt-secure</b>(8).</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>AllowDowngradeToInsecureRepositories</b></p>\n\n<p style=\"margin-left:17%;\">Allow that a repository that\nwas previously gpg signed to become unsigned during an\nupdate operation. When there is no valid signature for a\npreviously trusted repository apt will refuse the update.\nThis option can be used to override this protection. You\nalmost certainly never want to enable this. The default is\nfalse. Concept, implications as well as alternatives are\ndetailed in <b>apt-secure</b>(8).</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Changelogs::URI</b>\nscope</p>\n\n<p style=\"margin-left:17%;\">Acquiring changelogs can only\nbe done if an URI is known from where to get them.\nPreferable the Release file indicates this in a 'Changelogs'\nfield. If this isn't available the Label/Origin field of the\nRelease file is used to check if a\nAcquire::Changelogs::URI::Label::<i>LABEL</i> or\nAcquire::Changelogs::URI::Origin::<i>ORIGIN</i> option\nexists and if so this value is taken. The value in the\nRelease file can be overridden with\nAcquire::Changelogs::URI::Override::Label::<i>LABEL</i> or\nAcquire::Changelogs::URI::Override::Origin::<i>ORIGIN</i>.\nThe value should be a normal URI to a text file, except that\npackage specific data is replaced with the placeholder\n@CHANGEPATH@. The value for it is: 1. if the package is from\na component (e.g. main) this is the first part otherwise it\nis omitted, 2. the first letter of source package name,\nexcept if the source package name starts with 'lib' in which\ncase it will be the first four letters. 3. The complete\nsource package name. 4. the complete name again and 5. the\nsource version. The first (if present), second, third and\nfourth part are separated by a slash ('/') and between the\nfourth and fifth part is an underscore ('_'). The special\nvalue 'no' is available for this option indicating that this\nsource can't be used to acquire changelog files from.\nAnother source will be tried if available in this case.</p>\n\n<h2>BINARY SPECIFIC CONFIGURATION\n<a name=\"BINARY SPECIFIC CONFIGURATION\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Especially with\nthe introduction of the <b>apt</b> binary it can be useful\nto set certain options only for a specific binary as even\noptions which look like they would effect only a certain\nbinary like <b>APT::Get::Show-Versions</b> effect\n<b>apt-get</b> as well as <b>apt</b>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Setting an\noption for a specific binary only can be achieved by setting\nthe option inside the <b>Binary::</b><i>specific-binary</i>\nscope. Setting the option <b>APT::Get::Show-Versions</b> for\nthe <b>apt</b> only can e.g. by done by setting\n<b>Binary::apt::APT::Get::Show-Versions</b> instead.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Note that as\nseen in the DESCRIPTION section further above you can't set\nbinary-specific options on the commandline itself nor in\nconfiguration files loaded via the commandline.</p>\n\n<h2>DIRECTORIES\n<a name=\"DIRECTORIES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The Dir::State\nsection has directories that pertain to local state\ninformation. lists is the directory to place downloaded\npackage lists in and status is the name of the\n<a href=\"https://man.page/1/dpkg\">dpkg(1)</a> status file. preferences is the name of the\nAPT preferences file. Dir::State contains the default\ndirectory to prefix on all sub-items if they do not start\nwith / or ./.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Dir::Cache\ncontains locations pertaining to local cache information,\nsuch as the two package caches srcpkgcache and pkgcache as\nwell as the location to place downloaded archives,\nDir::Cache::archives. Generation of caches can be turned off\nby setting pkgcache or srcpkgcache to &quot;&quot;. This\nwill slow down startup but save disk space. It is probably\npreferable to turn off the pkgcache rather than the\nsrcpkgcache. Like Dir::State the default directory is\ncontained in Dir::Cache</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Dir::Etc\ncontains the location of configuration files, sourcelist\ngives the location of the sourcelist and main is the default\nconfiguration file (setting has no effect, unless it is done\nfrom the config file specified by <b>APT_CONFIG</b>).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The Dir::Parts\nsetting reads in all the config fragments in lexical order\nfrom the directory specified. After this is done then the\nmain config file is loaded.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Binary programs\nare pointed to by Dir::Bin. Dir::Bin::Methods specifies the\nlocation of the method handlers and gzip, bzip2, lzma, dpkg,\napt-get dpkg-source dpkg-buildpackage and apt-cache specify\nthe location of the respective programs.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nconfiguration item RootDir has a special meaning. If set,\nall paths will be relative to RootDir, <i>even paths that\nare specified absolutely</i>. So, for instance, if RootDir\nis set to /tmp/staging and Dir::State::status is set to\n/var/lib/dpkg/status, then the status file will be looked up\nin /tmp/staging/var/lib/dpkg/status. If you want to prefix\nonly relative paths, set Dir instead.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nIgnore-Files-Silently list can be used to specify which\nfiles APT should silently ignore while parsing the files in\nthe fragment directories. Per default a file which ends with\n.disabled, ~, .bak or .dpkg-[a-z]+ is silently ignored. As\nseen in the last default value these patterns can use\nregular expression syntax.</p>\n\n<h2>APT IN DSELECT\n<a name=\"APT IN DSELECT\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">When APT is\nused as a <a href=\"https://man.page/1/dselect\">dselect(1)</a> method several configuration\ndirectives control the default behavior. These are in the\nDSelect section.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Clean</b></p>\n\n<p style=\"margin-left:17%;\">Cache Clean mode; this value\nmay be one of always, prompt, auto, pre-auto and never.\nalways and prompt will remove all packages from the cache\nafter upgrading, prompt (the default) does so conditionally.\nauto removes only those packages which are no longer\ndownloadable (replaced with a new version for instance).\npre-auto performs this action before downloading new\npackages.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>options</b></p>\n\n<p style=\"margin-left:17%;\">The contents of this variable\nare passed to <b>apt-get</b>(8) as command line options when\nit is run for the install phase.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Updateoptions</b></p>\n\n<p style=\"margin-left:17%;\">The contents of this variable\nare passed to <b>apt-get</b>(8) as command line options when\nit is run for the update phase.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>PromptAfterUpdate</b></p>\n\n<p style=\"margin-left:17%;\">If true the [U]pdate operation\nin <a href=\"https://man.page/1/dselect\">dselect(1)</a> will always prompt to continue. The\ndefault is to prompt only on error.</p>\n\n<h2>HOW APT CALLS DPKG(1)\n<a name=\"HOW APT CALLS DPKG(1)\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Several\nconfiguration directives control how APT invokes\n<a href=\"https://man.page/1/dpkg\">dpkg(1)</a>. These are in the DPkg section.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>options</b></p>\n\n<p style=\"margin-left:17%;\">This is a list of options to\npass to <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>. The options must be specified using\nthe list notation and each list item is passed as a single\nargument to <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Path</b></p>\n\n<p style=\"margin-left:17%;\">This is a string that defines\nthe <b>PATH</b> environment variable used when running dpkg.\nIt may be set to any valid value of that environment\nvariable; or the empty string, in which case the variable is\nnot changed.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Pre-Invoke</b>,\n<b>Post-Invoke</b></p>\n\n<p style=\"margin-left:17%;\">This is a list of shell\ncommands to run before/after invoking <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>. Like\noptions this must be specified in list notation. The\ncommands are invoked in order using /bin/sh; should any fail\nAPT will abort.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Pre-Install-Pkgs</b></p>\n\n<p style=\"margin-left:17%;\">This is a list of shell\ncommands to run before invoking <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>. Like options\nthis must be specified in list notation. The commands are\ninvoked in order using /bin/sh; should any fail APT will\nabort. APT will pass the filenames of all .deb files it is\ngoing to install to the commands, one per line on the\nrequested file descriptor, defaulting to standard input.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Version 2 of\nthis protocol sends more information through the requested\nfile descriptor: a line with the text VERSION 2, the APT\nconfiguration space, and a list of package actions with\nfilename and version information.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Each\nconfiguration directive line has the form key=value. Special\ncharacters (equal signs, newlines, nonprintable characters,\nquotation marks, and percent signs in key and newlines,\nnonprintable characters, and percent signs in value) are\n%-encoded. Lists are represented by multiple key::=value\nlines with the same key. The configuration section ends with\na blank line.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Package action\nlines consist of five fields in Version 2: package name\n(without architecture qualification even if foreign), old\nversion, direction of version change (&lt; for upgrades,\n&gt; for downgrades, = for no change), new version, action.\nThe version fields are &quot;-&quot; for no version at all\n(for example when installing a package for the first time;\nno version is treated as earlier than any real version, so\nthat is an upgrade, indicated as - &lt; 1.23.4). The action\nfield is &quot;**CONFIGURE**&quot; if the package is being\nconfigured, &quot;**REMOVE**&quot; if it is being removed,\nor the filename of a .deb file if it is being unpacked.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">In Version 3\nafter each version field follows the architecture of this\nversion, which is &quot;-&quot; if there is no version, and\na field showing the MultiArch type &quot;same&quot;,\n&quot;foreign&quot;, &quot;allowed&quot; or\n&quot;none&quot;. Note that &quot;none&quot; is an incorrect\ntypename which is just kept to remain compatible, it should\nbe read as &quot;no&quot; and users are encouraged to\nsupport both.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">The version of\nthe protocol to be used for the command <i>cmd</i> can be\nchosen by setting DPkg::Tools::options::<i>cmd</i>::Version\naccordingly, the default being version 1. If APT isn't\nsupporting the requested version it will send the\ninformation in the highest version it has support for\ninstead.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">The file\ndescriptor to be used to send the information can be\nrequested with DPkg::Tools::options::<i>cmd</i>::InfoFD\nwhich defaults to 0 for standard input and is available\nsince version 0.9.11. Support for the option can be detected\nby looking for the environment variable\n<b>APT_HOOK_INFO_FD</b> which contains the number of the\nused file descriptor as a confirmation.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Run-Directory</b></p>\n\n<p style=\"margin-left:17%;\">APT chdirs to this directory\nbefore invoking <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>, the default is /.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Build-options</b></p>\n\n<p style=\"margin-left:17%;\">These options are passed to\n<a href=\"https://man.page/1/dpkg-buildpackage\">dpkg-buildpackage(1)</a> when compiling packages; the\ndefault is to disable signing and produce all binaries.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>DPkg::ConfigurePending</b></p>\n\n<p style=\"margin-left:17%;\">If this option is set APT will\ncall <b>dpkg --configure --pending</b> to let <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>\nhandle all required configurations and triggers. This option\nis activated by default, but deactivating it could be useful\nif you want to run APT multiple times in a row - e.g. in an\ninstaller. In this scenario you could deactivate this option\nin all but the last run.</p>\n\n<h2>PERIODIC AND ARCHIVES OPTIONS\n<a name=\"PERIODIC AND ARCHIVES OPTIONS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">APT::Periodic\nand APT::Archives groups of options configure behavior of\napt periodic updates, which is done by the\n/usr/lib/apt/apt.systemd.daily script. See the top of this\nscript for the brief documentation of these options.</p>\n\n<h2>DEBUG OPTIONS\n<a name=\"DEBUG OPTIONS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Enabling\noptions in the Debug:: section will cause debugging\ninformation to be sent to the standard error stream of the\nprogram utilizing the apt libraries, or enable special\nprogram modes that are primarily useful for debugging the\nbehavior of apt. Most of these options are not interesting\nto a normal user, but a few may be:</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\nDebug::pkgProblemResolver enables output about the decisions\nmade by dist-upgrade, upgrade, install, remove, purge.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\nDebug::NoLocking disables all file locking. This can be used\nto run some operations (for instance, apt-get -s install) as\na non-root user.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\nDebug::pkgDPkgPM prints out the actual command line each\ntime that apt invokes <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\nDebug::IdentCdrom disables the inclusion of statfs data in\nCD-ROM IDs.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A full list of\ndebugging options to apt follows.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::Acquire::cdrom</b></p>\n\n<p style=\"margin-left:17%;\">Print information related to\naccessing cdrom:// sources.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::Acquire::ftp</b></p>\n\n<p style=\"margin-left:17%;\">Print information related to\ndownloading packages using FTP.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::Acquire::http</b></p>\n\n<p style=\"margin-left:17%;\">Print information related to\ndownloading packages using HTTP.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::Acquire::https</b></p>\n\n<p style=\"margin-left:17%;\">Print information related to\ndownloading packages using HTTPS.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::Acquire::gpgv</b></p>\n\n<p style=\"margin-left:17%;\">Print information related to\nverifying cryptographic signatures using gpg.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::aptcdrom</b></p>\n\n<p style=\"margin-left:17%;\">Output information about the\nprocess of accessing collections of packages stored on\nCD-ROMs.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::BuildDeps</b></p>\n\n<p style=\"margin-left:17%;\">Describes the process of\nresolving build-dependencies in <b>apt-get</b>(8).</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::Hashes</b></p>\n\n<p style=\"margin-left:17%;\">Output each cryptographic hash\nthat is generated by the apt libraries.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::IdentCDROM</b></p>\n\n<p style=\"margin-left:17%;\">Do not include information from\nstatfs, namely the number of used and free blocks on the\nCD-ROM filesystem, when generating an ID for a CD-ROM.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::NoLocking</b></p>\n\n<p style=\"margin-left:17%;\">Disable all file locking. For\ninstance, this will allow two instances of &ldquo;apt-get\nupdate&rdquo; to run at the same time.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgAcquire</b></p>\n\n<p style=\"margin-left:17%;\">Log when items are added to or\nremoved from the global download queue.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgAcquire::Auth</b></p>\n\n<p style=\"margin-left:17%;\">Output status messages and\nerrors related to verifying checksums and cryptographic\nsignatures of downloaded files.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgAcquire::Diffs</b></p>\n\n<p style=\"margin-left:17%;\">Output information about\ndownloading and applying package index list diffs, and\nerrors relating to package index list diffs.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgAcquire::RRed</b></p>\n\n<p style=\"margin-left:17%;\">Output information related to\npatching apt package lists when downloading index diffs\ninstead of full indices.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgAcquire::Worker</b></p>\n\n<p style=\"margin-left:17%;\">Log all interactions with the\nsub-processes that actually perform downloads.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgAutoRemove</b></p>\n\n<p style=\"margin-left:17%;\">Log events related to the\nautomatically-installed status of packages and to the\nremoval of unused packages.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgDepCache::AutoInstall</b></p>\n\n<p style=\"margin-left:17%;\">Generate debug messages\ndescribing which packages are being automatically installed\nto resolve dependencies. This corresponds to the initial\nauto-install pass performed in, e.g., apt-get install, and\nnot to the full apt dependency resolver; see\nDebug::pkgProblemResolver for that.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgDepCache::Marker</b></p>\n\n<p style=\"margin-left:17%;\">Generate debug messages\ndescribing which packages are marked as keep/install/remove\nwhile the ProblemResolver does his work. Each addition or\ndeletion may trigger additional actions; they are shown\nindented two additional spaces under the original entry. The\nformat for each line is MarkKeep, MarkDelete or MarkInstall\nfollowed by package-name &lt;a.b.c -&gt; d.e.f | x.y.z&gt;\n(section) where a.b.c is the current version of the package,\nd.e.f is the version considered for installation and x.y.z\nis a newer version, but not considered for installation\n(because of a low pin score). The later two can be omitted\nif there is none or if it is the same as the installed\nversion. section is the name of the section the package\nappears in.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgDPkgPM</b></p>\n\n<p style=\"margin-left:17%;\">When invoking <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>,\noutput the precise command line with which it is being\ninvoked, with arguments separated by a single space\ncharacter.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgDPkgProgressReporting</b></p>\n\n<p style=\"margin-left:17%;\">Output all the data received\nfrom <a href=\"https://man.page/1/dpkg\">dpkg(1)</a> on the status file descriptor and any\nerrors encountered while parsing it.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgOrderList</b></p>\n\n<p style=\"margin-left:17%;\">Generate a trace of the\nalgorithm that decides the order in which apt should pass\npackages to <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgPackageManager</b></p>\n\n<p style=\"margin-left:17%;\">Output status messages tracing\nthe steps performed when invoking <a href=\"https://man.page/1/dpkg\">dpkg(1)</a>.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgPolicy</b></p>\n\n<p style=\"margin-left:17%;\">Output the priority of each\npackage list on startup.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgProblemResolver</b></p>\n\n<p style=\"margin-left:17%;\">Trace the execution of the\ndependency resolver (this applies only to what happens when\na complex dependency problem is encountered).</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::pkgProblemResolver::ShowScores</b></p>\n\n<p style=\"margin-left:17%;\">Display a list of all installed\npackages with their calculated score used by the\npkgProblemResolver. The description of the package is the\nsame as described in Debug::pkgDepCache::Marker</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::sourceList</b></p>\n\n<p style=\"margin-left:17%;\">Print information about the\nvendors read from /etc/apt/vendors.list.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Debug::RunScripts</b></p>\n\n<p style=\"margin-left:17%;\">Display the external commands\nthat are called by apt hooks. This includes e.g. the config\noptions DPkg::{Pre,Post}-Invoke or\nAPT::Update::{Pre,Post}-Invoke.</p>\n\n<h2>EXAMPLES\n<a name=\"EXAMPLES\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">/usr/share/doc/apt/examples/configure-index.gz\nis a configuration file showing example values for all\npossible options.</p>\n\n<h2>FILES\n<a name=\"FILES\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">/etc/apt/apt.conf</p>\n\n<p style=\"margin-left:17%;\">APT configuration file.\nConfiguration Item: Dir::Etc::Main.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">/etc/apt/apt.conf.d/</p>\n\n<p style=\"margin-left:17%;\">APT configuration file\nfragments. Configuration Item: Dir::Etc::Parts.</p>\n\n<h2>SEE ALSO\n<a name=\"SEE ALSO\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>apt-cache</b>(8),\n<b>apt-config</b>(8), <a href=\"https://man.page/5/apt_preferences\">apt_preferences(5)</a>.</p>\n\n<h2>BUGS\n<a name=\"BUGS\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b><font color=\"#0000FF\">APT\nbug page</font></b>\n<small><font color=\"#000000\">[1]</font></small>\n<font color=\"#000000\">. If you wish to report a bug in APT,\nplease see /usr/share/doc/debian/bug-reporting.txt or the\n<a href=\"https://man.page/1/reportbug\">reportbug(1)</a> command.</font></p>\n\n<h2>AUTHORS\n<a name=\"AUTHORS\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><font color=\"#000000\"><b>Jason\nGunthorpe</b></font></p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><font color=\"#000000\"><b>APT\nteam</b></font></p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><font color=\"#000000\"><b>Daniel\nBurrows</b> &lt;dburrows@debian.org&gt;</font></p>\n\n<p style=\"margin-left:17%;\"><font color=\"#000000\">Initial\ndocumentation of Debug::*.</font></p>\n\n<h2>NOTES\n<a name=\"NOTES\"></a>\n</h2>\n\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"12%\"></td>\n<td width=\"3%\">\n\n\n\n<p style=\"margin-top: 1em\"><font color=\"#000000\">1.</font></p> </td>\n<td width=\"2%\"></td>\n<td width=\"18%\">\n\n\n<p style=\"margin-top: 1em\"><font color=\"#000000\">APT bug\npage</font></p> </td>\n<td width=\"65%\">\n</td></tr>\n</table>\n\n\n<p style=\"margin-left:17%;\"><font color=\"#000000\">http://bugs.debian.org/src:apt</font></p>\n<hr>\n","headings":["<a href=\"#NAME\">NAME</a>","<a href=\"#DESCRIPTION\">DESCRIPTION</a>","<a href=\"#SYNTAX\">SYNTAX</a>","<a href=\"#THE APT GROUP\">THE APT GROUP</a>","<a href=\"#THE ACQUIRE GROUP\">THE ACQUIRE GROUP</a>","<a href=\"#BINARY SPECIFIC CONFIGURATION\">BINARY SPECIFIC CONFIGURATION</a>","<a href=\"#DIRECTORIES\">DIRECTORIES</a>","<a href=\"#APT IN DSELECT\">APT IN DSELECT</a>","<a href=\"#HOW APT CALLS DPKG(1)\">HOW APT CALLS DPKG(1)</a>","<a href=\"#PERIODIC AND ARCHIVES OPTIONS\">PERIODIC AND ARCHIVES OPTIONS</a>","<a href=\"#DEBUG OPTIONS\">DEBUG OPTIONS</a>","<a href=\"#EXAMPLES\">EXAMPLES</a>","<a href=\"#FILES\">FILES</a>","<a href=\"#SEE ALSO\">SEE ALSO</a>","<a href=\"#BUGS\">BUGS</a>","<a href=\"#AUTHORS\">AUTHORS</a>","<a href=\"#NOTES\">NOTES</a>"],"level":5}