{"name":"cups-browsed.conf","description":"<b>cups-browsed.conf</b>\n- server configuration file for cups-browsed\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\nThe\ncups-browsed.conf file configures the cups-browsed daemon.\nIt is normally located in the /etc/cups directory. Each line\nin the file can be a configuration directive, a blank line,\nor a comment. Comment lines start with the # character.\n\n<h2>DIRECTIVES\n<a name=\"DIRECTIVES\"></a>\n</h2>\n\n\nThe\n&quot;CacheDir&quot; directive determines where cups-browsed\nshould save information about the print queues it had\ngenerated when shutting down, like whether one of these\nqueues was the default printer, or default option settings\nof the queues.\n\nCacheDir\n/var/cache/cups\n\nWith\n&quot;LogDir&quot; can be defined where cups-browsed creates\nits debug log file (if &quot;DebugLogging file&quot; is\nset).\n\nLogDir\n/var/log/cups\n\nThe\n&quot;DebugLogging&quot; directive determines how should\ndebug logging be done. Into the file\n/var/log/cups/cups-browsed_log (&quot;file&quot;), to stderr\n(&quot;stderr&quot;), or not at all (&quot;none&quot;).\n\nNote that if\ncups-browsed is running as a system service (for example via\nsystemd) logging to stderr makes the log output going to the\njournal or syslog. Only if you run cups-browsed from the\ncommand line (for development or debugging) it will actually\nappear on stderr.\n\nDebugLogging\nfile <br>\nDebugLogging stderr <br>\nDebugLogging file stderr <br>\nDebugLogging none\n\nOnly browse\nremote printers (via DNS-SD or CUPS browsing) from selected\nservers using the &quot;BrowseAllow&quot;,\n&quot;BrowseDeny&quot;, and &quot;BrowseOrder&quot;\ndirectives\n\nThis serves for\nrestricting the choice of printers in print dialogs to\ntrusted servers or to reduce the number of listed printers\nin the print dialogs to a more user-friendly amount in large\nnetworks with very many shared printers.\n\nThis only\nfilters the selection of remote printers for which\ncups-browsed creates local queues. If the print dialog uses\nother mechanisms to list remote printers as for example\ndirect DNS-SD access, cups-browsed has no influence.\ncups-browsed also does not prevent the user from manually\naccessing non-listed printers.\n\n\n&quot;BrowseAllow&quot;:\nAccept printers from these hosts or networks. If there are\nonly &quot;BrowseAllow&quot; lines and no\n&quot;BrowseOrder&quot; and/or &quot;BrowseDeny&quot; lines,\nonly servers matching at last one &quot;BrowseAllow&quot;\nline are accepted.\n\n\n&quot;BrowseDeny&quot;:\nDeny printers from these hosts or networks. If there are\nonly &quot;BrowseDeny&quot; lines and no\n&quot;BrowseOrder&quot; and/or &quot;BrowseAllow&quot;\nlines, all servers NOT matching any of the\n&quot;BrowseDeny&quot; lines are accepted.\n\n\n&quot;BrowseOrder&quot;:\nDetermine the order in which &quot;BrowseAllow&quot; and\n&quot;BrowseDeny&quot; lines are applied. With\n&quot;BrowseOrder Deny,Allow&quot; in the beginning all\nservers are accepted, then the &quot;BrowseDeny&quot; lines\nare applied to exclude unwished servers or networks and\nafter that the &quot;BrowseAllow&quot; lines to re-include\nservers or networks. With &quot;BrowseOrder Allow,Deny&quot;\nwe start with denying all servers, then applying the\n&quot;BrowseAllow&quot; lines and afterwards the\n&quot;BrowseDeny&quot; lines.\n\nDefault for\n&quot;BrowseOrder&quot; is &quot;Deny.Allow&quot; if there\nare both &quot;BrowseAllow&quot; and &quot;BrowseDeny&quot;\nlines.\n\nIf there are no\n&quot;Browse...&quot; lines at all, all servers are\naccepted.\n\nBrowseAllow All\n<br>\nBrowseAllow 192.168.7.20 <br>\nBrowseAllow 192.168.7.0/24 <br>\nBrowseAllow 192.168.7.0/255.255.255.0\n\nBrowseDeny All\n<br>\nBrowseDeny 192.168.1.13 <br>\nBrowseDeny 192.168.3.0/24 <br>\nBrowseDeny 192.168.3.0/255.255.255.0\n\nBrowseOrder\nDeny,Allow <br>\nBrowseOrder Allow,Deny\n\nFiltering of\nremote printers by other properties than IP addresses of\ntheir servers\n\nOften the\ndesired selection of printers cannot be reached by only\ntaking into account the IP addresses of the servers. For\nthese cases there is the BrowseFilter directive to filter by\nmost of the known properties of the printer.\n\nBy default\nthere is no BrowseFilter line meaning that no filtering is\napplied.\n\nTo do filtering\none can supply one or more BrowseFilter directives like\nthis:\n\nBrowseFilter\n[NOT] [EXACT] &lt;FIELD&gt; [&lt;VALUE&gt;]\n\nThe\nBrowseFilter directive always starts with the word\n&quot;BrowseFilter&quot; and it must at least contain the\nname of the data field (&lt;FIELD&gt;) of the\nprinter&rsquo;s properties to which it should apply.\n\nAvailable field\nnames are:\n\nname: Name of\nthe local print queue to be created <br>\nhost: Host name of the remote print server <br>\nport: Port through which the printer is accessed on the\nserver <br>\nservice: DNS/SD service name of the remote printer <br>\ndomain: Domain of the remote print server\n\nAlso all field\nnames in the TXT records of DNS-SD-advertised printers are\nvalid, like &quot;color&quot;, &quot;duplex&quot;,\n&quot;pdl&quot;, ... If the field name of the filter rule\ndoes not exist for the printer, the rule is skipped.\n\nThe optional\n&lt;VALUE&gt; field is either the exact value (when the\noption EXACT is supplied) or a regular expression (Run\n&quot;man 7 regex&quot; in a terminal window) to be matched\nwith the data field.\n\nIf no\n&lt;VALUE&gt; filed is supplied, rules with field names of\nthe TXT record are considered for boolean matching\n(true/false) of boolean field (like duplex, which can have\nthe values &quot;T&quot; for true and &quot;F&quot; for\nfalse).\n\nIf the option\nNOT is supplied, the filter rule is fulfilled if the regular\nexpression or the exact value DOES NOT match the content of\nthe data field. In a boolean rule (without &lt;VALUE&gt;)\nthe rule matches false.\n\nRegular\nexpressions are always considered case-insensitive and\nextended POSIX regular expressions. Field names and options\n(NOT, EXACT) are all evaluated case-insensitive. If there is\nan error in a regular expression, the BrowseFilter line gets\nignored.\n\nEspecially to\nnote is that supplying any simple string consisting of only\nletters, numbers, spaces, and some basic special characters\nas a regular expression matches if it is contained somewhere\nin the data field.\n\nIf there is\nmore than one BrowseFilter directive, ALL the directives\nneed to be fulfilled for the remote printer to be accepted.\nIf one is not fulfilled, the printer will get ignored.\n\nExamples:\n\nRules for\nstandard data items which are supplied with any remote\nprinter advertised via DNS-SD:\n\nPrint queue\nname must contain &quot;hum_res_&quot;, this matches\n&quot;hum_res_mono&quot; or &quot;hum_res_color&quot; but\nalso &quot;old_hum_res_mono&quot;:\n\nBrowseFilter\nname hum_res_\n\nThis matches if\nthe remote host name contains &quot;printserver&quot;, like\n&quot;printserver.local&quot;,\n&quot;printserver2.example.com&quot;,\n&quot;newprintserver&quot;:\n\nBrowseFilter\nhost printserver\n\nThis matches\nall ports with 631 int its number, for example 631, 8631,\n10631,...:\n\nBrowseFilter\nport 631\n\nThis rule\nmatches if the DNS-SD service name contains &quot;@\nprintserver&quot;:\n\nBrowsefilter\nservice @ printserver\n\nMatches all\ndomains with &quot;local&quot; in their names, not only\n&quot;local&quot; but also things like\n&quot;printlocally.com&quot;:\n\nBrowseFilter\ndomain local\n\nExamples for\nrules applying to items of the TXT record:\n\nThis rule\nselects PostScript printers, as the &quot;PDL&quot; field in\nthe TXT record contains &quot;postscript&quot; then. This\nincludes also remote CUPS queues which accept PostScript,\nindependent of whether the physical printer behind the CUPS\nqueue accepts PostScript or not.\n\nBrowseFilter\npdl postscript\n\nColor printers\nusually contain a &quot;Color&quot; entry set to\n&quot;T&quot; (for true) in the TXT record. This rule\nselects them:\n\nBrowseFilter\ncolor\n\nThis is a\nsimilar rule to select only duplex (automatic double-sided\nprinting) printers:\n\nBrowseFilter\nduplex\n\nRules with the\nNOT option:\n\nThis rule\nEXCLUDES printers from all hosts containing\n&quot;financial&quot; in their names, nice to get rid of the\n100s of printers of the financial department:\n\nBrowseFilter\nNOT host financial\n\nGet only\nmonochrome printers (&quot;Color&quot; set to &quot;F&quot;,\nmeaning false, in the TXT record):\n\nBrowseFilter\nNOT color\n\nRules with more\nadvanced use of regular expressions:\n\nOnly queue\nnames which BEGIN WITH &quot;hum_res_&quot; are accepted\nnow, so we still get &quot;hum_res_mono&quot; or\n&quot;hum_res_color&quot; but not\n&quot;old_hum_res_mono&quot; any more:\n\nBrowseFilter\nname ^hum_res_\n\nServer names is\naccepted if it contains &quot;print_server&quot; OR\n&quot;graphics_dep_server&quot;:\n\nBrowseFilter\nhost print_server|graphics_dep_server\n\n\n&quot;printserver1&quot;,\n&quot;printserver2&quot;, and &quot;printserver3&quot;,\nnothing else:\n\nBrowseFilter\nhost ^printserver[1-3]$\n\nPrinters\nunderstanding at least one of PostScript, PCL, or PDF:\n\nBrowseFilter\npdl postscript|pcl|pdf\n\nExamples for\nthe EXACT option:\n\nOnly printers\nfrom &quot;printserver.local&quot; are accepted:\n\nBrowseFilter\nEXACT host printserver.local\n\nPrinters from\nall servers except &quot;prinserver2.local&quot; are\naccepted:\n\nBrowseFilter\nNOT EXACT host prinserver2.local\n\nThe BrowsePoll\ndirective polls a server for available printers once every\n60 seconds. Multiple BrowsePoll directives can be specified\nto poll multiple servers. The default port to connect to is\n631. BrowsePoll works independently of whether CUPS browsing\nis activated in BrowseRemoteProtocols.\n\nBrowsePoll\n192.168.7.20 <br>\nBrowsePoll 192.168.7.65:631 <br>\nBrowsePoll host.example.com:631\n\nThe\nBrowseLocalProtocols directive specifies the protocols to\nuse when advertising local shared printers on the network.\nThe default is &quot;none&quot;. Control of advertising of\nlocal shared printers using dnssd is done in\n/etc/cups/cupsd.conf.\n\n\nBrowseLocalProtocols\nnone <br>\nBrowseLocalProtocols CUPS\n\nThe\nBrowseRemoteProtocols directive specifies the protocols to\nuse when finding remote shared printers on the network.\nMultiple protocols can be specified by separating them with\nspaces. The default is &quot;dnssd cups&quot;.\n\n\nBrowseRemoteProtocols\nnone <br>\nBrowseRemoteProtocols CUPS dnssd <br>\nBrowseRemoteProtocols CUPS <br>\nBrowseRemoteProtocols dnssd <br>\nBrowseRemoteProtocols ldap\n\nThe\nBrowseProtocols directive specifies the protocols to use\nwhen finding remote shared printers on the network and\nadvertising local shared printers. &quot;dnssd&quot; and\n&quot;ldap&quot; are ignored for BrowseLocalProtocols.\nMultiple protocols can be specified by separating them with\nspaces. The default is &quot;none&quot; for\nBrowseLocalProtocols and &quot;dnssd cups&quot; for\nBrowseRemoteProtocols.\n\n\nBrowseProtocols\nnone <br>\nBrowseProtocols CUPS dnssd <br>\nBrowseProtocols CUPS <br>\nBrowseProtocols dnssd <br>\nBrowseProtocols ldap\n\nThe\nconfiguration for the LDAP browsing mode define where the\nLDAP search should be performed. If built with an LDAP\nlibrary that supports TLS, the path to the server&rsquo;s\ncertificate, or to a certificates store, can be specified.\nThe optional filter allows the LDAP search to be more\nspecific, and is used in addition to the hardcoded filter\n(objectclass=cupsPrinter).\n\n\nBrowseLDAPBindDN\ncn=cups-browsed,dc=domain,dc=tld <br>\nBrowseLDAPCACertFile /path/to/server/certificate.pem <br>\nBrowseLDAPDN ou=printers,dc=domain,dc=tld <br>\nBrowseLDAPFilter (printerLocation=/Office 1/*) <br>\nBrowseLDAPPassword s3cret <br>\nBrowseLDAPServer ldaps://ldap.domain.tld\n\nThe\nDomainSocket directive specifies the domain socket through\nwhich the locally running CUPS daemon is accessed. If not\nspecified the standard domain socket of CUPS is used. Use\nthis if you have specified an alternative domain socket for\nCUPS via a Listen directive in /etc/cups/cupsd.conf. If\ncups-browsed is not able to access the local CUPS daemon via\na domain socket it accesses it via localhost.\n&quot;None&quot; or &quot;Off&quot; lets cups-browsed not\nuse CUPS&rsquo; domain socket.\n\nDomainSocket\n/var/run/cups/cups.sock <br>\nDomainSocket None <br>\nDomainSocket Off\n\nSet HTTP\ntimeout (in seconds) for requests sent to local/remote\nresources Note that too short timeouts can make services\ngetting missed when they are present and operations be\nunnecessarily repeated and too long timeouts can make\noperations take too long when the server does not\nrespond.\n\n\nHttpLocalTimeout\n5 <br>\nHttpRemoteTimeout 10\n\nSet how many\nretries (N) should cups-browsed do for creating print queues\nfor remote printers which receive timeouts during print\nqueue creation. The printers which are not successfully set\nup even after N retries, are skipped until the next restart\nof the service. Note that too many retries can cause high\nCPU load.\n\nHttpMaxRetries\n5\n\nThe interval\nbetween browsing/broadcasting cycles, local and/or remote,\ncan be adjusted with the BrowseInterval directive.\n\nBrowseInterval\n60\n\nThe\nBrowseTimeout directive determines the amount of time that\nbrowsing-related operations are allowed to take in seconds.\nNotably, adding or removing one printer queue is considered\nas one operation. The timeout applies to each one of those\noperations. Especially queues discovered by CUPS broadcasts\nwill be removed after this timeout if no further broadcast\nfrom the server happens.\n\nBrowseTimeout\n300\n\nThe\nAllowResharingRemoteCUPSPrinters directive determines\nwhether a print queue pointing to a remote CUPS queue will\nbe re-shared to the local network or not. Since the queues\ngenerated using the BrowsePoll directive are also pointing\nto remote queues, they are also shared automatically if the\nfollowing option is set. Default is not to share remote\nqueues.\n\n\nAllowResharingRemoteCUPSPrinters\nYes\n\nThe\nNewBrowsePollQueuesShared directive determines whether a\nprint queue for a newly discovered printer (discovered by\nthe BrowsePoll directive) will be shared to the local\nnetwork or not. This directive will only work if\nAllowResharingRemoteCUPSPrinters is set to yes. Default is\nnot to share printers discovered using BrowsePoll.\n\n\nNewBrowsePollQueuesShared\nYes\n\nSet\nOnlyUnsupportedByCUPS to &quot;Yes&quot; will make\ncups-browsed not create local queues for remote printers for\nwhich CUPS creates queues by itself. These printers are\nprinters advertised via DNS-SD and doing CUPS-supported\n(currently PWG Raster and Apple Raster) driverless printing,\nincluding remote CUPS queues. Queues for other printers\n(like for legacy PostScript/PCL printers) are always created\n(depending on the other configuration settings of\ncups-browsed).\n\nWith\nOnlyUnsupportedByCUPS set to &quot;No&quot;, cups-browsed\ncreates queues for all printers which it supports, including\nprinters for which CUPS would create queues by itself.\nTemporary queues created by CUPS will get overwritten. This\nway it is assured that any extra functionality of\ncups-browsed will apply to these queues. As queues created\nby cups-browsed are permanent CUPS queues this setting is\nalso recommended if applications/print dialogs which do not\nsupport temporary CUPS queues are installed. This setting is\nthe default.\n\n\nOnlyUnsupportedByCUPS\nYes\n\nWith\nUseCUPSGeneratedPPDs set to &quot;Yes&quot; cups-browsed\ncreates queues for IPP printers with PPDs generated by the\nPPD generator of CUPS and not with the one of cups-browsed.\nSo any new development in CUPS&rsquo; PPD generator gets\navailable. As CUPS&rsquo; PPD generator is not directly\naccessible, we need to make CUPS generate a temporary print\nqueue with the desired PPD. Therefore we can only use these\nPPDs when our queue replaces a temporary CUPS queue, meaning\nthat the queue is for a printer on which CUPS supports\ndriverless printing (IPP 2.x, PDLs: PDF, PWG Raster, and/or\nApple Raster) and that its name is the same as CUPS uses for\nthe temporary queue (&quot;LocalQueueNamingIPPPrinter\nDNS-SD&quot; must be set). The directive applies only to IPP\nprinters, not to remote CUPS queues, to not break\nclustering. Setting this directive to &quot;No&quot; lets\ncups-browsed generate the PPD file. Default setting is\n&quot;No&quot;.\n\n\nUseCUPSGeneratedPPDs\nNo\n\nWith the\ndirectives LocalQueueNamingRemoteCUPS and\nLocalQueueNamingIPPPrinter you can determine how the names\nfor local queues generated by cups-browsed are generated,\nseparately for remote CUPS printers and IPP printers.\n\n\n&quot;DNS-SD&quot;\n(the default in both cases) bases the naming on the service\nname of the printer&rsquo;s advertised DNS-SD record. This\nis exactly the same naming scheme as CUPS uses for its\ntemporary queues, so the local queue from cups-browsed\nprevents CUPS from listing and creating an additional queue.\nAs DNS-SD service names have to be unique, queue names of\nprinters from different servers will also be unique and so\nthere is no automatic clustering for load-balanced\nprinting.\n\n\n&quot;MakeModel&quot;\nbases the queue name on the printer&rsquo;s manufacturer and\nmodel names. This scheme cups-browsed used formerly for IPP\nprinters.\n\n\n&quot;RemoteName&quot;\nis only available for remote CUPS queues and uses the name\nof the queue on the remote CUPS server as the local\nqueue&rsquo;s name. This makes printers on different CUPS\nservers with equal queue names automatically forming a\nload-balancing cluster as CUPS did formerly (CUPS 1.5.x and\nolder) with CUPS-broadcasted remote printers. This scheme\ncups-browsed used formerly for remote CUPS printers.\n\n\nLocalQueueNamingRemoteCUPS\nDNS-SD <br>\nLocalQueueNamingRemoteCUPS MakeModel <br>\nLocalQueueNamingRemoteCUPS RemoteName <br>\nLocalQueueNamingIPPPrinter DNS-SD <br>\nLocalQueueNamingIPPPrinter MakeModel\n\nSet\nDNSSDBasedDeviceURIs to &quot;Yes&quot; if cups-browsed\nshould use DNS-SD-service-name-based device URIs for its\nlocal queues, as CUPS also does. These queues use the DNS-SD\nservice name of the discovered printer. With this the URI is\nindependent of network interfaces and ports, giving reliable\nconnections to always the same physical device. This setting\nis the default.\n\nSet\nDNSSDBasedDeviceURIs to &quot;No&quot; if cups-browsed\nshould use the conventional host-name/IP-based URIs.\n\nNote that this\noption has only influence on URIs for printers discovered\nvia DNS-SD, not via legacy CUPS broewsing or LDAP. Those\nprinters get always assigned the conventional URIs.\n\n\nDNSSDBasedDeviceURIs\nYes\n\nSet\nIPBasedDeviceURIs to &quot;Yes&quot; if cups-browsed should\ncreate its local queues with device URIs with the IP\naddresses instead of the host names of the remote servers.\nThis mode is there for any problems with host name\nresolution in the network, especially also if avahi-daemon\nis only run for printer discovery and already stopped while\nstill printing. By default this mode is turned off, meaning\nthat we use URIs with host names.\n\nNote that the\nIP addresses depend on the network interface through which\nthe printer is accessed. So do not use IP-based URIs on\nsystems with many network interfaces and where interfaces\ncan appear and disappear frequently.\n\nThis mode could\nalso be useful for development and debugging.\n\nIf you prefer\nIPv4 or IPv6 IP addresses in the URIs, you can set\nIPBasedDeviceURIs to &quot;IPv4&quot; to only get IPv4 IP\naddresses or IPBasedDeviceURIs to &quot;IPv6&quot; to only\nget IPv6 IP addresses.\n\n\nIPBasedDeviceURIs\nNo <br>\nIPBasedDeviceURIs Yes <br>\nIPBasedDeviceURIs IPv4 <br>\nIPBasedDeviceURIs IPv6\n\nSet\nCreateRemoteRawPrinterQueues to &quot;Yes&quot; to let\ncups-browsed also create local queues pointing to remote raw\nCUPS queues. Normally, only queues pointing to remote queues\nwith PPD/driver are created as we do not use drivers on the\nclient side, but in some cases accessing a remote raw queue\ncan make sense, for example if the queue forwards the jobs\nby a special backend like Tea4CUPS.\n\n\nCreateRemoteRawPrinterQueues\nYes\n\ncups-browsed by\ndefault creates local print queues for each shared CUPS\nprint queue which it discovers on remote machines in the\nlocal network(s). Set CreateRemoteCUPSPrinterQueues to\n&quot;No&quot; if you do not want cups-browsed to do this.\nFor example you can set cups-browsed to only create queues\nfor IPP network printers setting CreateIPPPrinterQueues not\nto &quot;No&quot; and CreateRemoteCUPSPrinterQueues to\n&quot;No&quot;.\n\n\nCreateRemoteCUPSPrinterQueues\nNo\n\nSet\nCreateIPPPrinterQueues to &quot;All&quot; to let\ncups-browsed discover IPP network printers (native printers,\nnot CUPS queues) with known page description languages (PWG\nRaster, PDF, PostScript, PCL XL, PCL 5c/e) in the local\nnetwork and auto-create print queues for them.\n\nSet\nCreateIPPPrinterQueues to &quot;Everywhere&quot; to let\ncups-browsed discover IPP Everywhere printers in the local\nnetwork (native printers, not CUPS queues) and auto-create\nprint queues for them.\n\nSet\nCreateIPPPrinterQueues to &quot;AppleRaster&quot; to let\ncups-browsed discover Apple Raster printers in the local\nnetwork (native printers, not CUPS queues) and auto-create\nprint queues for them.\n\nSet\nCreateIPPPrinterQueues to &quot;Driverless&quot; to let\ncups-browsed discover printers designed for driverless use\n(currently IPP Everywhere and Apple Raster) in the local\nnetwork (native printers, not CUPS queues) and auto-create\nprint queues for them.\n\nSet\nCreateIPPPrinterQueues to &quot;LocalOnly&quot; to\nauto-create print queues only for local printers made\navailable as IPP printers. These are for example\nIPP-over-USB printers, made available via ippusbxd(8). This\nis the default.\n\nSet\nCreateIPPPrinterQueues to &quot;No&quot; to not auto-create\nprint queues for IPP network printers.\n\nIf queues with\nPPD file are created (see IPPPrinterQueueType directive\nbelow) the PPDs are auto-generated by cups-browsed based on\nproperties of the printer polled via IPP. In case of missing\ninformation, info from the Bonjour record is used asd as\nlast mean default values.\n\nIf queues\nwithout PPD (see IPPPrinterQueueType directive below) are\ncreated clients have to IPP-poll the capabilities of the\nprinter and send option settings as standard IPP attributes.\nThen we do not poll the capabilities by ourselves to not\nwake up the printer from power-saving mode when creating the\nqueues. Jobs have to be sent in one of PDF, PWG Raster, or\nJPEG format. Other formats are not accepted.\n\nThis\nfunctionality is primarily for mobile devices running CUPS\nto not need a printer setup tool nor a collection of printer\ndrivers and PPDs.\n\n\nCreateIPPPrinterQueues\nNo <br>\nCreateIPPPrinterQueues LocalOnly <br>\nCreateIPPPrinterQueues Everywhere <br>\nCreateIPPPrinterQueues AppleRaster <br>\nCreateIPPPrinterQueues Everywhere AppleRaster <br>\nCreateIPPPrinterQueues Driverless <br>\nCreateIPPPrinterQueues All\n\nIf cups-browsed\nis automatically creating print queues for native IPP\nnetwork printers (&quot;CreateIPPPrinterQueues Yes&quot;),\nthe type of queue to be created can be selected by the\n&quot;IPPPrinterQueueType&quot; directive. The\n&quot;PPD&quot; (default) setting makes queues with PPD file\nbeing created. With &quot;Interface&quot; or\n&quot;NoPPD&quot; the queue is created with a System V\ninterface script (Not supported with CUPS 2.2.x or later).\n&quot;Auto&quot; is for backward compatibility and also lets\nqueues with PPD get created.\n\n\nIPPPrinterQueueType\nPPD <br>\nIPPPrinterQueueType NoPPD <br>\nIPPPrinterQueueType Interface <br>\nIPPPrinterQueueType Auto\n\nThe\nNewIPPPrinterQueuesShared directive determines whether a\nprint queue for a newly discovered IPP network printer (not\nremote CUPS queue) will be shared to the local network or\nnot. This is only valid for newly discovered printers. For\nprinters discovered in an earlier cups-browsed session,\ncups-browsed will remember whether the printer was shared,\nso changes by the user get conserved. Default is not to\nshare newly discovered IPP printers.\n\n\nNewIPPPrinterQueuesShared\nYes\n\nHow to handle\nthe print queues cups-browsed creates when cups-browsed is\nshut down:\n\n\n&quot;KeepGeneratedQueuesOnShutdown\nNo&quot; makes the queues being removed. This makes sense as\nthese queues only work while cups-browsed is running.\ncups-browsed has to determine to which member printer of a\ncluster to pass on the job.\n\n\n&quot;KeepGeneratedQueuesOnShutdown\nYes&quot; (the default) makes the queues not being removed.\nThis is the recommended setting for a system where\ncups-browsed is permanently running and only stopped for\nshort times (like log rotation) or on shutdown. This avoids\nthe re-creation of the queues when cups-browsed is\nrestarted, which often causes a clutter of CUPS\nnotifications on the desktop.\n\n\nKeepGeneratedQueuesOnShutdown\nNo\n\nIf there is\nmore than one remote CUPS printer whose local queue would\nget the same name and AutoClustering is set to\n&quot;Yes&quot; (the default) only one local queue is\ncreated which makes up a load-balancing cluster of the\nremote printers which would get this queue name (implicit\nclass). This means that when several jobs are sent to this\nqueue they get distributed between the printers, using the\nmethod chosen by the LoadBalancing directive.\n\nNote that the\nforming of clusters depends on the naming scheme for local\nqueues created by cups-browsed. If you have set\nLocalQueueNamingRemoteCUPS to &quot;DNSSD&quot; you will not\nget automatic clustering as the DNS-SD service names are\nalways unique. With LocalQueueNamingRemoteCUPS set to\n&quot;RemoteName&quot; local queues are named as the CUPS\nqueues on the remote servers are named and so equally named\nqueues on different servers get clustered (this is how CUPS\ndid it in version 1.5.x or older).\nLocalQueueNamingRemoteCUPS set to &quot;MakeModel&quot;\nmakes remote printers of the same model get clustered. Note\nthat then a cluster can contain more than one queue of the\nsame server.\n\nWith\nAutoClustering set to &quot;No&quot;, for each remote CUPS\nprinter an individual local queue is created, and to avoid\nname clashes when using the LocalQueueNamingRemoteCUPS\nsettings &quot;RemoteName&quot; or &quot;MakeModel&quot;\n&quot;@&lt;server name&gt;&quot; is added to the local queue\nname.\n\nOnly remote\nCUPS printers get clustered, not IPP network printers or\nIPP-over-USB printers.\n\nAutoClustering\nYes <br>\nAutoClustering No\n\nLoad-balancing\nprinter cluster formation can also be manually controlled by\ndefining explicitly which remote CUPS printers should get\nclustered together.\n\nThis is done by\nthe &quot;Cluster&quot; directive:\n\nCluster\n&lt;QUEUENAME&gt;: &lt;EXPRESSION1&gt; &lt;EXPRESSION2&gt;\n... <br>\nCluster &lt;QUEUENAME&gt;\n\nIf no\nexpressions are given, &lt;QUEUENAME&gt; is used as the\nfirst and only expression for this cluster.\n\nDiscovered\nprinters are matched against all the expressions of all\ndefined clusters. The first expression which matches the\ndiscovered printer determines to which cluster it belongs.\nNote that this way a printer can only belong to one cluster.\nOnce matched, further cluster definitions will not checked\nany more.\n\nWith the first\nprinter matching a cluster&rsquo;s expression a local queue\nwith the name &lt;QUEUENAME&gt; is created. If more printers\nare discovered and match this cluster, they join the\ncluster. Printing to this queue prints to all these printers\nin a load-balancing manner, according to to the setting of\nthe LoadBalancing directive.\n\nEach expression\nmust be a string of characters without spaces. If spaces are\nneeded, replace them by underscores (&rsquo;_&rsquo;).\n\nAn expression\ncan be matched in three ways:\n\n1. By the name\nof the CUPS queue on the remote server <br>\n2. By make and model name of the remote printer <br>\n3. By the DNS-SD service name of the remote printer\n\nNote that the\nmatching is done case-insensitively and any group of\nnon-alphanumerical characters is replaced by a single\nunderscore.\n\nSo if an\nexpression is &quot;HP_DeskJet_2540&quot; and the remote\nserver reports &quot;hp Deskjet-2540&quot; the printer gets\nmatched to this cluster.\n\nIf\n&quot;AutoClustering&quot; is not set to &quot;No&quot; both\nyour manual cluster definitions will be followed and\nautomatic clustering of equally-named remote queues will be\nperformed. If a printer matches in both categories the match\nto the manually defined cluster has priority. Automatic\nclustering of equally-named remote printers is not performed\nif there is a manually defined cluster with this name (at\nleast as the printers do not match this cluster).\n\nExamples:\n\nTo cluster all\nremote CUPS queues named &quot;laserprinter&quot; in your\nlocal network but not cluster any other equally-named remote\nCUPS printers use (Local queue will get named\n&quot;laserprinter&quot;):\n\nAutoClustering\nNo <br>\nCluster laserprinter\n\nTo cluster all\nremote CUPS queues of HP LaserJet 4050 printers in a local\nqueue named &quot;LJ4050&quot;:\n\nCluster LJ4050:\nHP_LaserJet_4050\n\nAs DNS-SD\nservice names are unique in a network you can create a\ncluster from exactly specified printers (spaces replaced by\nunderscores):\n\nCluster hrdep:\noldlaser_@_hr-server1 newlaser_@_hr-server2\n\nThe\nLoadBalancing directive switches between two methods of\nhandling load balancing between equally-named remote queues\nwhich are represented by one local print queue making up a\ncluster of them (implicit class).\n\nThe two methods\nare:\n\nQueuing of jobs\non the client (LoadBalancing QueueOnClient):\n\nHere we queue\nup the jobs on the client and regularly check the clustered\nremote print queues. If we find an idle queue, we pass on a\njob to it.\n\nThis is also\nthe method which CUPS uses for classes. Advantage is a more\neven distribution of the job workload on the servers\n(especially if the printing speed of the servers is very\ndifferent), and if a server fails, there are not several\njobs stuck or lost. Disadvantage is that if one takes the\nclient (laptop, mobile phone, ...) out of the local network,\nprinting stops with the jobs waiting in the local queue.\n\nQueuing of jobs\non the servers (LoadBalancing QueueOnServers):\n\nHere we check\nthe number of jobs on each of the clustered remote printers\nand send an incoming job immediately to the remote printer\nwith the lowest amount of jobs in its queue. This way no\njobs queue up locally, all jobs which are waiting are\nwaiting on one of the remote servers.\n\nNot having jobs\nwaiting locally has the advantage that we can take the local\nmachine from the network and all jobs get printed.\nDisadvantage is that if a server with a full queue of jobs\ngoes away, the jobs go away, too.\n\nDefault is\nqueuing the jobs on the client as this is what CUPS does\nwith classes.\n\nLoadBalancing\nQueueOnClient <br>\nLoadBalancing QueueOnServers\n\nWith the\nDefaultOptions directive one or more option settings can be\ndefined to be applied to every print queue newly created by\ncups-browsed. Each option is supplied as one supplies\noptions with the &quot;-o&quot; command line argument to the\n&quot;lpadmin&quot; command (Run &quot;man lpadmin&quot; for\nmore details). More than one option can be supplied\nseparating the options by spaces. By default no option\nsettings are pre-defined.\n\nNote that print\nqueues which cups-browsed already created before remember\ntheir previous settings and so these settings do not get\napplied.\n\nDefaultOptions\nOption1=Value1 Option2=Value2 Option3 noOption4\n\nThe\nAutoShutdown directive specifies whether cups-browsed should\nautomatically terminate when it has no local raw queues set\nup pointing to any discovered remote printers or no jobs on\nsuch queues depending on AutoShutdownOn setting (auto\nshutdown mode). Setting it to &quot;On&quot; activates the\nauto-shutdown mode, setting it to &quot;Off&quot;\ndeactivates it (the default). The special mode\n&quot;avahi&quot; turns auto shutdown off while avahi-daemon\nis running and on when avahi-daemon stops. This allows\nrunning cups-browsed on-demand when avahi-daemon is run\non-demand.\n\nAutoShutdown\nOff <br>\nAutoShutdown On <br>\nAutoShutdown avahi\n\nThe\nAutoShutdownOn directive determines what event cups-browsed\nconsiders as inactivity in auto shutdown mode.\n&quot;NoQueues&quot; (the default) means that auto shutdown\nis initiated when there are no queues for discovered remote\nprinters generated by cups-browsed any more.\n&quot;NoJobs&quot; means that all queues generated by\ncups-browsed are without jobs.\n\nAutoShutdownOn\nNoQueues <br>\nAutoShutdownOn NoJobs\n\n\nDebugLogFileSize\ndefines the maximum size possible (in KBytes) of the log\nfiles (cups-browsed_log and cups-browsed_previous_logs) that\nis created using cups-browsed in the debugging mode. Setting\nits value to 0 would turn off any restriction on the size of\nthe file.\n\n\nDebugLogFileSize\n300\n\nThe\nAutoShutdownTimeout directive specifies after how many\nseconds without local raw queues set up pointing to any\ndiscovered remote printers or jobs on these queues\ncups-browsed should actually shut down in auto shutdown\nmode. Default is 30 seconds, 0 means immediate shutdown.\n\n\nAutoShutdownTimeout\n20\n\n\nNotifLeaseDuration\ndefines how long the D-BUS subscription created by\ncups-browsed in cupsd will last before cupsd cancels it. The\ndefault value is 1 day in seconds - 86400. The subscription\nrenewal is set to happen after half of NotifLeaseDuration\npassed. The D-BUS notifications are used for watching over\nqueues and doing specific actions when a D-BUS notification\ncomes.\n\n\nNotifLeaseDuration\n86400\n\n<h2>SEE ALSO\n<a name=\"SEE ALSO\"></a>\n</h2>\n\n\n\n<b>cups-browsed</b>(8)\n\n\n/usr/share/doc/cups-browsed/README.gz\n\n<h2>AUTHOR\n<a name=\"AUTHOR\"></a>\n</h2>\n\n\nThe authors of\ncups-browsed are listed in\n/usr/share/doc/cups-browsed/AUTHORS.\n\nThis manual\npage was written for the Debian Project, but it may be used\nby others.","body":"\n\n<h1 align=\"center\">cups-browsed.conf</h1>\n\n\n\n\n\n\n\n<hr>\n\n\n<h2>NAME\n<a name=\"NAME\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>cups-browsed.conf</b>\n- server configuration file for cups-browsed</p>\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\ncups-browsed.conf file configures the cups-browsed daemon.\nIt is normally located in the /etc/cups directory. Each line\nin the file can be a configuration directive, a blank line,\nor a comment. Comment lines start with the # character.</p>\n\n<h2>DIRECTIVES\n<a name=\"DIRECTIVES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n&quot;CacheDir&quot; directive determines where cups-browsed\nshould save information about the print queues it had\ngenerated when shutting down, like whether one of these\nqueues was the default printer, or default option settings\nof the queues.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">CacheDir\n/var/cache/cups</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">With\n&quot;LogDir&quot; can be defined where cups-browsed creates\nits debug log file (if &quot;DebugLogging file&quot; is\nset).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">LogDir\n/var/log/cups</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n&quot;DebugLogging&quot; directive determines how should\ndebug logging be done. Into the file\n/var/log/cups/cups-browsed_log (&quot;file&quot;), to stderr\n(&quot;stderr&quot;), or not at all (&quot;none&quot;).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Note that if\ncups-browsed is running as a system service (for example via\nsystemd) logging to stderr makes the log output going to the\njournal or syslog. Only if you run cups-browsed from the\ncommand line (for development or debugging) it will actually\nappear on stderr.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">DebugLogging\nfile <br>\nDebugLogging stderr <br>\nDebugLogging file stderr <br>\nDebugLogging none</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Only browse\nremote printers (via DNS-SD or CUPS browsing) from selected\nservers using the &quot;BrowseAllow&quot;,\n&quot;BrowseDeny&quot;, and &quot;BrowseOrder&quot;\ndirectives</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This serves for\nrestricting the choice of printers in print dialogs to\ntrusted servers or to reduce the number of listed printers\nin the print dialogs to a more user-friendly amount in large\nnetworks with very many shared printers.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This only\nfilters the selection of remote printers for which\ncups-browsed creates local queues. If the print dialog uses\nother mechanisms to list remote printers as for example\ndirect DNS-SD access, cups-browsed has no influence.\ncups-browsed also does not prevent the user from manually\naccessing non-listed printers.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">&quot;BrowseAllow&quot;:\nAccept printers from these hosts or networks. If there are\nonly &quot;BrowseAllow&quot; lines and no\n&quot;BrowseOrder&quot; and/or &quot;BrowseDeny&quot; lines,\nonly servers matching at last one &quot;BrowseAllow&quot;\nline are accepted.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">&quot;BrowseDeny&quot;:\nDeny printers from these hosts or networks. If there are\nonly &quot;BrowseDeny&quot; lines and no\n&quot;BrowseOrder&quot; and/or &quot;BrowseAllow&quot;\nlines, all servers NOT matching any of the\n&quot;BrowseDeny&quot; lines are accepted.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">&quot;BrowseOrder&quot;:\nDetermine the order in which &quot;BrowseAllow&quot; and\n&quot;BrowseDeny&quot; lines are applied. With\n&quot;BrowseOrder Deny,Allow&quot; in the beginning all\nservers are accepted, then the &quot;BrowseDeny&quot; lines\nare applied to exclude unwished servers or networks and\nafter that the &quot;BrowseAllow&quot; lines to re-include\nservers or networks. With &quot;BrowseOrder Allow,Deny&quot;\nwe start with denying all servers, then applying the\n&quot;BrowseAllow&quot; lines and afterwards the\n&quot;BrowseDeny&quot; lines.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Default for\n&quot;BrowseOrder&quot; is &quot;Deny.Allow&quot; if there\nare both &quot;BrowseAllow&quot; and &quot;BrowseDeny&quot;\nlines.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If there are no\n&quot;Browse...&quot; lines at all, all servers are\naccepted.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseAllow All\n<br>\nBrowseAllow 192.168.7.20 <br>\nBrowseAllow 192.168.7.0/24 <br>\nBrowseAllow 192.168.7.0/255.255.255.0</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseDeny All\n<br>\nBrowseDeny 192.168.1.13 <br>\nBrowseDeny 192.168.3.0/24 <br>\nBrowseDeny 192.168.3.0/255.255.255.0</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseOrder\nDeny,Allow <br>\nBrowseOrder Allow,Deny</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Filtering of\nremote printers by other properties than IP addresses of\ntheir servers</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Often the\ndesired selection of printers cannot be reached by only\ntaking into account the IP addresses of the servers. For\nthese cases there is the BrowseFilter directive to filter by\nmost of the known properties of the printer.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">By default\nthere is no BrowseFilter line meaning that no filtering is\napplied.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To do filtering\none can supply one or more BrowseFilter directives like\nthis:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\n[NOT] [EXACT] &lt;FIELD&gt; [&lt;VALUE&gt;]</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nBrowseFilter directive always starts with the word\n&quot;BrowseFilter&quot; and it must at least contain the\nname of the data field (&lt;FIELD&gt;) of the\nprinter&rsquo;s properties to which it should apply.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Available field\nnames are:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">name: Name of\nthe local print queue to be created <br>\nhost: Host name of the remote print server <br>\nport: Port through which the printer is accessed on the\nserver <br>\nservice: DNS/SD service name of the remote printer <br>\ndomain: Domain of the remote print server</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Also all field\nnames in the TXT records of DNS-SD-advertised printers are\nvalid, like &quot;color&quot;, &quot;duplex&quot;,\n&quot;pdl&quot;, ... If the field name of the filter rule\ndoes not exist for the printer, the rule is skipped.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The optional\n&lt;VALUE&gt; field is either the exact value (when the\noption EXACT is supplied) or a regular expression (Run\n&quot;man 7 regex&quot; in a terminal window) to be matched\nwith the data field.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If no\n&lt;VALUE&gt; filed is supplied, rules with field names of\nthe TXT record are considered for boolean matching\n(true/false) of boolean field (like duplex, which can have\nthe values &quot;T&quot; for true and &quot;F&quot; for\nfalse).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If the option\nNOT is supplied, the filter rule is fulfilled if the regular\nexpression or the exact value DOES NOT match the content of\nthe data field. In a boolean rule (without &lt;VALUE&gt;)\nthe rule matches false.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Regular\nexpressions are always considered case-insensitive and\nextended POSIX regular expressions. Field names and options\n(NOT, EXACT) are all evaluated case-insensitive. If there is\nan error in a regular expression, the BrowseFilter line gets\nignored.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Especially to\nnote is that supplying any simple string consisting of only\nletters, numbers, spaces, and some basic special characters\nas a regular expression matches if it is contained somewhere\nin the data field.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If there is\nmore than one BrowseFilter directive, ALL the directives\nneed to be fulfilled for the remote printer to be accepted.\nIf one is not fulfilled, the printer will get ignored.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Examples:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Rules for\nstandard data items which are supplied with any remote\nprinter advertised via DNS-SD:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Print queue\nname must contain &quot;hum_res_&quot;, this matches\n&quot;hum_res_mono&quot; or &quot;hum_res_color&quot; but\nalso &quot;old_hum_res_mono&quot;:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\nname hum_res_</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This matches if\nthe remote host name contains &quot;printserver&quot;, like\n&quot;printserver.local&quot;,\n&quot;printserver2.example.com&quot;,\n&quot;newprintserver&quot;:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\nhost printserver</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This matches\nall ports with 631 int its number, for example 631, 8631,\n10631,...:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\nport 631</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This rule\nmatches if the DNS-SD service name contains &quot;@\nprintserver&quot;:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Browsefilter\nservice @ printserver</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Matches all\ndomains with &quot;local&quot; in their names, not only\n&quot;local&quot; but also things like\n&quot;printlocally.com&quot;:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\ndomain local</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Examples for\nrules applying to items of the TXT record:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This rule\nselects PostScript printers, as the &quot;PDL&quot; field in\nthe TXT record contains &quot;postscript&quot; then. This\nincludes also remote CUPS queues which accept PostScript,\nindependent of whether the physical printer behind the CUPS\nqueue accepts PostScript or not.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\npdl postscript</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Color printers\nusually contain a &quot;Color&quot; entry set to\n&quot;T&quot; (for true) in the TXT record. This rule\nselects them:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\ncolor</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This is a\nsimilar rule to select only duplex (automatic double-sided\nprinting) printers:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\nduplex</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Rules with the\nNOT option:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This rule\nEXCLUDES printers from all hosts containing\n&quot;financial&quot; in their names, nice to get rid of the\n100s of printers of the financial department:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\nNOT host financial</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Get only\nmonochrome printers (&quot;Color&quot; set to &quot;F&quot;,\nmeaning false, in the TXT record):</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\nNOT color</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Rules with more\nadvanced use of regular expressions:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Only queue\nnames which BEGIN WITH &quot;hum_res_&quot; are accepted\nnow, so we still get &quot;hum_res_mono&quot; or\n&quot;hum_res_color&quot; but not\n&quot;old_hum_res_mono&quot; any more:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\nname ^hum_res_</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Server names is\naccepted if it contains &quot;print_server&quot; OR\n&quot;graphics_dep_server&quot;:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\nhost print_server|graphics_dep_server</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">&quot;printserver1&quot;,\n&quot;printserver2&quot;, and &quot;printserver3&quot;,\nnothing else:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\nhost ^printserver[1-3]$</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Printers\nunderstanding at least one of PostScript, PCL, or PDF:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\npdl postscript|pcl|pdf</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Examples for\nthe EXACT option:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Only printers\nfrom &quot;printserver.local&quot; are accepted:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\nEXACT host printserver.local</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Printers from\nall servers except &quot;prinserver2.local&quot; are\naccepted:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseFilter\nNOT EXACT host prinserver2.local</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The BrowsePoll\ndirective polls a server for available printers once every\n60 seconds. Multiple BrowsePoll directives can be specified\nto poll multiple servers. The default port to connect to is\n631. BrowsePoll works independently of whether CUPS browsing\nis activated in BrowseRemoteProtocols.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowsePoll\n192.168.7.20 <br>\nBrowsePoll 192.168.7.65:631 <br>\nBrowsePoll host.example.com:631</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nBrowseLocalProtocols directive specifies the protocols to\nuse when advertising local shared printers on the network.\nThe default is &quot;none&quot;. Control of advertising of\nlocal shared printers using dnssd is done in\n/etc/cups/cupsd.conf.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseLocalProtocols\nnone <br>\nBrowseLocalProtocols CUPS</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nBrowseRemoteProtocols directive specifies the protocols to\nuse when finding remote shared printers on the network.\nMultiple protocols can be specified by separating them with\nspaces. The default is &quot;dnssd cups&quot;.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseRemoteProtocols\nnone <br>\nBrowseRemoteProtocols CUPS dnssd <br>\nBrowseRemoteProtocols CUPS <br>\nBrowseRemoteProtocols dnssd <br>\nBrowseRemoteProtocols ldap</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nBrowseProtocols directive specifies the protocols to use\nwhen finding remote shared printers on the network and\nadvertising local shared printers. &quot;dnssd&quot; and\n&quot;ldap&quot; are ignored for BrowseLocalProtocols.\nMultiple protocols can be specified by separating them with\nspaces. The default is &quot;none&quot; for\nBrowseLocalProtocols and &quot;dnssd cups&quot; for\nBrowseRemoteProtocols.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseProtocols\nnone <br>\nBrowseProtocols CUPS dnssd <br>\nBrowseProtocols CUPS <br>\nBrowseProtocols dnssd <br>\nBrowseProtocols ldap</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nconfiguration for the LDAP browsing mode define where the\nLDAP search should be performed. If built with an LDAP\nlibrary that supports TLS, the path to the server&rsquo;s\ncertificate, or to a certificates store, can be specified.\nThe optional filter allows the LDAP search to be more\nspecific, and is used in addition to the hardcoded filter\n(objectclass=cupsPrinter).</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseLDAPBindDN\ncn=cups-browsed,dc=domain,dc=tld <br>\nBrowseLDAPCACertFile /path/to/server/certificate.pem <br>\nBrowseLDAPDN ou=printers,dc=domain,dc=tld <br>\nBrowseLDAPFilter (printerLocation=/Office 1/*) <br>\nBrowseLDAPPassword s3cret <br>\nBrowseLDAPServer ldaps://ldap.domain.tld</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nDomainSocket directive specifies the domain socket through\nwhich the locally running CUPS daemon is accessed. If not\nspecified the standard domain socket of CUPS is used. Use\nthis if you have specified an alternative domain socket for\nCUPS via a Listen directive in /etc/cups/cupsd.conf. If\ncups-browsed is not able to access the local CUPS daemon via\na domain socket it accesses it via localhost.\n&quot;None&quot; or &quot;Off&quot; lets cups-browsed not\nuse CUPS&rsquo; domain socket.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">DomainSocket\n/var/run/cups/cups.sock <br>\nDomainSocket None <br>\nDomainSocket Off</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set HTTP\ntimeout (in seconds) for requests sent to local/remote\nresources Note that too short timeouts can make services\ngetting missed when they are present and operations be\nunnecessarily repeated and too long timeouts can make\noperations take too long when the server does not\nrespond.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">HttpLocalTimeout\n5 <br>\nHttpRemoteTimeout 10</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set how many\nretries (N) should cups-browsed do for creating print queues\nfor remote printers which receive timeouts during print\nqueue creation. The printers which are not successfully set\nup even after N retries, are skipped until the next restart\nof the service. Note that too many retries can cause high\nCPU load.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">HttpMaxRetries\n5</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The interval\nbetween browsing/broadcasting cycles, local and/or remote,\ncan be adjusted with the BrowseInterval directive.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseInterval\n60</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nBrowseTimeout directive determines the amount of time that\nbrowsing-related operations are allowed to take in seconds.\nNotably, adding or removing one printer queue is considered\nas one operation. The timeout applies to each one of those\noperations. Especially queues discovered by CUPS broadcasts\nwill be removed after this timeout if no further broadcast\nfrom the server happens.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">BrowseTimeout\n300</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nAllowResharingRemoteCUPSPrinters directive determines\nwhether a print queue pointing to a remote CUPS queue will\nbe re-shared to the local network or not. Since the queues\ngenerated using the BrowsePoll directive are also pointing\nto remote queues, they are also shared automatically if the\nfollowing option is set. Default is not to share remote\nqueues.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">AllowResharingRemoteCUPSPrinters\nYes</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nNewBrowsePollQueuesShared directive determines whether a\nprint queue for a newly discovered printer (discovered by\nthe BrowsePoll directive) will be shared to the local\nnetwork or not. This directive will only work if\nAllowResharingRemoteCUPSPrinters is set to yes. Default is\nnot to share printers discovered using BrowsePoll.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">NewBrowsePollQueuesShared\nYes</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set\nOnlyUnsupportedByCUPS to &quot;Yes&quot; will make\ncups-browsed not create local queues for remote printers for\nwhich CUPS creates queues by itself. These printers are\nprinters advertised via DNS-SD and doing CUPS-supported\n(currently PWG Raster and Apple Raster) driverless printing,\nincluding remote CUPS queues. Queues for other printers\n(like for legacy PostScript/PCL printers) are always created\n(depending on the other configuration settings of\ncups-browsed).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">With\nOnlyUnsupportedByCUPS set to &quot;No&quot;, cups-browsed\ncreates queues for all printers which it supports, including\nprinters for which CUPS would create queues by itself.\nTemporary queues created by CUPS will get overwritten. This\nway it is assured that any extra functionality of\ncups-browsed will apply to these queues. As queues created\nby cups-browsed are permanent CUPS queues this setting is\nalso recommended if applications/print dialogs which do not\nsupport temporary CUPS queues are installed. This setting is\nthe default.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">OnlyUnsupportedByCUPS\nYes</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">With\nUseCUPSGeneratedPPDs set to &quot;Yes&quot; cups-browsed\ncreates queues for IPP printers with PPDs generated by the\nPPD generator of CUPS and not with the one of cups-browsed.\nSo any new development in CUPS&rsquo; PPD generator gets\navailable. As CUPS&rsquo; PPD generator is not directly\naccessible, we need to make CUPS generate a temporary print\nqueue with the desired PPD. Therefore we can only use these\nPPDs when our queue replaces a temporary CUPS queue, meaning\nthat the queue is for a printer on which CUPS supports\ndriverless printing (IPP 2.x, PDLs: PDF, PWG Raster, and/or\nApple Raster) and that its name is the same as CUPS uses for\nthe temporary queue (&quot;LocalQueueNamingIPPPrinter\nDNS-SD&quot; must be set). The directive applies only to IPP\nprinters, not to remote CUPS queues, to not break\nclustering. Setting this directive to &quot;No&quot; lets\ncups-browsed generate the PPD file. Default setting is\n&quot;No&quot;.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">UseCUPSGeneratedPPDs\nNo</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">With the\ndirectives LocalQueueNamingRemoteCUPS and\nLocalQueueNamingIPPPrinter you can determine how the names\nfor local queues generated by cups-browsed are generated,\nseparately for remote CUPS printers and IPP printers.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">&quot;DNS-SD&quot;\n(the default in both cases) bases the naming on the service\nname of the printer&rsquo;s advertised DNS-SD record. This\nis exactly the same naming scheme as CUPS uses for its\ntemporary queues, so the local queue from cups-browsed\nprevents CUPS from listing and creating an additional queue.\nAs DNS-SD service names have to be unique, queue names of\nprinters from different servers will also be unique and so\nthere is no automatic clustering for load-balanced\nprinting.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">&quot;MakeModel&quot;\nbases the queue name on the printer&rsquo;s manufacturer and\nmodel names. This scheme cups-browsed used formerly for IPP\nprinters.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">&quot;RemoteName&quot;\nis only available for remote CUPS queues and uses the name\nof the queue on the remote CUPS server as the local\nqueue&rsquo;s name. This makes printers on different CUPS\nservers with equal queue names automatically forming a\nload-balancing cluster as CUPS did formerly (CUPS 1.5.x and\nolder) with CUPS-broadcasted remote printers. This scheme\ncups-browsed used formerly for remote CUPS printers.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">LocalQueueNamingRemoteCUPS\nDNS-SD <br>\nLocalQueueNamingRemoteCUPS MakeModel <br>\nLocalQueueNamingRemoteCUPS RemoteName <br>\nLocalQueueNamingIPPPrinter DNS-SD <br>\nLocalQueueNamingIPPPrinter MakeModel</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set\nDNSSDBasedDeviceURIs to &quot;Yes&quot; if cups-browsed\nshould use DNS-SD-service-name-based device URIs for its\nlocal queues, as CUPS also does. These queues use the DNS-SD\nservice name of the discovered printer. With this the URI is\nindependent of network interfaces and ports, giving reliable\nconnections to always the same physical device. This setting\nis the default.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set\nDNSSDBasedDeviceURIs to &quot;No&quot; if cups-browsed\nshould use the conventional host-name/IP-based URIs.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Note that this\noption has only influence on URIs for printers discovered\nvia DNS-SD, not via legacy CUPS broewsing or LDAP. Those\nprinters get always assigned the conventional URIs.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">DNSSDBasedDeviceURIs\nYes</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set\nIPBasedDeviceURIs to &quot;Yes&quot; if cups-browsed should\ncreate its local queues with device URIs with the IP\naddresses instead of the host names of the remote servers.\nThis mode is there for any problems with host name\nresolution in the network, especially also if avahi-daemon\nis only run for printer discovery and already stopped while\nstill printing. By default this mode is turned off, meaning\nthat we use URIs with host names.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Note that the\nIP addresses depend on the network interface through which\nthe printer is accessed. So do not use IP-based URIs on\nsystems with many network interfaces and where interfaces\ncan appear and disappear frequently.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This mode could\nalso be useful for development and debugging.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If you prefer\nIPv4 or IPv6 IP addresses in the URIs, you can set\nIPBasedDeviceURIs to &quot;IPv4&quot; to only get IPv4 IP\naddresses or IPBasedDeviceURIs to &quot;IPv6&quot; to only\nget IPv6 IP addresses.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">IPBasedDeviceURIs\nNo <br>\nIPBasedDeviceURIs Yes <br>\nIPBasedDeviceURIs IPv4 <br>\nIPBasedDeviceURIs IPv6</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set\nCreateRemoteRawPrinterQueues to &quot;Yes&quot; to let\ncups-browsed also create local queues pointing to remote raw\nCUPS queues. Normally, only queues pointing to remote queues\nwith PPD/driver are created as we do not use drivers on the\nclient side, but in some cases accessing a remote raw queue\ncan make sense, for example if the queue forwards the jobs\nby a special backend like Tea4CUPS.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">CreateRemoteRawPrinterQueues\nYes</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">cups-browsed by\ndefault creates local print queues for each shared CUPS\nprint queue which it discovers on remote machines in the\nlocal network(s). Set CreateRemoteCUPSPrinterQueues to\n&quot;No&quot; if you do not want cups-browsed to do this.\nFor example you can set cups-browsed to only create queues\nfor IPP network printers setting CreateIPPPrinterQueues not\nto &quot;No&quot; and CreateRemoteCUPSPrinterQueues to\n&quot;No&quot;.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">CreateRemoteCUPSPrinterQueues\nNo</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set\nCreateIPPPrinterQueues to &quot;All&quot; to let\ncups-browsed discover IPP network printers (native printers,\nnot CUPS queues) with known page description languages (PWG\nRaster, PDF, PostScript, PCL XL, PCL 5c/e) in the local\nnetwork and auto-create print queues for them.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set\nCreateIPPPrinterQueues to &quot;Everywhere&quot; to let\ncups-browsed discover IPP Everywhere printers in the local\nnetwork (native printers, not CUPS queues) and auto-create\nprint queues for them.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set\nCreateIPPPrinterQueues to &quot;AppleRaster&quot; to let\ncups-browsed discover Apple Raster printers in the local\nnetwork (native printers, not CUPS queues) and auto-create\nprint queues for them.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set\nCreateIPPPrinterQueues to &quot;Driverless&quot; to let\ncups-browsed discover printers designed for driverless use\n(currently IPP Everywhere and Apple Raster) in the local\nnetwork (native printers, not CUPS queues) and auto-create\nprint queues for them.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set\nCreateIPPPrinterQueues to &quot;LocalOnly&quot; to\nauto-create print queues only for local printers made\navailable as IPP printers. These are for example\nIPP-over-USB printers, made available via ippusbxd(8). This\nis the default.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Set\nCreateIPPPrinterQueues to &quot;No&quot; to not auto-create\nprint queues for IPP network printers.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If queues with\nPPD file are created (see IPPPrinterQueueType directive\nbelow) the PPDs are auto-generated by cups-browsed based on\nproperties of the printer polled via IPP. In case of missing\ninformation, info from the Bonjour record is used asd as\nlast mean default values.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If queues\nwithout PPD (see IPPPrinterQueueType directive below) are\ncreated clients have to IPP-poll the capabilities of the\nprinter and send option settings as standard IPP attributes.\nThen we do not poll the capabilities by ourselves to not\nwake up the printer from power-saving mode when creating the\nqueues. Jobs have to be sent in one of PDF, PWG Raster, or\nJPEG format. Other formats are not accepted.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This\nfunctionality is primarily for mobile devices running CUPS\nto not need a printer setup tool nor a collection of printer\ndrivers and PPDs.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">CreateIPPPrinterQueues\nNo <br>\nCreateIPPPrinterQueues LocalOnly <br>\nCreateIPPPrinterQueues Everywhere <br>\nCreateIPPPrinterQueues AppleRaster <br>\nCreateIPPPrinterQueues Everywhere AppleRaster <br>\nCreateIPPPrinterQueues Driverless <br>\nCreateIPPPrinterQueues All</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If cups-browsed\nis automatically creating print queues for native IPP\nnetwork printers (&quot;CreateIPPPrinterQueues Yes&quot;),\nthe type of queue to be created can be selected by the\n&quot;IPPPrinterQueueType&quot; directive. The\n&quot;PPD&quot; (default) setting makes queues with PPD file\nbeing created. With &quot;Interface&quot; or\n&quot;NoPPD&quot; the queue is created with a System V\ninterface script (Not supported with CUPS 2.2.x or later).\n&quot;Auto&quot; is for backward compatibility and also lets\nqueues with PPD get created.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">IPPPrinterQueueType\nPPD <br>\nIPPPrinterQueueType NoPPD <br>\nIPPPrinterQueueType Interface <br>\nIPPPrinterQueueType Auto</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nNewIPPPrinterQueuesShared directive determines whether a\nprint queue for a newly discovered IPP network printer (not\nremote CUPS queue) will be shared to the local network or\nnot. This is only valid for newly discovered printers. For\nprinters discovered in an earlier cups-browsed session,\ncups-browsed will remember whether the printer was shared,\nso changes by the user get conserved. Default is not to\nshare newly discovered IPP printers.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">NewIPPPrinterQueuesShared\nYes</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">How to handle\nthe print queues cups-browsed creates when cups-browsed is\nshut down:</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">&quot;KeepGeneratedQueuesOnShutdown\nNo&quot; makes the queues being removed. This makes sense as\nthese queues only work while cups-browsed is running.\ncups-browsed has to determine to which member printer of a\ncluster to pass on the job.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">&quot;KeepGeneratedQueuesOnShutdown\nYes&quot; (the default) makes the queues not being removed.\nThis is the recommended setting for a system where\ncups-browsed is permanently running and only stopped for\nshort times (like log rotation) or on shutdown. This avoids\nthe re-creation of the queues when cups-browsed is\nrestarted, which often causes a clutter of CUPS\nnotifications on the desktop.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">KeepGeneratedQueuesOnShutdown\nNo</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If there is\nmore than one remote CUPS printer whose local queue would\nget the same name and AutoClustering is set to\n&quot;Yes&quot; (the default) only one local queue is\ncreated which makes up a load-balancing cluster of the\nremote printers which would get this queue name (implicit\nclass). This means that when several jobs are sent to this\nqueue they get distributed between the printers, using the\nmethod chosen by the LoadBalancing directive.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Note that the\nforming of clusters depends on the naming scheme for local\nqueues created by cups-browsed. If you have set\nLocalQueueNamingRemoteCUPS to &quot;DNSSD&quot; you will not\nget automatic clustering as the DNS-SD service names are\nalways unique. With LocalQueueNamingRemoteCUPS set to\n&quot;RemoteName&quot; local queues are named as the CUPS\nqueues on the remote servers are named and so equally named\nqueues on different servers get clustered (this is how CUPS\ndid it in version 1.5.x or older).\nLocalQueueNamingRemoteCUPS set to &quot;MakeModel&quot;\nmakes remote printers of the same model get clustered. Note\nthat then a cluster can contain more than one queue of the\nsame server.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">With\nAutoClustering set to &quot;No&quot;, for each remote CUPS\nprinter an individual local queue is created, and to avoid\nname clashes when using the LocalQueueNamingRemoteCUPS\nsettings &quot;RemoteName&quot; or &quot;MakeModel&quot;\n&quot;@&lt;server name&gt;&quot; is added to the local queue\nname.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Only remote\nCUPS printers get clustered, not IPP network printers or\nIPP-over-USB printers.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">AutoClustering\nYes <br>\nAutoClustering No</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Load-balancing\nprinter cluster formation can also be manually controlled by\ndefining explicitly which remote CUPS printers should get\nclustered together.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This is done by\nthe &quot;Cluster&quot; directive:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Cluster\n&lt;QUEUENAME&gt;: &lt;EXPRESSION1&gt; &lt;EXPRESSION2&gt;\n... <br>\nCluster &lt;QUEUENAME&gt;</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If no\nexpressions are given, &lt;QUEUENAME&gt; is used as the\nfirst and only expression for this cluster.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Discovered\nprinters are matched against all the expressions of all\ndefined clusters. The first expression which matches the\ndiscovered printer determines to which cluster it belongs.\nNote that this way a printer can only belong to one cluster.\nOnce matched, further cluster definitions will not checked\nany more.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">With the first\nprinter matching a cluster&rsquo;s expression a local queue\nwith the name &lt;QUEUENAME&gt; is created. If more printers\nare discovered and match this cluster, they join the\ncluster. Printing to this queue prints to all these printers\nin a load-balancing manner, according to to the setting of\nthe LoadBalancing directive.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Each expression\nmust be a string of characters without spaces. If spaces are\nneeded, replace them by underscores (&rsquo;_&rsquo;).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">An expression\ncan be matched in three ways:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">1. By the name\nof the CUPS queue on the remote server <br>\n2. By make and model name of the remote printer <br>\n3. By the DNS-SD service name of the remote printer</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Note that the\nmatching is done case-insensitively and any group of\nnon-alphanumerical characters is replaced by a single\nunderscore.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">So if an\nexpression is &quot;HP_DeskJet_2540&quot; and the remote\nserver reports &quot;hp Deskjet-2540&quot; the printer gets\nmatched to this cluster.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If\n&quot;AutoClustering&quot; is not set to &quot;No&quot; both\nyour manual cluster definitions will be followed and\nautomatic clustering of equally-named remote queues will be\nperformed. If a printer matches in both categories the match\nto the manually defined cluster has priority. Automatic\nclustering of equally-named remote printers is not performed\nif there is a manually defined cluster with this name (at\nleast as the printers do not match this cluster).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Examples:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To cluster all\nremote CUPS queues named &quot;laserprinter&quot; in your\nlocal network but not cluster any other equally-named remote\nCUPS printers use (Local queue will get named\n&quot;laserprinter&quot;):</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">AutoClustering\nNo <br>\nCluster laserprinter</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To cluster all\nremote CUPS queues of HP LaserJet 4050 printers in a local\nqueue named &quot;LJ4050&quot;:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Cluster LJ4050:\nHP_LaserJet_4050</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">As DNS-SD\nservice names are unique in a network you can create a\ncluster from exactly specified printers (spaces replaced by\nunderscores):</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Cluster hrdep:\noldlaser_@_hr-server1 newlaser_@_hr-server2</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nLoadBalancing directive switches between two methods of\nhandling load balancing between equally-named remote queues\nwhich are represented by one local print queue making up a\ncluster of them (implicit class).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The two methods\nare:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Queuing of jobs\non the client (LoadBalancing QueueOnClient):</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Here we queue\nup the jobs on the client and regularly check the clustered\nremote print queues. If we find an idle queue, we pass on a\njob to it.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This is also\nthe method which CUPS uses for classes. Advantage is a more\neven distribution of the job workload on the servers\n(especially if the printing speed of the servers is very\ndifferent), and if a server fails, there are not several\njobs stuck or lost. Disadvantage is that if one takes the\nclient (laptop, mobile phone, ...) out of the local network,\nprinting stops with the jobs waiting in the local queue.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Queuing of jobs\non the servers (LoadBalancing QueueOnServers):</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Here we check\nthe number of jobs on each of the clustered remote printers\nand send an incoming job immediately to the remote printer\nwith the lowest amount of jobs in its queue. This way no\njobs queue up locally, all jobs which are waiting are\nwaiting on one of the remote servers.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Not having jobs\nwaiting locally has the advantage that we can take the local\nmachine from the network and all jobs get printed.\nDisadvantage is that if a server with a full queue of jobs\ngoes away, the jobs go away, too.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Default is\nqueuing the jobs on the client as this is what CUPS does\nwith classes.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">LoadBalancing\nQueueOnClient <br>\nLoadBalancing QueueOnServers</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">With the\nDefaultOptions directive one or more option settings can be\ndefined to be applied to every print queue newly created by\ncups-browsed. Each option is supplied as one supplies\noptions with the &quot;-o&quot; command line argument to the\n&quot;lpadmin&quot; command (Run &quot;man lpadmin&quot; for\nmore details). More than one option can be supplied\nseparating the options by spaces. By default no option\nsettings are pre-defined.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Note that print\nqueues which cups-browsed already created before remember\ntheir previous settings and so these settings do not get\napplied.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">DefaultOptions\nOption1=Value1 Option2=Value2 Option3 noOption4</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nAutoShutdown directive specifies whether cups-browsed should\nautomatically terminate when it has no local raw queues set\nup pointing to any discovered remote printers or no jobs on\nsuch queues depending on AutoShutdownOn setting (auto\nshutdown mode). Setting it to &quot;On&quot; activates the\nauto-shutdown mode, setting it to &quot;Off&quot;\ndeactivates it (the default). The special mode\n&quot;avahi&quot; turns auto shutdown off while avahi-daemon\nis running and on when avahi-daemon stops. This allows\nrunning cups-browsed on-demand when avahi-daemon is run\non-demand.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">AutoShutdown\nOff <br>\nAutoShutdown On <br>\nAutoShutdown avahi</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nAutoShutdownOn directive determines what event cups-browsed\nconsiders as inactivity in auto shutdown mode.\n&quot;NoQueues&quot; (the default) means that auto shutdown\nis initiated when there are no queues for discovered remote\nprinters generated by cups-browsed any more.\n&quot;NoJobs&quot; means that all queues generated by\ncups-browsed are without jobs.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">AutoShutdownOn\nNoQueues <br>\nAutoShutdownOn NoJobs</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">DebugLogFileSize\ndefines the maximum size possible (in KBytes) of the log\nfiles (cups-browsed_log and cups-browsed_previous_logs) that\nis created using cups-browsed in the debugging mode. Setting\nits value to 0 would turn off any restriction on the size of\nthe file.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">DebugLogFileSize\n300</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\nAutoShutdownTimeout directive specifies after how many\nseconds without local raw queues set up pointing to any\ndiscovered remote printers or jobs on these queues\ncups-browsed should actually shut down in auto shutdown\nmode. Default is 30 seconds, 0 means immediate shutdown.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">AutoShutdownTimeout\n20</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">NotifLeaseDuration\ndefines how long the D-BUS subscription created by\ncups-browsed in cupsd will last before cupsd cancels it. The\ndefault value is 1 day in seconds - 86400. The subscription\nrenewal is set to happen after half of NotifLeaseDuration\npassed. The D-BUS notifications are used for watching over\nqueues and doing specific actions when a D-BUS notification\ncomes.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">NotifLeaseDuration\n86400</p>\n\n<h2>SEE ALSO\n<a name=\"SEE ALSO\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>cups-browsed</b>(8)</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">/usr/share/doc/cups-browsed/README.gz</p>\n\n<h2>AUTHOR\n<a name=\"AUTHOR\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The authors of\ncups-browsed are listed in\n/usr/share/doc/cups-browsed/AUTHORS.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This manual\npage was written for the Debian Project, but it may be used\nby others.</p>\n<hr>\n","headings":["<a href=\"#NAME\">NAME</a>","<a href=\"#DESCRIPTION\">DESCRIPTION</a>","<a href=\"#DIRECTIVES\">DIRECTIVES</a>","<a href=\"#SEE ALSO\">SEE ALSO</a>","<a href=\"#AUTHOR\">AUTHOR</a>"],"level":5}