{"name":"lj4_font","description":"lj4_font - groff fonts for use with devlj4","body":"\n\n<h1 align=\"center\">LJ4_FONT</h1>\n\n\n\n\n\n\n\n<hr>\n\n\n<h2>NAME\n<a name=\"NAME\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">lj4_font -\ngroff fonts for use with devlj4</p>\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Nominally, all\nHewlett-Packard LaserJet&nbsp;4-series and newer printers\nhave the same internal fonts: 45 scalable fonts and one\nbitmapped Lineprinter font. The scalable fonts are available\nin sizes between 0.25 points and 999.75 points, in\n0.25-point increments; the Lineprinter font is available\nonly in 8.5-point size.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The LaserJet\nfont files included with <b>groff</b> assume that all\nprinters since the LaserJet&nbsp;4 are identical. There are\nsome differences between fonts in the earlier and more\nrecent printers, however. The LaserJet&nbsp;4 printer used\nAgfa Intellifont technology for 35 of the internal scalable\nfonts; the remaining 10 scalable fonts were TrueType.\nBeginning with the LaserJet&nbsp;4000-series printers\nintroduced in 1997, all scalable internal fonts have been\nTrueType. The number of printable glyphs differs slightly\nbetween Intellifont and TrueType fonts (generally, the\nTrueType fonts include more glyphs), and there are some\nminor differences in glyph metrics. Differences among\nprinter models are described in the <i>PCL&nbsp;5 Comparison\nGuide</i> and the <i>PCL&nbsp;5 Comparison Guide\nAddendum</i> (for printers introduced since approximately\n2001).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">LaserJet\nprinters reference a glyph by a combination of a 256-glyph\nsymbol set and an index within that symbol set. Many glyphs\nappear in more than one symbol set; all combinations of\nsymbol set and index that reference the same glyph are\nequivalent. For each glyph, <a href=\"https://man.page/1/hpftodit\">hpftodit(1)</a> searches a\nlist of symbol sets, and selects the first set that contains\nthe glyph. The printing code generated by <b>hpftodit</b> is\nan integer that encodes a numerical value for the symbol set\nin the high byte(s), and the index in the low byte. See\n<a href=\"https://man.page/5/groff_font\">groff_font(5)</a> for a complete description of the font\nfile format; symbol sets are described in greater detail in\nthe <i>PCL&nbsp;5 Printer Language Technical Reference\nManual</i>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Two of the\nscalable fonts, Symbol and Wingdings, are bound to 256-glyph\nsymbol sets; the remaining scalable fonts, as well as the\nLineprinter font, support numerous symbol sets, sufficient\nto enable printing of more than 600 glyphs.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The metrics\ngenerated by <b>hpftodit</b> assume that the DESC file\ncontains values of 1200 for <i>res</i> and 6350 for\n<i>unitwidth</i>, or any combination (e.g., 2400 and 3175)\nfor which\n<i>res&nbsp;</i>&times;&nbsp;<i>unitwidth&nbsp;</i>=&nbsp;7620000.\nAlthough HP PCL&nbsp;5 LaserJet printers support an internal\nresolution of 7200 units per inch, they use a 16-bit signed\ninteger for cursor positioning; if <b>devlj4</b> is to\nsupport U.S. ledger paper\n(11&nbsp;in&nbsp;&times;&nbsp;17&nbsp;in; in = inch), the\nmaximum usable resolution is 32767&nbsp;&divide;&nbsp;17, or\n1927 units per inch, which rounds down to 1200 units per\ninch. If the largest required paper size is less (e.g.,\n8.5&nbsp;in&nbsp;&times;&nbsp;11&nbsp;in, or A5), a greater\n<i>res</i> (and lesser <i>unitwidth</i>) can be\nspecified.</p>\n\n<h2>LIMITATIONS\n<a name=\"LIMITATIONS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Font metrics\nfor Intellifont fonts were provided by Tagged Font Metric\n(TFM) files originally developed by Agfa/Compugraphic. The\nTFM files provided for these fonts supported 600+ glyphs and\ncontained extensive lists of kerning pairs.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To accommodate\ndevelopers who had become accustomed to TFM files, HP also\nprovided TFM files for the 10 TrueType fonts included in the\nLaserJet&nbsp;4. The TFM files for TrueType fonts generally\nincluded less information than the Intellifont TFMs,\nsupporting fewer glyphs, and in most cases, providing no\nkerning information. By the time the LaserJet&nbsp;4000\nprinter was introduced, most developers had migrated to\nother means of obtaining font metrics, and support for new\nTFM files was very limited. The TFM files provided for the\nTrueType fonts in the LaserJet&nbsp;4000 support only the\nLatin 2 (ISO 8859-2) symbol set, and include no kerning\ninformation; consequently, they are of little value for any\nbut the most rudimentary documents.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Because the\nIntellifont TFM files contain considerably more information,\nthey generally are preferable to the TrueType TFM files even\nfor use with the TrueType fonts in the newer printers. The\nmetrics for the TrueType fonts are very close, though not\nidentical, to those for the earlier Intellifont fonts of the\nsame names. Although most output using the Intellifont\nmetrics with the newer printers is quite acceptable, a few\nglyphs may fail to print as expected. The differences in\nglyph metrics may be particularly noticeable with composite\nparentheses, brackets, and braces used by\n<a href=\"https://man.page/1/eqn\">eqn(1)</a><b>.</b> A script, located in\n<i>/usr/share/groff/1.22.4/font/devlj4/generate</i>, can be\nused to adjust the metrics for these glyphs in the special\nfont &ldquo;S&rdquo; for use with printers that have all\nTrueType fonts.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">At the time HP\nlast supported TFM files, only version 1.0 of the Unicode\nstandard was available. Consequently, many glyphs lacking\nassigned code points were assigned by HP to the Private Use\nArea (PUA). Later versions of the Unicode standard included\ncode points outside the PUA for many of these glyphs. The\nHP-supplied TrueType TFM files use the PUA assignments; TFM\nfiles generated from more recent TrueType font files require\nthe later Unicode values to access the same glyphs.\nConsequently, two different mapping files may be required:\none for the HP-supplied TFM files, and one for more recent\nTFM files.</p>\n\n<h2>FILES\n<a name=\"FILES\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><i>/usr/share/groff/1.22.4/font/devlj4/DESC</i></p>\n\n<p style=\"margin-left:22%;\">device description file</p>\n\n\n<p style=\"margin-left:11%;\"><i>/usr/share/groff/1.22.4/font/devlj4/</i>F</p>\n\n<p style=\"margin-left:22%;\">font description file for font\n<i>F</i></p>\n\n\n<p style=\"margin-left:11%;\"><i>/usr/share/groff/1.22.4/font/devlj4/generate</i></p>\n\n<p style=\"margin-left:22%;\">corrects Intellifont-based\nheight metrics for several glyphs in the special font for\nTrueType CG Times (LaserJet&nbsp;4000 and later).</p>\n\n<h2>SEE ALSO\n<a name=\"SEE ALSO\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><a href=\"https://man.page/1/groff\">groff(1)</a>,\n<a href=\"https://man.page/1/hpftodit\">hpftodit(1)</a>, <a href=\"https://man.page/1/grolj4\">grolj4(1)</a>,\n<a href=\"https://man.page/5/groff_font\">groff_font(5)</a></p>\n<hr>\n","headings":["<a href=\"#NAME\">NAME</a>","<a href=\"#DESCRIPTION\">DESCRIPTION</a>","<a href=\"#LIMITATIONS\">LIMITATIONS</a>","<a href=\"#FILES\">FILES</a>","<a href=\"#SEE ALSO\">SEE ALSO</a>"],"level":5}