{"name":"pam","body":"\n\n<h1 align=\"center\">pam</h1>\n\n\n\n\n\n<hr>\n\n\n<h2>NAME\n<a name=\"NAME\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">pam - portable\narbitrary map file format</p>\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The PAM image\nformat is a lowest common denominator 2 dimensional map\nformat.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">It is designed\nto be used for any of myriad kinds of graphics, but can\ntheoretically be used for any kind of data that is arranged\nas a two dimensional rectangular array. Actually, from\nanother perspective it can be seen as a format for data\narranged as a three dimensional array.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This format\ndoes not define the meaning of the data at any particular\npoint in the array. It could be red, green, and blue light\nintensities such that the array represents a visual image,\nor it could be the same red, green, and blue components plus\na transparency component, or it could contain annual\nrainfalls for places on the surface of the Earth. Any\nprocess that uses the PAM format must further define the\nformat to specify the meanings of the data.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A PAM image\ndescribes a two dimensional grid of tuples. The tuples are\narranged in rows and columns. The width of the image is the\nnumber of columns. The height of the image is the number of\nrows. All rows are the same width and all columns are the\nsame height. The tuples may have any degree, but all tuples\nhave the same degree. The degree of the tuples is called the\ndepth of the image. Each member of a tuple is called a\nsample. A sample is an unsigned integer which represents a\nlocus along a scale which starts at zero and ends at a\ncertain maximum value greater than zero called the maxval.\nThe maxval is the same for every sample in the image. The\ntwo dimensional array of all the Nth samples of each tuple\nis called the Nth plane or Nth channel of the image.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Though the\nformat does not assign any meaning to the tuple values, it\ndoes include an optional string that describes that meaning.\nThe contents of this string, called the tuple type, are\narbitrary from the point of view of the PAM format, but\nusers of the format may assign meaning to it by convention\nso they can identify their particular implementations of the\nPAM format.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>The\nLayout</b> <br>\nA PAM file consists of a sequence of one or more PAM images.\nThere are no data, delimiters, or padding before, after, or\nbetween images.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Each PAM image\nconsists of a header followed immediately by a raster.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Here is an\nexample header:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>P7 <br>\nWIDTH 227 <br>\nHEIGHT 149 <br>\nDEPTH 3 <br>\nMAXVAL 255 <br>\nTUPLTYPE RGB <br>\nENDHDR</b></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The header\nbegins with the ASCII characters &quot;P7&quot; followed by\nnewline. This is the magic number.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The header\ncontinues with an arbitrary number of lines of ASCII text.\nEach line ends with and is delimited by a newline\ncharacter.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Each header\nline consists of zero or more whitespace-delimited tokens or\nbegins with &quot;#&quot;. If it begins with &quot;#&quot;\nit is a comment and the rest of this specification does not\napply to it.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A header line\nwhich has zero tokens is valid but has no meaning.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The type of\nheader line is identified by its first token, which is 8\ncharacters or less:</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>ENDHDR</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>This is the last line in the header. The header must\ncontain exactly one of these header lines.</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>HEIGHT</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>The second token is a decimal number representing the\nheight of the image (number of rows). The header must\ncontain exactly one of these header lines.</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>WIDTH</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>The second token is a decimal number representing the\nwidth of the image (number of columns). The header must\ncontain exactly one of these header lines.</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>DEPTH</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>The second token is a decimal number representing the\ndepth of the image (number of planes or channels). The\nheader must contain exactly one of these header lines.</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>MAXVAL</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>The second token is a decimal number representing the\nmaxval of the image. The header must contain exactly one of\nthese header lines.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>TUPLTYPE</b></p>\n\n<p style=\"margin-left:22%;\">The header may contain any\nnumber of these header lines, including zero. The rest of\nthe line is part of the tuple type. The rest of the line is\nnot tokenized, but the tuple type does not include any white\nspace immediately following <b>TUPLTYPE</b> or at the very\nend of the line. It does not include a newline. If there are\nmultiple <b>TUPLTYPE</b> header lines, the tuple type is the\nconcatenation of the values from each of them, separated by\na single blank, in the order in which they appear in the\nheader. If there are no <b>TUPLTYPE</b> header lines the\ntuple type is the null string.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The raster\nconsists of each row of the image, in order from top to\nbottom, consecutive with no delimiter of any kind between,\nbefore, or after, rows.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Each row\nconsists of every tuple in the row, in order from left to\nright, consecutive with no delimiter of any kind between,\nbefore, or after, tuples.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Each tuple\nconsists of every sample in the tuple, in order, consecutive\nwith no delimiter of any kind between, before, or after,\nsamples.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Each sample\nconsists of an unsigned integer in pure binary format, with\nthe most significant byte first. The number of bytes is the\nminimum number of bytes required to represent the maxval of\nthe image.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>PAM Used For\nPNM (PBM, PGM, or PPM) Images</b> <br>\nA common use of PAM images is to represent the older and\nmore concrete PBM, PGM, and PPM images.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A PBM image is\nconventionally represented as a PAM image of depth 1 with\nmaxval 1 where the one sample in each tuple is 0 to\nrepresent a black pixel and 1 to represent a white one. The\nheight, width, and raster bear the obvious relationship to\nthose of the PBM image. The tuple type for PBM images\nrepresented as PAM images is conventionally\n&quot;BLACKANDWHITE&quot;.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A PGM image is\nconventionally represented as a PAM image of depth 1. The\nmaxval, height, width, and raster bear the obvious\nrelationship to those of the PGM image. The tuple type for\nPGM images represented as PAM images is conventionally\n&quot;GRAYSCALE&quot;.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A PPM image is\nconventionally represented as a PAM image of depth 3. The\nmaxval, height, width, and raster bear the obvious\nrelationship to those of the PPM image. The first plane\nrepresents red, the second green, and the third blue. The\ntuple type for PPM images represented as PAM images is\nconventionally &quot;RGB&quot;.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>The\nConfusing Universe of Netpbm Formats</b> <br>\nIt is easy to get confused about the relationship between\nthe PAM format and PBM, PGM, PPM, and PNM. Here is a little\nenlightenment:</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">&quot;PNM&quot;\nis not really a format. It is a shorthand for the PBM, PGM,\nand PPM formats collectively. It is also the name of a group\nof library functions that can each handle all three of those\nformats.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">&quot;PAM&quot;\nis in fact a fourth format. But it is so general that you\ncan represent the same information in a PAM image as you can\nin a PBM, PGM, or PPM image. And in fact a program that is\ndesigned to read PBM, PGM, or PPM and does so with a recent\nversion of the Netpbm library, will read an equivalent PAM\nimage just fine and the program will never know the\ndifference.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To confuse\nthings more, there is a collection of library routines\ncalled the &quot;pam&quot; functions that read and write the\nPAM format, but also read and write the PBM, PGM, and PPM\nformats. They do this because the latter formats are much\nolder and more popular, so this makes it convenient to write\nprograms that use the newer PAM format.</p>\n\n<h2>SEE ALSO\n<a name=\"SEE ALSO\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><a href=\"https://man.page/5/pbm\">pbm(5)</a>,\n<a href=\"https://man.page/5/pgm\">pgm(5)</a>, <a href=\"https://man.page/5/ppm\">ppm(5)</a>, <a href=\"https://man.page/5/pnm\">pnm(5)</a>,\n<a href=\"https://man.page/3/libpnm\">libpnm(3)</a></p>\n<hr>\n","headings":["<a href=\"#NAME\">NAME</a>","<a href=\"#DESCRIPTION\">DESCRIPTION</a>","<a href=\"#SEE ALSO\">SEE ALSO</a>"],"level":5}