{"name":"sources.list","body":"\n\n<h1 align=\"center\">SOURCES.LIST</h1>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<hr>\n\n\n<h2>NAME\n<a name=\"NAME\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">sources.list -\nList of configured APT data sources</p>\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The source list\n/etc/apt/sources.list and the files contained in\n/etc/apt/sources.list.d/ are designed to support any number\nof active sources and a variety of source media. The files\nlist one source per line (one-line style) or contain\nmultiline stanzas defining one or more sources per stanza\n(deb822 style), with the most preferred source listed first\n(in case a single version is available from more than one\nsource). The information available from the configured\nsources is acquired by <b>apt-get update</b> (or by an\nequivalent command from another APT front-end).</p>\n\n<h2>SOURCES.LIST.D\n<a name=\"SOURCES.LIST.D\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n/etc/apt/sources.list.d directory provides a way to add\nsources.list entries in separate files. Two different file\nformats are allowed as described in the next two sections.\nFilenames need to have either the extension .list or\n.sources depending on the contained format. The filenames\nmay only contain letters (a-z and A-Z), digits (0-9),\nunderscore (_), hyphen (-) and period (.) characters.\nOtherwise APT will print a notice that it has ignored a\nfile, unless that file matches a pattern in the\nDir::Ignore-Files-Silently configuration list - in which\ncase it will be silently ignored.</p>\n\n<h2>ONE-LINE-STYLE FORMAT\n<a name=\"ONE-LINE-STYLE FORMAT\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Files in this\nformat have the extension .list. Each line specifying a\nsource starts with a type (e.g. deb-src) followed by options\nand arguments for this type. Individual entries cannot be\ncontinued onto a following line. Empty lines are ignored,\nand a # character anywhere on a line marks the remainder of\nthat line as a comment. Consequently an entry can be\ndisabled by commenting out the entire line. If options\nshould be provided they are separated by spaces and all of\nthem together are enclosed by square brackets ([]) included\nin the line after the type separated from it with a space.\nIf an option allows multiple values these are separated from\neach other with a comma (,). An option name is separated\nfrom its value(s) by an equals sign (=). Multivalue options\nalso have -= and += as separators, which instead of\nreplacing the default with the given value(s) modify the\ndefault value(s) to remove or include the given values.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This is the\ntraditional format and supported by all apt versions. Note\nthat not all options as described below are supported by all\napt versions. Note also that some older applications parsing\nthis format on their own might not expect to encounter\noptions as they were uncommon before the introduction of\nmulti-architecture support.</p>\n\n<h2>DEB822-STYLE FORMAT\n<a name=\"DEB822-STYLE FORMAT\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Files in this\nformat have the extension .sources. The format is similar in\nsyntax to other files used by Debian and its derivatives,\nsuch as the metadata files that apt will download from the\nconfigured sources or the debian/control file in a Debian\nsource package. Individual entries are separated by an empty\nline; additional empty lines are ignored, and a # character\nat the start of the line marks the entire line as a comment.\nAn entry can hence be disabled by commenting out each line\nbelonging to the stanza, but it is usually easier to add the\nfield &quot;Enabled: no&quot; to the stanza to disable the\nentry. Removing the field or setting it to yes re-enables\nit. Options have the same syntax as every other field: A\nfield name separated by a colon (:) and optionally spaces\nfrom its value(s). Note especially that multiple values are\nseparated by whitespaces (like spaces, tabs and newlines),\nnot by commas as in the one-line format. Multivalue fields\nlike Architectures also have Architectures-Add and\nArchitectures-Remove to modify the default value rather than\nreplacing it.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This is a new\nformat supported by apt itself since version 1.1. Previous\nversions ignore such files with a notice message as\ndescribed earlier. It is intended to make this format\ngradually the default format, deprecating the previously\ndescribed one-line-style format, as it is easier to create,\nextend and modify for humans and machines alike especially\nif a lot of sources and/or options are involved. Developers\nwho are working with and/or parsing apt sources are highly\nencouraged to add support for this format and to contact the\nAPT team to coordinate and share this work. Users can freely\nadopt this format already, but may encounter problems with\nsoftware not supporting the format yet.</p>\n\n<h2>THE DEB AND DEB-SRC TYPES: GENERAL FORMAT\n<a name=\"THE DEB AND DEB-SRC TYPES: GENERAL FORMAT\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The deb type\nreferences a typical two-level Debian archive,\ndistribution/component. The distribution is generally a\nsuite name like stable or testing or a codename like\nbullseye or bookworm while component is one of main, contrib\nor non-free. The deb-src type references a Debian\ndistribution's source code in the same form as the deb type.\nA deb-src line is required to fetch source indexes.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The format for\ntwo one-line-style entries using the deb and deb-src types\nis:</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">deb [\noption1=value1 option2=value2 ] uri suite [component1]\n[component2] [...] <br>\ndeb-src [ option1=value1 option2=value2 ] uri suite\n[component1] [component2] [...]</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Alternatively\nthe equivalent entry in deb822 style looks like this:</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb\ndeb-src <br>\nURIs: uri <br>\nSuites: suite <br>\nComponents: [component1] [component2] [...] <br>\noption1: value1 <br>\noption2: value2</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The URI for the\ndeb type must specify the base of the Debian distribution,\nfrom which APT will find the information it needs. suite can\nspecify an exact path, in which case the components must be\nomitted and suite must end with a slash (/). This is useful\nfor the case when only a particular sub-directory of the\narchive denoted by the URI is of interest. If suite does not\nspecify an exact path, at least one component must be\npresent.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">suite may also\ncontain a variable, $(ARCH) which expands to the Debian\narchitecture (such as amd64 or armel) used on the system.\nThis permits architecture-independent sources.list files to\nbe used. In general this is only of interest when specifying\nan exact path; APT will automatically generate a URI with\nthe current architecture otherwise.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Especially in\nthe one-line-style format since only one distribution can be\nspecified per line it may be necessary to have multiple\nlines for the same URI, if a subset of all available\ndistributions or components at that location is desired. APT\nwill sort the URI list after it has generated a complete set\ninternally, and will collapse multiple references to the\nsame Internet host, for instance, into a single connection,\nso that it does not inefficiently establish a connection,\nclose it, do something else, and then re-establish a\nconnection to that same host. APT also parallelizes\nconnections to different hosts to more effectively deal with\nsites with low bandwidth.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">It is important\nto list sources in order of preference, with the most\npreferred source listed first. Typically this will result in\nsorting by speed from fastest to slowest (CD-ROM followed by\nhosts on a local network, followed by distant Internet\nhosts, for example).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">As an example,\nthe sources for your distribution could look like this in\none-line-style format:</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">deb\nhttp://us.archive.ubuntu.com/ubuntu hirsute main restricted\n<br>\ndeb http://security.ubuntu.com/ubuntu hirsute-security main\nrestricted <br>\ndeb http://us.archive.ubuntu.com/ubuntu hirsute-updates main\nrestricted</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">or like this in\ndeb822 style format:</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb <br>\nURIs: http://us.archive.ubuntu.com/ubuntu <br>\nSuites: hirsute hirsute-updates <br>\nComponents: main restricted</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb <br>\nURIs: http://security.ubuntu.com/ubuntu <br>\nSuites: hirsute-security <br>\nComponents: main restricted</p>\n\n<h2>THE DEB AND DEB-SRC TYPES: OPTIONS\n<a name=\"THE DEB AND DEB-SRC TYPES: OPTIONS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Each source\nentry can have options specified to modify which source is\naccessed and how data is acquired from it. Format, syntax\nand names of the options vary between the one-line-style and\ndeb822-style formats as described, but they both have the\nsame options available. For simplicity we list the deb822\nfield name and provide the one-line name in brackets.\nRemember that besides setting multivalue options explicitly,\nthere is also the option to modify them based on the\ndefault, but we aren't listing those names explicitly here.\nUnsupported options are silently ignored by all APT\nversions.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>Architectures</b> (<b>arch</b>) is a multivalue option\ndefining for which architectures information should be\ndownloaded. If this option isn't set the default is all\narchitectures as defined by the <b>APT::Architectures</b>\nconfig option.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>Languages</b> (<b>lang</b>) is a multivalue option\ndefining for which languages information such as translated\npackage descriptions should be downloaded. If this option\nisn't set the default is all languages as defined by the\n<b>Acquire::Languages</b> config option.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>Targets</b> (<b>target</b>) is a multivalue option\ndefining which download targets apt will try to acquire from\nthis source. If not specified, the default set is defined by\nthe <b>Acquire::IndexTargets</b> configuration scope\n(targets are specified by their name in the Created-By\nfield). Additionally, targets can be enabled or disabled by\nusing the Identifier field as an option with a boolean value\ninstead of using this multivalue option.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>PDiffs</b> (<b>pdiffs</b>) is a yes/no value which\ncontrols if APT should try to use PDiffs to update old\nindexes instead of downloading the new indexes entirely. The\nvalue of this option is ignored if the repository doesn't\nannounce the availability of PDiffs. Defaults to the value\nof the option with the same name for a specific index file\ndefined in the <b>Acquire::IndexTargets</b> scope, which\nitself defaults to the value of configuration option\n<b>Acquire::PDiffs</b> which defaults to yes.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>By-Hash</b> (<b>by-hash</b>) can have the value yes, no\nor force and controls if APT should try to acquire indexes\nvia a URI constructed from a hashsum of the expected file\ninstead of using the well-known stable filename of the\nindex. Using this can avoid hashsum mismatches, but requires\na supporting mirror. A yes or no value activates/disables\nthe use of this feature if this source indicates support for\nit, while force will enable the feature regardless of what\nthe source indicates. Defaults to the value of the option of\nthe same name for a specific index file defined in the\n<b>Acquire::IndexTargets</b> scope, which itself defaults to\nthe value of configuration option <b>Acquire::By-Hash</b>\nwhich defaults to yes.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Furthermore,\nthere are options which if set affect <i>all</i> sources\nwith the same URI and Suite, so they have to be set on all\nsuch entries and can not be varied between different\ncomponents. APT will try to detect and error out on such\nanomalies.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>Allow-Insecure</b> (<b>allow-insecure</b>),\n<b>Allow-Weak</b> (<b>allow-weak</b>) and\n<b>Allow-Downgrade-To-Insecure</b>\n(<b>allow-downgrade-to-insecure</b>) are boolean values\nwhich all default to no. If set to yes they circumvent parts\nof <b>apt-secure</b>(8) and should therefore not be used\nlightly!</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>Trusted</b> (<b>trusted</b>) is a tri-state value which\ndefaults to APT deciding if a source is considered trusted\nor if warnings should be raised before e.g. packages are\ninstalled from this source. This option can be used to\noverride that decision. The value yes tells APT always to\nconsider this source as trusted, even if it doesn't pass\nauthentication checks. It disables parts of\n<b>apt-secure</b>(8), and should therefore only be used in a\nlocal and trusted context (if at all) as otherwise security\nis breached. The value no does the opposite, causing the\nsource to be handled as untrusted even if the authentication\nchecks passed successfully. The default value can't be set\nexplicitly.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>Signed-By</b> (<b>signed-by</b>) is an option to require\na repository to pass <b>apt-secure</b>(8) verification with\na certain set of keys rather than all trusted keys apt has\nconfigured. It is specified as a list of absolute paths to\nkeyring files (have to be accessible and readable for the\n_apt system user, so ensure everyone has read-permissions on\nthe file) and fingerprints of keys to select from these\nkeyrings. The recommended locations for keyrings are\n/usr/share/keyrings for keyrings managed by packages, and\n/etc/apt/keyrings for keyrings managed by the system\noperator. If no keyring files are specified the default is\nthe trusted.gpg keyring and all keyrings in the\ntrusted.gpg.d/ directory (see <b>apt-key fingerprint</b>).\nIf no fingerprint is specified all keys in the keyrings are\nselected. A fingerprint will accept also all signatures by a\nsubkey of this key, if this isn't desired an exclamation\nmark (!) can be appended to the fingerprint to disable this\nbehaviour. The option defaults to the value of the option\nwith the same name if set in the previously acquired Release\nfile of this repository (only fingerprints can be specified\nthere through). Otherwise all keys in the trusted keyrings\nare considered valid signers for this repository. The option\nmay also be set directly to an embedded GPG public key\nblock. Special care is needed to encode the empty line with\nleading spaces and &quot;.&quot;:</p>\n\n<p style=\"margin-left:23%; margin-top: 1em\">Types: deb <br>\nURIs: https://deb.debian.org <br>\nSuites: stable <br>\nComponents: main contrib non-free <br>\nSigned-By: <br>\n-----BEGIN PGP PUBLIC KEY BLOCK----- <br>\n. <br>\n\nmDMEYCQjIxYJKwYBBAHaRw8BAQdAD/P5Nvvnvk66SxBBHDbhRml9ORg1WV5CvzKY\n<br>\n\nCuMfoIS0BmFiY2RlZoiQBBMWCgA4FiEErCIG1VhKWMWo2yfAREZd5NfO31cFAmAk\n<br>\n\nIyMCGyMFCwkIBwMFFQoJCAsFFgIDAQACHgECF4AACgkQREZd5NfO31fbOwD6ArzS\n<br>\n\ndM0Dkd5h2Ujy1b6KcAaVW9FOa5UNfJ9FFBtjLQEBAJ7UyWD3dZzhvlaAwunsk7DG\n<br>\n3bHcln8DMpIJVXht78sL <br>\n=IE0r <br>\n-----END PGP PUBLIC KEY BLOCK-----</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>Check-Valid-Until</b> (<b>check-valid-until</b>) is a\nyes/no value which controls if APT should try to detect\nreplay attacks. A repository creator can declare a time\nuntil which the data provided in the repository should be\nconsidered valid, and if this time is reached, but no new\ndata is provided, the data is considered expired and an\nerror is raised. Besides increasing security, as a malicious\nattacker can't send old data forever to prevent a user from\nupgrading to a new version, this also helps users identify\nmirrors which are no longer updated. However, some\nrepositories such as historic archives are not updated any\nmore by design, so this check can be disabled by setting\nthis option to no. Defaults to the value of configuration\noption <b>Acquire::Check-Valid-Until</b> which itself\ndefaults to yes.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>Valid-Until-Min</b> (<b>valid-until-min</b>) and\n<b>Valid-Until-Max</b> (<b>valid-until-max</b>) can be used\nto raise or lower the time period in seconds in which the\ndata from this repository is considered valid. -Max can be\nespecially useful if the repository provides no Valid-Until\nfield on its Release file to set your own value, while -Min\ncan be used to increase the valid time on seldom updated\n(local) mirrors of a more frequently updated but less\naccessible archive (which is in the sources.list as well)\ninstead of disabling the check entirely. Default to the\nvalue of the configuration options\n<b>Acquire::Min-ValidTime</b> and\n<b>Acquire::Max-ValidTime</b> which are both unset by\ndefault.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>Check-Date</b> (<b>check-date</b>) is a yes/no value\nwhich controls if APT should consider the machine's time\ncorrect and hence perform time related checks, such as\nverifying that a Release file is not from the future.\nDisabling it also disables the <b>Check-Valid-Until</b>\noption mentioned above.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>Date-Max-Future</b> (<b>date-max-future</b>) controls how\nfar from the future a repository may be. Default to the\nvalue of the configuration option\n<b>Acquire::Max-FutureTime</b> which is 10 seconds by\ndefault.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">&bull;\n<b>InRelease-Path</b> (<b>inrelease-path</b>) determines the\npath to the InRelease file, relative to the normal position\nof an InRelease file. By default, this option is unset and\nAPT will try to fetch an InRelease or, if that fails, a\nRelease file and its associated Release.gpg file. By setting\nthis option, the specified path will be tried instead of the\nInRelease file, and the fallback to Release files will be\ndisabled.</p>\n\n<h2>URI SPECIFICATION\n<a name=\"URI SPECIFICATION\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">The currently\nrecognized URI types are:</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>http</b>\n(<a href=\"https://man.page/1/apt-transport-http\">apt-transport-http(1)</a>)</p>\n\n<p style=\"margin-left:17%;\">The http scheme specifies an\nHTTP server for an archive and is the most commonly used\nmethod. The URI can directly include login information if\nthe archive requires it, but the use of\n<b>apt_auth.conf</b>(5) should be preferred. The method also\nsupports SOCKS5 and HTTP(S) proxies either configured via\napt-specific configuration or specified by the environment\nvariable <b>http_proxy</b> in the format (assuming an HTTP\nproxy requiring authentication)\n<i>http://user:pass@server:port/</i>. The authentication\ndetails for proxies can also be supplied via\n<b>apt_auth.conf</b>(5).</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Note that these\nforms of authentication are insecure as the whole\ncommunication with the remote server (or proxy) is not\nencrypted so a sufficiently capable attacker can observe and\nrecord login as well as all other interactions. The attacker\ncan <i>not</i> modify the communication through as APT's\ndata security model is independent of the chosen transport\nmethod. See <b>apt-secure</b>(8) for details.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>https</b>\n(<a href=\"https://man.page/1/apt-transport-https\">apt-transport-https(1)</a>)</p>\n\n<p style=\"margin-left:17%;\">The https scheme specifies an\nHTTPS server for an archive and is very similar in use and\navailable options to the http scheme. The main difference is\nthat the communication between apt and server (or proxy) is\nencrypted. Note that the encryption does not prevent an\nattacker from knowing which server (or proxy) apt is\ncommunicating with and deeper analysis can potentially still\nreveal which data was downloaded. If this is a concern the\nTor-based schemes mentioned further below might be a\nsuitable alternative.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>mirror</b>,\n<b>mirror+</b><i>scheme</i>\n(<a href=\"https://man.page/1/apt-transport-mirror\">apt-transport-mirror(1)</a>)</p>\n\n<p style=\"margin-left:17%;\">The mirror scheme specifies the\nlocation of a mirrorlist. By default the scheme used for the\nlocation is http, but any other scheme can be used via\n<b>mirror+</b><i>scheme</i>. The mirrorlist itself can\ncontain many different URIs for mirrors the APT client can\ntransparently pick, choose and fallback between intended to\nhelp both with distributing the load over the available\nmirrors and ensuring that clients can acquire data even if\nsome configured mirrors are not available.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>file</b></p>\n\n<p style=\"margin-left:17%;\">The file scheme allows an\narbitrary directory in the file system to be considered an\narchive. This is useful for NFS mounts and local mirrors or\narchives.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>cdrom</b></p>\n\n<p style=\"margin-left:17%;\">The cdrom scheme allows APT to\nuse a local CD-ROM, DVD or USB drive with media swapping.\nUse the <b>apt-cdrom</b>(8) program to create cdrom entries\nin the source list.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>ftp</b></p>\n\n<p style=\"margin-left:17%;\">The ftp scheme specifies an FTP\nserver for an archive. Use of FTP is on the decline in\nfavour of http and https and many archives either never\noffered or are retiring FTP access. If you still need this\nmethod many configuration options for it are available in\nthe Acquire::ftp scope and detailed in\n<b>apt.conf</b>(5).</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Please note\nthat an FTP proxy can be specified by using the\n<b>ftp_proxy</b> environment variable. It is possible to\nspecify an HTTP proxy (HTTP proxy servers often understand\nFTP URLs) using this environment variable and <i>only</i>\nthis environment variable. Proxies using HTTP specified in\nthe configuration file will be ignored.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>copy</b></p>\n\n<p style=\"margin-left:17%;\">The copy scheme is identical to\nthe file scheme except that packages are copied into the\ncache directory instead of used directly at their location.\nThis is useful for people using removable media to copy\nfiles around with APT.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>rsh</b>,\n<b>ssh</b></p>\n\n<p style=\"margin-left:17%;\">The rsh/ssh method invokes\nRSH/SSH to connect to a remote host and access the files as\na given user. Prior configuration of rhosts or RSA keys is\nrecommended. The standard <b>find</b> and <b>dd</b> commands\nare used to perform the file transfers from the remote\nhost.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">adding more\nrecognizable URI types</p>\n\n<p style=\"margin-left:17%;\">APT can be extended with more\nmethods shipped in other optional packages, which should\nfollow the naming scheme apt-transport-<i>method</i>. For\ninstance, the APT team also maintains the package\napt-transport-tor, which provides access methods for HTTP\nand HTTPS URIs routed via the Tor network.</p>\n\n<h2>EXAMPLES\n<a name=\"EXAMPLES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Uses the\narchive stored locally (or NFS mounted) at /home/apt/debian\nfor stable/main, stable/contrib, and stable/non-free.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">deb\nfile:/home/apt/debian stable main contrib non-free</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb <br>\nURIs: file:/home/apt/debian <br>\nSuites: stable <br>\nComponents: main contrib non-free</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">As above,\nexcept this uses the unstable (development)\ndistribution.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">deb\nfile:/home/apt/debian unstable main contrib non-free</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb <br>\nURIs: file:/home/apt/debian <br>\nSuites: unstable <br>\nComponents: main contrib non-free</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Sources\nspecification for the above.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">deb-src\nfile:/home/apt/debian unstable main contrib non-free</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb-src\n<br>\nURIs: file:/home/apt/debian <br>\nSuites: unstable <br>\nComponents: main contrib non-free</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The first line\ngets package information for the architectures in\nAPT::Architectures while the second always retrieves amd64\nand armel.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">deb\nhttp://deb.debian.org/debian bullseye main <br>\ndeb [ arch=amd64,armel ] http://deb.debian.org/debian\nbullseye main</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb <br>\nURIs: http://deb.debian.org/debian <br>\nSuites: bullseye <br>\nComponents: main</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb <br>\nURIs: http://deb.debian.org/debian <br>\nSuites: bullseye <br>\nComponents: main <br>\nArchitectures: amd64 armel</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Uses HTTP to\naccess the archive at archive.debian.org, and uses only the\nhamm/main area.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">deb\nhttp://archive.debian.org/debian-archive hamm main</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb <br>\nURIs: http://archive.debian.org/debian-archive <br>\nSuites: hamm <br>\nComponents: main</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Uses FTP to\naccess the archive at ftp.debian.org, under the debian\ndirectory, and uses only the bullseye/contrib area.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">deb\nftp://ftp.debian.org/debian bullseye contrib</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb <br>\nURIs: ftp://ftp.debian.org/debian <br>\nSuites: bullseye <br>\nComponents: contrib</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Uses FTP to\naccess the archive at ftp.debian.org, under the debian\ndirectory, and uses only the unstable/contrib area. If this\nline appears as well as the one in the previous example in\nsources.list a single FTP session will be used for both\nresource lines.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">deb\nftp://ftp.debian.org/debian unstable contrib</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb <br>\nURIs: ftp://ftp.debian.org/debian <br>\nSuites: unstable <br>\nComponents: contrib</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Uses HTTP to\naccess the archive at ftp.tlh.debian.org, under the universe\ndirectory, and uses only files found under\nunstable/binary-i386 on i386 machines, unstable/binary-amd64\non amd64, and so forth for other supported architectures.\n[Note this example only illustrates how to use the\nsubstitution variable; official debian archives are not\nstructured like this]</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">deb\nhttp://ftp.tlh.debian.org/universe\nunstable/binary-$(ARCH)/</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb <br>\nURIs: http://ftp.tlh.debian.org/universe <br>\nSuites: unstable/binary-$(ARCH)/</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Uses HTTP to\nget binary packages as well as sources from the stable,\ntesting and unstable suites and the components main and\ncontrib.</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">deb\nhttp://deb.debian.org/debian stable main contrib <br>\ndeb-src http://deb.debian.org/debian stable main contrib\n<br>\ndeb http://deb.debian.org/debian testing main contrib <br>\ndeb-src http://deb.debian.org/debian testing main contrib\n<br>\ndeb http://deb.debian.org/debian unstable main contrib <br>\ndeb-src http://deb.debian.org/debian unstable main\ncontrib</p>\n\n<p style=\"margin-left:17%; margin-top: 1em\">Types: deb\ndeb-src <br>\nURIs: http://deb.debian.org/debian <br>\nSuites: stable testing unstable <br>\nComponents: main contrib</p>\n\n<h2>SEE ALSO\n<a name=\"SEE ALSO\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>apt-get</b>(8),\n<b>apt.conf</b>(5),\n/usr/share/doc/apt/acquire-additional-files.md.gz</p>\n\n<h2>BUGS\n<a name=\"BUGS\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b><font color=\"#0000FF\">APT\nbug page</font></b>\n<small><font color=\"#000000\">[1]</font></small>\n<font color=\"#000000\">. If you wish to report a bug in APT,\nplease see /usr/share/doc/debian/bug-reporting.txt or the\n<a href=\"https://man.page/1/reportbug\">reportbug(1)</a> command.</font></p>\n\n<h2>AUTHORS\n<a name=\"AUTHORS\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><font color=\"#000000\"><b>Jason\nGunthorpe</b></font></p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><font color=\"#000000\"><b>APT\nteam</b></font></p>\n\n<h2>NOTES\n<a name=\"NOTES\"></a>\n</h2>\n\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"12%\"></td>\n<td width=\"3%\">\n\n\n\n<p style=\"margin-top: 1em\"><font color=\"#000000\">1.</font></p> </td>\n<td width=\"2%\"></td>\n<td width=\"18%\">\n\n\n<p style=\"margin-top: 1em\"><font color=\"#000000\">APT bug\npage</font></p> </td>\n<td width=\"65%\">\n</td></tr>\n</table>\n\n\n<p style=\"margin-left:17%;\"><font color=\"#000000\">http://bugs.debian.org/src:apt</font></p>\n<hr>\n","headings":["<a href=\"#NAME\">NAME</a>","<a href=\"#DESCRIPTION\">DESCRIPTION</a>","<a href=\"#SOURCES.LIST.D\">SOURCES.LIST.D</a>","<a href=\"#ONE-LINE-STYLE FORMAT\">ONE-LINE-STYLE FORMAT</a>","<a href=\"#DEB822-STYLE FORMAT\">DEB822-STYLE FORMAT</a>","<a href=\"#THE DEB AND DEB-SRC TYPES: GENERAL FORMAT\">THE DEB AND DEB-SRC TYPES: GENERAL FORMAT</a>","<a href=\"#THE DEB AND DEB-SRC TYPES: OPTIONS\">THE DEB AND DEB-SRC TYPES: OPTIONS</a>","<a href=\"#URI SPECIFICATION\">URI SPECIFICATION</a>","<a href=\"#EXAMPLES\">EXAMPLES</a>","<a href=\"#SEE ALSO\">SEE ALSO</a>","<a href=\"#BUGS\">BUGS</a>","<a href=\"#AUTHORS\">AUTHORS</a>","<a href=\"#NOTES\">NOTES</a>"],"level":5}