{"name":"genisoimage","body":"\n\n<h1 align=\"center\">GENISOIMAGE</h1>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<hr>\n\n\n<h2>NAME\n<a name=\"NAME\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">genisoimage -\ncreate ISO9660/Joliet/HFS filesystem with optional Rock\nRidge attributes</p>\n\n<h2>SYNOPSIS\n<a name=\"SYNOPSIS\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>genisoimage</b>\n[<i>options</i>] [<b>-o</b> <i>filename</i>] <i>pathspec</i>\n[<i>pathspec ...</i>]</p>\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>genisoimage</b>\nis a pre-mastering program to generate ISO9660/Joliet/HFS\nhybrid filesystems.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>genisoimage</b>\nis capable of generating the <b>System Use Sharing Protocol\nrecords (SUSP)</b> specified by the <b>Rock Ridge\nInterchange Protocol</b>. This is used to further describe\nthe files in the ISO9660 filesystem to a Unix host, and\nprovides information such as long filenames, UID/GID, POSIX\npermissions, symbolic links, and block and character device\nfiles.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If Joliet or\nHFS hybrid command line options are specified,\n<b>genisoimage</b> will create the additional filesystem\nmetadata needed for Joliet or HFS. Otherwise\n<b>genisoimage</b> will generate a pure ISO9660\nfilesystem.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>genisoimage</b>\ncan generate a <i>true</i> (or <i>shared</i>) HFS hybrid\nfilesystem. The same files are seen as HFS files when\naccessed from a Macintosh and as ISO9660 files when accessed\nfrom other machines. HFS stands for <i>Hierarchical File\nSystem</i> and is the native filesystem used on Macintosh\ncomputers.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">As an\nalternative, <b>genisoimage</b> can generate the <i>Apple\nExtensions to ISO9660</i> for each file. These extensions\nprovide each file with CREATOR, TYPE and certain Finder\nflags when accessed from a Macintosh. See the <b>HFS\nMACINTOSH FILE FORMATS</b> section below.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>genisoimage</b>\ntakes a snapshot of a given directory tree, and generates a\nbinary image which will correspond to an ISO9660 and/or HFS\nfilesystem when written to a block device.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Each file\nwritten to the ISO9660 filesystem must have a filename in\nthe 8.3 format (up to 8 characters, period, up to 3\ncharacters, all uppercase), even if Rock Ridge is in use.\nThis filename is used on systems that are not able to make\nuse of the Rock Ridge extensions (such as MS-DOS), and each\nfilename in each directory must be different from the other\nfilenames in the same directory. <b>genisoimage</b>\ngenerally tries to form correct names by forcing the Unix\nfilename to uppercase and truncating as required, but often\nthis yields unsatisfactory results when the truncated names\nare not all unique. <b>genisoimage</b> assigns weightings to\neach filename, and if two names that are otherwise the same\nare found, the name with the lower priority is renamed to\ninclude a 3-digit number (guaranteed to be unique). For\nexample, the two files <i>foo.bar</i> and <i>foo.bar.~1~</i>\ncould be rendered as <i>FOO.BAR;1</i> and\n<i>FOO000.BAR;1</i>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">When used with\nvarious HFS options, <b>genisoimage</b> will attempt to\nrecognise files stored in a number of Apple/Unix file\nformats and will copy the data and resource forks as well as\nany relevant Finder information. See the <b>HFS MACINTOSH\nFILE FORMATS</b> section below for more about formats\n<b>genisoimage</b> supports.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Note that\n<b>genisoimage</b> is not designed to communicate with the\nwriter directly. Most writers have proprietary command sets\nwhich vary from one manufacturer to another, and you need a\nspecialized tool to actually burn the disc. <b>wodim</b> is\none such tool. The latest version of <b>wodim</b> is\navailable from <i>http://www.cdrkit.org/</i>.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>pathspec</b>\nis the path of the directory tree to be copied into the\nISO9660 filesystem. Multiple paths can be specified, and\n<b>genisoimage</b> will merge the files found in all of the\nspecified path components to form the filesystem image.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If the option\n<b>-graft-points</b> has been specified, it is possible to\ngraft the paths at points other than the root directory, and\nit is possible to graft files or directories onto the cdrom\nimage with names different than what they have in the source\nfilesystem. This is easiest to illustrate with a couple of\nexamples. Let&rsquo;s start by assuming that a local file\n<i>../old.lis</i> exists, and you wish to include it in the\ncdrom image.</p>\n\n\n<p style=\"margin-left:22%; margin-top: 1em\">foo/bar/=../old.lis</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">will include\n<i>old.lis</i> in the cdrom image at\n<i>/foo/bar/old.lis</i>, while</p>\n\n\n<p style=\"margin-left:22%; margin-top: 1em\">foo/bar/xxx=../old.lis</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">will include\n<i>old.lis</i> in the cdrom image at <i>/foo/bar/xxx</i>.\nThe same sort of syntax can be used with directories as\nwell. <b>genisoimage</b> will create any directories\nrequired such that the graft points exist on the cdrom image\n&mdash; the directories do not need to appear in one of the\npaths. By default, any directories that are created on the\nfly like this will have permissions 0555 and appear to be\nowned by the person running <b>genisoimage</b>. If you wish\nother permissions or owners of the intermediate directories,\nsee <b>-uid</b>, <b>-gid</b>, <b>-dir-mode</b>,\n<b>-file-mode</b> and <b>-new-dir-mode</b>.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>genisoimage</b>\nwill also run on Windows machines when compiled with\nCygnus&rsquo; cygwin (available from\n<i>http://www.cygwin.com/</i>). Therefore most references in\nthis man page to <i>Unix</i> can be replaced with\n<i>Win32</i>.</p>\n\n<h2>OPTIONS\n<a name=\"OPTIONS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Several options\ncan be specified as defaults in a <i>.genisoimagerc</i>\nconfiguration file, as well as on the command line. If a\nparameter is specified in both places, the setting from the\ncommand line is used. For details on the format and possible\nlocations of this file, see <a href=\"https://man.page/5/genisoimagerc\">genisoimagerc(5)</a>. <b><br>\n-abstract</b> <i>file</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the abstract\nfilename. There is space for 37 characters. Equivalent to\n<b>ABST</b> in the <i>.genisoimagerc</i> file.</p>\n\n<p style=\"margin-left:11%;\"><b>-A</b>\n<i>application_id</i></p>\n\n<p style=\"margin-left:22%;\">Specifies a text string that\nwill be written into the volume header. This should describe\nthe application that will be on the disc. There is space for\n128 characters. Equivalent to <b>APPI</b> in the\n<i>.genisoimagerc</i> file.</p>\n\n<p style=\"margin-left:11%;\"><b>-allow-limited-size</b></p>\n\n<p style=\"margin-left:22%;\">When processing files larger\nthan 2GiB which cannot be easily represented in ISO9660, add\nthem with a shrunk visible file size to ISO9660 and with the\ncorrect visible file size to the UDF system. The result is\nan inconsistent filesystem and users need to make sure that\nthey really use UDF rather than ISO9660 driver to read a\nsuch disk. Implies enabling <b>-udf.</b></p>\n\n<p style=\"margin-left:11%;\"><b>-allow-leading-dots</b></p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>-ldots</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>Allow ISO9660 filenames to begin with a period. Usually,\na leading dot is replaced with an underscore in order to\nmaintain MS-DOS compatibility.</p></td></tr>\n</table>\n\n<p style=\"margin-left:22%;\">This violates the ISO9660\nstandard, but it happens to work on many systems. Use with\ncaution.</p>\n\n<p style=\"margin-left:11%;\"><b>-allow-lowercase</b></p>\n\n<p style=\"margin-left:22%;\">This options allows lowercase\ncharacters to appear in ISO9660 filenames. <br>\nThis violates the ISO9660 standard, but it happens to work\non some systems. Use with caution.</p>\n\n<p style=\"margin-left:11%;\"><b>-allow-multidot</b></p>\n\n<p style=\"margin-left:22%;\">This options allows more than\none dot to appear in ISO9660 filenames. A leading dot is not\naffected by this option, it may be allowed separately using\n<b>-allow-leading-dots</b>. <br>\nThis violates the ISO9660 standard, but it happens to work\non many systems. Use with caution.</p>\n\n<p style=\"margin-left:11%;\"><b>-biblio</b> <i>file</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the bibliographic\nfilename. There is space for 37 characters. Equivalent to\n<b>BIBL</b> in the <i>.genisoimagerc</i> file.</p>\n\n<p style=\"margin-left:11%;\"><b>-cache-inodes <br>\n-no-cache-inodes</b></p>\n\n<p style=\"margin-left:22%;\">Enable or disable caching inode\nand device numbers to find hard links to files. If\n<b>genisoimage</b> finds a hard link (a file with multiple\nnames), the file will also be hard-linked on the CD, so the\nfile contents only appear once. This helps to save space.\n<b>-cache-inodes</b> is default on Unix-like operating\nsystems, but <b>-no-cache-inodes</b> is default on some\nother systems such as Cygwin, because it is not safe to\nassume that inode numbers are unique on those systems. (Some\nversions of Cygwin create fake inode numbers using a weak\nhashing algorithm, which may produce duplicates.) If two\nfiles have the same inode number but are not hard links to\nthe same file, <b>genisoimage -cache-inodes</b> will not\nbehave correctly. <b>-no-cache-inodes</b> is safe in all\nsituations, but in that case <b>genisoimage</b> cannot\ndetect hard links, so the resulting CD image may be larger\nthan necessary.</p>\n\n<p style=\"margin-left:11%;\"><b>-alpha-boot</b>\n<i>alpha_boot_image</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the path and filename\nof the boot image to be used when making an Alpha/SRM\nbootable CD. The pathname must be relative to the source\npath specified to <b>genisoimage</b>.</p>\n\n<p style=\"margin-left:11%;\"><b>-hppa-bootloader</b>\n<i>hppa_bootloader_image</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the path and filename\nof the boot image to be used when making an HPPA bootable\nCD. The pathname must be relative to the source path\nspecified to <b>genisoimage</b>. Other options are required,\nat the very least a kernel filename and a boot command line.\nSee the <b>HPPA NOTES</b> section below for more\ninformation.</p>\n\n<p style=\"margin-left:11%;\"><b>-hppa-cmdline</b>\n<i>hppa_boot_command_line</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the command line to\nbe passed to the HPPA boot loader when making a bootable CD.\nSeparate the parameters with spaces or commas. More options\nmust be passed to <b>genisoimage,</b> at the very least a\nkernel filename and the boot loader filename. See the\n<b>HPPA NOTES</b> section below for more information.</p>\n\n<p style=\"margin-left:11%;\"><b>-hppa-kernel-32</b>\n<i>hppa_kernel_32</i> <b><br>\n-hppa-kernel-64</b> <i>hppa_kernel_64</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the path and filename\nof the 32-bit and/or 64-bit kernel images to be used when\nmaking an HPPA bootable CD. The pathnames must be relative\nto the source path specified to <b>genisoimage</b>. Other\noptions are required, at the very least the boot loader\nfilename and the boot command line. See the <b>HPPA\nNOTES</b> section below for more information.</p>\n\n<p style=\"margin-left:11%;\"><b>-hppa-ramdisk</b>\n<i>hppa_ramdisk_image</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the path and filename\nof the ramdisk image to be used when making an HPPA bootable\nCD. The pathname must be relative to the source path\nspecified to <b>genisoimage</b>. This parameter is optional.\nOther options are required, at the very least a kernel\nfilename and the boot command line. See the <b>HPPA\nNOTES</b> section below for more information.</p>\n\n<p style=\"margin-left:11%;\"><b>-mips-boot</b>\n<i>mips_boot_image</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the path and filename\nof the boot image to be used when making an SGI/big-endian\nMIPS bootable CD. The pathname must be relative to the\nsource path specified to <b>genisoimage</b>. This option may\nbe specified several times, to store up to 15 boot\nimages.</p>\n\n<p style=\"margin-left:11%;\"><b>-mipsel-boot</b>\n<i>mipsel_boot_image</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the path and filename\nof the boot image to be used when making an\nDEC/little-endian MIPS bootable CD. The pathname must be\nrelative to the source path specified to\n<b>genisoimage</b>.</p>\n\n<p style=\"margin-left:11%;\"><b>-B</b>\n<i>img_sun4,img_sun4c,img_sun4m,img_sun4d,img_sun4e</i>\n<b><br>\n-sparc-boot</b>\n<i>img_sun4,img_sun4c,img_sun4m,img_sun4d,img_sun4e</i></p>\n\n<p style=\"margin-left:22%;\">Specifies a comma-separated\nlist of boot images that are needed to make a bootable CD\nfor SPARC systems. Partition 0 is used for the ISO9660\nimage, the first image file is mapped to partition 1. The\ncomma-separated list may have up to 7 fields, including\nempty fields. This option is required to make a bootable CD\nfor Sun SPARC systems. If <b>-B</b> or <b>-sparc-boot</b>\nhas been specified, the first sector of the resulting image\nwill contain a Sun disk label. This disk label specifies\nslice 0 for the ISO9660 image and slices 1 to 7 for the boot\nimages that have been specified with this option. Byte\noffsets 512 to 8191 within each of the additional boot\nimages must contain a primary boot that works for the\nappropriate SPARC architecture. The rest of each of the\nimages usually contains a UFS filesystem used for the\nprimary kernel boot stage.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">The implemented\nboot method is the one found with SunOS 4.x and SunOS 5.x.\nHowever, it does not depend on SunOS internals but only on\nproperties of the Open Boot prom, so it should be usable for\nany OS for SPARC systems. For more information also see the\n<b>NOTES</b> section below.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">If the special\nfilename <b>...</b> is used, the actual and all following\nboot partitions are mapped to the previous partition. If\n<b>genisoimage</b> is called with <b>-G</b> <i>image</i>\n<b>-B</b> <i>...</i> all boot partitions are mapped to the\npartition that contains the ISO9660 filesystem image and the\ngeneric boot image that is located in the first 16 sectors\nof the disc is used for all architectures.</p>\n\n<p style=\"margin-left:11%;\"><b>-G</b>\n<i>generic_boot_image</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the path and filename\nof the generic boot image to be used when making a generic\nbootable CD. The boot image will be placed on the first 16\nsectors of the CD, before the ISO9660 primary volume\ndescriptor. If this option is used together with\n<b>-sparc-boot</b>, the Sun disk label will overlay the\nfirst 512 bytes of the generic boot image.</p>\n\n<p style=\"margin-left:11%;\"><b>-b</b>\n<i>eltorito_boot_image</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the path and filename\nof the boot image to be used when making an El Torito\nbootable CD for x86 PCs. The pathname must be relative to\nthe source path specified to <b>genisoimage</b>. This option\nis required to make an El Torito bootable CD. The boot image\nmust be exactly 1200 kB, 1440 kB or 2880 kB, and\n<b>genisoimage</b> will use this size when creating the\noutput ISO9660 filesystem. The PC BIOS will use the image to\nemulate a floppy disk, so the first 512-byte sector should\ncontain PC boot code. This will work, for example, if the\nboot image is a LILO-based boot floppy.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">If the boot\nimage is not an image of a floppy, you need to add either\n<b>-hard-disk-boot</b> or <b>-no-emul-boot</b>. If the\nsystem should not boot off the emulated disk, use\n<b>-no-boot</b>.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">If <b>-sort</b>\nhas not been specified, the boot images are sorted with low\npriority (+2) to the beginning of the medium. If you\ndon&rsquo;t like this, you need to specify a sort weight of\n0 for the boot images.</p>\n\n<p style=\"margin-left:11%;\"><b>-eltorito-alt-boot</b></p>\n\n<p style=\"margin-left:22%;\">Start with a new set of El\nTorito boot parameters. Up to 63 El Torito boot entries may\nbe stored on a single CD.</p>\n\n<p style=\"margin-left:11%;\"><b>-hard-disk-boot</b></p>\n\n<p style=\"margin-left:22%;\">Specifies that the boot image\nused to create El Torito bootable CDs is a hard disk image.\nThe image must begin with a master boot record that contains\na single partition.</p>\n\n<p style=\"margin-left:11%;\"><b>-no-emul-boot</b></p>\n\n<p style=\"margin-left:22%;\">Specifies that the boot image\nused to create El Torito bootable CDs is a &quot;no\nemulation&quot; image. The system will load and execute this\nimage without performing any disk emulation.</p>\n\n<p style=\"margin-left:11%;\"><b>-no-boot</b></p>\n\n<p style=\"margin-left:22%;\">Specifies that the created El\nTorito CD should be marked as not bootable. The system will\nprovide an emulated drive for the image, but will boot off a\nstandard boot device.</p>\n\n<p style=\"margin-left:11%;\"><b>-boot-load-seg</b>\n<i>segment_address</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the load segment\naddress of the boot image for no-emulation El Torito\nCDs.</p>\n\n<p style=\"margin-left:11%;\"><b>-boot-load-size</b>\n<i>load_sectors</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the number of\n&quot;virtual&quot; (512-byte) sectors to load in\nno-emulation mode. The default is to load the entire boot\nfile. Some BIOSes may have problems if this is not a\nmultiple of 4.</p>\n\n<p style=\"margin-left:11%;\"><b>-boot-info-table</b></p>\n\n<p style=\"margin-left:22%;\">Specifies that a 56-byte table\nwith information of the CD-ROM layout will be patched in at\noffset 8 in the boot file. If this option is given, the boot\nfile is <i>modified in the source filesystem</i>, so make a\ncopy of this file if it cannot be easily regenerated! See\nthe <b>EL TORITO BOOT INFO TABLE</b> section for a\ndescription of this table.</p>\n\n<p style=\"margin-left:11%;\"><b>-C</b>\n<i>last_sess_start,next_sess_start</i></p>\n\n<p style=\"margin-left:22%;\">This option is needed to create\na CD Extra or the image of a second session or a\nhigher-level session for a multisession disc. <b>-C</b>\ntakes two numbers separated by a comma. The first is the\nfirst sector in the last session of the disc that should be\nappended to. The second number is the starting sector number\nof the new session. The correct numbers may be retrieved by\ncalling <b>wodim -msinfo ...</b> If <b>-C</b> is used in\nconjunction with <b>-M</b>, <b>genisoimage</b> will create a\nfilesystem image that is intended to be a continuation of\nthe previous session. If <b>-C</b> is used without\n<b>-M</b>, <b>genisoimage</b> will create a filesystem image\nthat is intended to be used for a second session on a CD\nExtra. This is a multisession CD that holds audio data in\nthe first session and an ISO9660 filesystem in the second\nsession.</p>\n\n<p style=\"margin-left:11%;\"><b>-c</b>\n<i>boot_catalog</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the path and filename\nof the boot catalog, which is required for an El Torito\nbootable CD. The pathname must be relative to the source\npath specified to <b>genisoimage</b>. This file will be\ninserted into the output tree and not created in the source\nfilesystem, so be sure the specified filename does not\nconflict with an existing file, or it will be excluded.\nUsually a name like <i>boot.catalog</i> is chosen.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">If <b>-sort</b>\nhas not been specified, the boot catalog sorted with low\npriority (+1) to the beginning of the medium. If you\ndon&rsquo;t like this, you need to specify a sort weight of\n0 for the boot catalog.</p>\n\n<p style=\"margin-left:11%;\"><b>-check-oldnames</b></p>\n\n<p style=\"margin-left:22%;\">Check all filenames imported\nfrom the old session for compliance with the ISO9660 file\nnaming rules. Without this option, only names longer than 31\ncharacters are checked, as these files are a serious\nviolation of the ISO9660 standard.</p>\n\n<p style=\"margin-left:11%;\"><b>-check-session</b>\n<i>file</i></p>\n\n<p style=\"margin-left:22%;\">Check all old sessions for\ncompliance with actual <b>genisoimage</b> ISO9660 file\nnaming rules. This is a high-level option that combines\n<b>-M</b> <i>file</i> <b>-C 0,0 -check-oldnames</b>. For the\nparameter <i>file</i>, see the description of <b>-M</b>.</p>\n\n<p style=\"margin-left:11%;\"><b>-copyright</b>\n<i>file</i></p>\n\n<p style=\"margin-left:22%;\">Specifies copyright\ninformation, typically a filename on the disc. There is\nspace for 37 characters. Equivalent to <b>COPY</b> in the\n<i>.genisoimagerc</i> file.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p><b>-d</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"78%\">\n\n\n<p>Do not append a period to files that do not have\none.</p> </td></tr>\n</table>\n\n<p style=\"margin-left:22%;\">This violates the ISO9660\nstandard, but it happens to work on many systems. Use with\ncaution.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p style=\"margin-top: 1em\"><b>-D</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"78%\">\n\n\n<p style=\"margin-top: 1em\">Do not use deep directory\nrelocation, and instead just pack them in the way we see\nthem.</p> </td></tr>\n</table>\n\n<p style=\"margin-left:22%;\">If ISO9660:1999 has not been\nselected, this violates the ISO9660 standard, but it happens\nto work on many systems. Use with caution.</p>\n\n<p style=\"margin-left:11%;\"><b>-dir-mode</b>\n<i>mode</i></p>\n\n<p style=\"margin-left:22%;\">Overrides the mode of\ndirectories used to create the image to <i>mode</i>,\nspecified as 4 digits of permission bits as in\n<a href=\"https://man.page/1/chmod\">chmod(1)</a>. This option automatically enables Rock\nRidge extensions.</p>\n\n<p style=\"margin-left:11%;\"><b>-dvd-video</b></p>\n\n<p style=\"margin-left:22%;\">Generate a DVD-Video compliant\nUDF filesystem. This is done by sorting the order of the\ncontent of the appropriate files and by adding padding\nbetween the files if needed. Note that the sorting only\nworks if the DVD-Video filenames include uppercase\ncharacters only.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">Note that in\norder to get a DVD-Video compliant filesystem image, you\nneed to prepare a DVD-Video compliant directory tree. This\nrequires a directory <b>VIDEO_TS</b> (all caps) in the root\ndirectory of the resulting DVD, and usually another\ndirectory <b>AUDIO_TS</b>. <b>VIDEO_TS</b> needs to include\nall needed files (filenames must be all caps) for a\ncompliant DVD-Video filesystem.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p><b>-f</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"78%\">\n\n\n<p>Follow symbolic links when generating the filesystem.\nWhen this option is not in use, symbolic links will be\nentered using Rock Ridge if enabled, otherwise they will be\nignored.</p> </td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-file-mode</b>\n<i>mode</i></p>\n\n<p style=\"margin-left:22%;\">Overrides the mode of regular\nfiles used to create the image to <i>mode</i>, specified as\n4 digits of permission bits as in <a href=\"https://man.page/1/chmod\">chmod(1)</a>. This\noption automatically enables Rock Ridge extensions.</p>\n\n<p style=\"margin-left:11%;\"><b>-gid</b> <i>gid</i></p>\n\n<p style=\"margin-left:22%;\">Overrides the group ID read\nfrom the source files to the value of <i>gid</i>. Specifying\nthis option automatically enables Rock Ridge extensions.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"6%\">\n\n\n<p><b>-gui</b></p></td>\n<td width=\"5%\"></td>\n<td width=\"78%\">\n\n\n<p>Switch the behaviour for a GUI. This currently makes the\noutput more verbose but may have other effects in the\nfuture.</p> </td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-graft-points</b></p>\n\n<p style=\"margin-left:22%;\">Allow use of graft points for\nfilenames. If this option is used, all filenames are checked\nfor graft points. The filename is divided at the first\nunescaped equal sign. All occurrences of &rsquo;\\&rsquo; and\n&rsquo;=&rsquo; characters must be escaped with\n&rsquo;\\&rsquo; if <b>-graft-points</b> has been\nspecified.</p>\n\n<p style=\"margin-left:11%;\"><b>-hide</b> <i>glob</i></p>\n\n<p style=\"margin-left:22%;\">Hide any files matching\n<i>glob</i>, a shell wildcard pattern, from being seen in\nthe ISO9660 or Rock Ridge directory. <i>glob</i> may match\nany part of the filename or path. If <i>glob</i> matches a\ndirectory, the contents of that directory will be hidden. In\norder to match a directory name, make sure the pathname does\nnot include a trailing &rsquo;/&rsquo; character. All the\nhidden files will still be written to the output CD image\nfile. See also <b>-hide-joliet</b>, and <i>README.hide</i>.\nThis option may be used multiple times.</p>\n\n<p style=\"margin-left:11%;\"><b>-hide-list</b>\n<i>file</i></p>\n\n<p style=\"margin-left:22%;\">A file containing a list of\nshell wildcards to be hidden. See <b>-hide</b>.</p>\n\n<p style=\"margin-left:11%;\"><b>-hidden</b> <i>glob</i></p>\n\n<p style=\"margin-left:22%;\">Add the hidden (existence)\nISO9660 directory attribute for files and directories\nmatching <i>glob</i>, a shell wildcard pattern. This\nattribute will prevent the files from being shown by some\nMS-DOS and Windows commands. <i>glob</i> may match any part\nof the filename or path. In order to match a directory name,\nmake sure the pathname does not include a trailing\n&rsquo;/&rsquo; character. This option may be used multiple\ntimes.</p>\n\n<p style=\"margin-left:11%;\"><b>-hidden-list</b>\n<i>file</i></p>\n\n<p style=\"margin-left:22%;\">A file containing a list of\nshell wildcards to get the hidden attribute. See\n<b>-hidden</b>.</p>\n\n<p style=\"margin-left:11%;\"><b>-hide-joliet</b>\n<i>glob</i></p>\n\n<p style=\"margin-left:22%;\">Hide files and directories\nmatching <i>glob</i>, a shell wildcard pattern, from being\nseen in the Joliet directory. <i>glob</i> may match any part\nof the filename or path. If <i>glob</i> matches a directory,\nthe contents of that directory will be hidden. In order to\nmatch a directory name, make sure the pathname does not\ninclude a trailing &rsquo;/&rsquo; character. All the hidden\nfiles will still be written to the output CD image file.\nThis option is usually used with <b>-hide</b>. See also\n<i>README.hide</i>. This option may be used multiple\ntimes.</p>\n\n<p style=\"margin-left:11%;\"><b>-hide-joliet-list</b>\n<i>file</i></p>\n\n<p style=\"margin-left:22%;\">A file containing a list of\nshell wildcards to be hidden from the Joliet tree. See\n<b>-hide-joliet</b>.</p>\n\n\n<p style=\"margin-left:11%;\"><b>-hide-joliet-trans-tbl</b></p>\n\n<p style=\"margin-left:22%;\">Hide the <i>TRANS.TBL</i> files\nfrom the Joliet tree. These files usually don&rsquo;t make\nsense in the Joliet world as they list the real name and the\nISO9660 name which may both be different from the Joliet\nname.</p>\n\n<p style=\"margin-left:11%;\"><b>-hide-rr-moved</b></p>\n\n<p style=\"margin-left:22%;\">Rename the directory\n<i>RR_MOVED</i> to <i>.rr_moved</i> in the Rock Ridge tree.\nIt seems to be impossible to completely hide the\n<i>RR_MOVED</i> directory from the Rock Ridge tree. This\noption only makes the visible tree less confusing for people\nwho don&rsquo;t know what this directory is for. If you need\nto have no <i>RR_MOVED</i> directory at all, you should use\n<b>-D</b>. Note that if <b>-D</b> has been specified, the\nresulting filesystem is not ISO9660 level-1 compliant and\nwill not be readable on MS-DOS. See also the <b>NOTES</b>\nsection.</p>\n\n<p style=\"margin-left:11%;\"><b>-input-charset</b>\n<i>charset</i></p>\n\n<p style=\"margin-left:22%;\">Input charset that defines the\ncharacters used in local filenames. To get a list of valid\ncharset names, call <b>genisoimage -input-charset help</b>.\nTo get a 1:1 mapping, you may use <b>default</b> as charset\nname. The default initial values are <i>cp437</i> on\nDOS-based systems and <i>iso8859-1</i> on all other systems.\nSee the <b>CHARACTER SETS</b> section below for more\ndetails.</p>\n\n<p style=\"margin-left:11%;\"><b>-output-charset</b>\n<i>charset</i></p>\n\n<p style=\"margin-left:22%;\">Output charset that defines the\ncharacters that will be used in Rock Ridge filenames.\nDefaults to the input charset. See <b>CHARACTER SETS</b>\nsection below for more details.</p>\n\n<p style=\"margin-left:11%;\"><b>-iso-level</b>\n<i>level</i></p>\n\n<p style=\"margin-left:22%;\">Set the ISO9660 conformance\nlevel. Valid numbers are 1 to 4.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">With level 1,\nfiles may only consist of one section and filenames are\nrestricted to 8.3 characters.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">With level 2,\nfiles may only consist of one section.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">With level 3,\nno restrictions (other than ISO-9660:1988) do apply.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">With all\nISO9660 levels from 1 to 3, all filenames are restricted to\nuppercase letters, numbers and underscores (_). Filenames\nare limited to 31 characters, directory nesting is limited\nto 8 levels, and pathnames are limited to 255\ncharacters.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">Level 4\nofficially does not exist but <b>genisoimage</b> maps it to\nISO-9660:1999, which is ISO9660 version 2.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">With level 4,\nan enhanced volume descriptor with version number and file\nstructure version number set to 2 is emitted. Directory\nnesting is not limited to 8 levels, there is no need for a\nfile to contain a dot and the dot has no special meaning,\nfilenames do not have version numbers, and filenames can be\nup to 207 characters long, or 197 characters if Rock Ridge\nis used.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">When creating\nVersion 2 images, <b>genisoimage</b> emits an enhanced\nvolume descriptor, similar but not identical to a primary\nvolume descriptor. Be careful not to use broken software to\nmake ISO9660 images bootable by assuming a second PVD copy\nand patching this putative PVD copy into an El Torito\nVD.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p><b>-J</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"78%\">\n\n\n<p>Generate Joliet directory records in addition to regular\nISO9660 filenames. This is primarily useful when the discs\nare to be used on Windows machines. Joliet filenames are\nspecified in Unicode and each path component can be up to 64\nUnicode characters long. Note that Joliet is not a standard\n&mdash; only Microsoft Windows and Linux systems can read\nJoliet extensions. For greater portability, consider using\nboth Joliet and Rock Ridge extensions.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-joliet-long</b></p>\n\n<p style=\"margin-left:22%;\">Allow Joliet filenames to be up\nto 103 Unicode characters, instead of 64. This breaks the\nJoliet specification, but appears to work. Use with\ncaution.</p>\n\n<p style=\"margin-left:11%;\"><b>-jcharset</b>\n<i>charset</i></p>\n\n<p style=\"margin-left:22%;\">A combination of <b>-J\n-input-charset</b> <i>charset</i>. See the <b>CHARACTER\nSETS</b> section below for more details.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p><b>-l</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"78%\">\n\n\n<p>Allow full 31-character filenames. Normally the ISO9660\nfilename will be in an 8.3 format which is compatible with\nMS-DOS, even though the ISO9660 standard allows filenames of\nup to 31 characters. If you use this option, the disc may be\ndifficult to use on a MS-DOS system, but will work on most\nother systems. Use with caution.</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p><b>-L</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"78%\">\n\n\n<p>Outdated option; use <b>-allow-leading-dots</b>\ninstead.</p> </td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-jigdo-jigdo</b>\n<i>jigdo_file</i></p>\n\n<p style=\"margin-left:22%;\">Produce a <b>jigdo</b>\n<i>.jigdo</i> metadata file as well as the filesystem image.\nSee the <b>JIGDO NOTES</b> section below for more\ninformation.</p>\n\n<p style=\"margin-left:11%;\"><b>-jigdo-template</b>\n<i>template_file</i></p>\n\n<p style=\"margin-left:22%;\">Produce a <b>jigdo</b>\n<i>.template</i> file as well as the filesystem image. See\nthe <b>JIGDO NOTES</b> section below for more\ninformation.</p>\n\n<p style=\"margin-left:11%;\"><b>-jigdo-min-file-size</b>\n<i>size</i></p>\n\n<p style=\"margin-left:22%;\">Specify the minimum size for a\nfile to be listed in the <i>.jigdo</i> file. Default (and\nminimum allowed) is 1KB. See the <b>JIGDO NOTES</b> section\nbelow for more information.</p>\n\n<p style=\"margin-left:11%;\"><b>-jigdo-force-md5</b>\n<i>path</i></p>\n\n<p style=\"margin-left:22%;\">Specify a file pattern where\nfiles <i>must</i> be contained in the externally-supplied\nMD5 list as supplied by <b>-md5-list</b>. See the <b>JIGDO\nNOTES</b> section below for more information.</p>\n\n<p style=\"margin-left:11%;\"><b>-jigdo-exclude</b>\n<i>path</i></p>\n\n<p style=\"margin-left:22%;\">Specify a file pattern where\nfiles will not be listed in the <i>.jigdo</i> file. See the\n<b>JIGDO NOTES</b> section below for more information.</p>\n\n<p style=\"margin-left:11%;\"><b>-jigdo-map</b>\n<i>path</i></p>\n\n<p style=\"margin-left:22%;\">Specify a pattern mapping for\nthe jigdo file (e.g. <i>Debian=/mirror/debian</i>). See the\n<b>JIGDO NOTES</b> section below for more information.</p>\n\n<p style=\"margin-left:11%;\"><b>-md5-list</b>\n<i>md5_file</i></p>\n\n<p style=\"margin-left:22%;\">Specify a file containing the\nMD5sums, sizes and pathnames of the files to be included in\nthe <i>.jigdo</i> file. See the <b>JIGDO NOTES</b> section\nbelow for more information.</p>\n\n\n<p style=\"margin-left:11%;\"><b>-jigdo-template-compress</b>\n<i>algorithm</i></p>\n\n<p style=\"margin-left:22%;\">Specify a compression algorithm\nto use for template date. gzip and bzip2 are currently\nsupported, and gzip is the default. See the <b>JIGDO\nNOTES</b> section below for more information.</p>\n\n<p style=\"margin-left:11%;\"><b>-log-file</b>\n<i>log_file</i></p>\n\n<p style=\"margin-left:22%;\">Redirect all error, warning and\ninformational messages to <i>log_file</i> instead of the\nstandard error.</p>\n\n<p style=\"margin-left:11%;\"><b>-m</b> <i>glob</i></p>\n\n<p style=\"margin-left:22%;\">Exclude files matching\n<i>glob</i>, a shell wildcard pattern, from being written to\nCD-ROM. <i>glob</i> may match either the filename component\nor the full pathname. This option may be used multiple\ntimes. For example:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">genisoimage -o\nrom -m '*.o' -m core -m foobar</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">would exclude\nall files ending in &rsquo;.o&rsquo;, or called <i>core</i>\nor <i>foobar</i> from the image. Note that if you had a\ndirectory called <i>foobar</i>, it too (and of course all\nits descendants) would be excluded.</p>\n\n<p style=\"margin-left:11%;\"><b>-exclude-list</b>\n<i>file</i></p>\n\n<p style=\"margin-left:22%;\">A file containing a list of\nshell wildcards to be excluded. See <b>-m</b>.</p>\n\n\n<p style=\"margin-left:11%;\"><b>-max-iso9660-filenames</b></p>\n\n<p style=\"margin-left:22%;\">Allow ISO9660 filenames to be\nup to 37 characters long. This option enables <b>-N</b> as\nthe extra name space is taken from the space reserved for\nfile version numbers. <br>\nThis violates the ISO9660 standard, but it happens to work\non many systems. Although a conforming application needs to\nprovide a buffer space of at least 37 characters, discs\ncreated with this option may cause a buffer overflow in the\nreading operating system. Use with extreme care.</p>\n\n<p style=\"margin-left:11%;\"><b>-M</b> <i>path</i> <b><br>\n-M</b> <i>device</i> <b><br>\n-dev</b> <i>device</i></p>\n\n<p style=\"margin-left:22%;\">Specifies path to existing\nISO9660 image to be merged. The alternate form takes a SCSI\ndevice specifier that uses the same syntax as the\n<b>dev=</b> parameter of <b>wodim</b>. The output of\n<b>genisoimage</b> will be a new session which should get\nwritten to the end of the image specified in <b>-M</b>.\nTypically this requires multisession capability for the CD\nrecorder used to write the image. This option may only be\nused in conjunction with <b>-C</b>.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p><b>-N</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"67%\">\n\n\n<p>Omit version numbers from ISO9660 filenames.</p></td>\n<td width=\"11%\">\n</td></tr>\n</table>\n\n<p style=\"margin-left:22%;\">This violates the ISO9660\nstandard, but no one really uses the version numbers anyway.\nUse with caution.</p>\n\n<p style=\"margin-left:11%;\"><b>-new-dir-mode</b>\n<i>mode</i></p>\n\n<p style=\"margin-left:22%;\">Specify the mode, a 4-digit\nnumber as used in <a href=\"https://man.page/1/chmod\">chmod(1)</a>, to use when creating new\ndirectories in the filesystem image. The default is\n0555.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>-nobak</b></p></td>\n<td width=\"80%\">\n</td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-no-bak</b></p>\n\n<p style=\"margin-left:22%;\">Exclude backup files files on\nthe ISO9660 filesystem; that is, filenames that contain the\ncharacters &rsquo;~&rsquo; or &rsquo;#&rsquo; or end in\n<i>.bak</i>. These are typically backup files for Unix text\neditors.</p>\n\n<p style=\"margin-left:11%;\"><b>-force-rr</b></p>\n\n<p style=\"margin-left:22%;\">Do not use the automatic Rock\nRidge attributes recognition for previous sessions. This can\nwork around problems with images created by, e.g., NERO\nBurning ROM.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>-no-rr</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>Do not use the Rock Ridge attributes from previous\nsessions. This may help to avoid problems when\n<b>genisoimage</b> finds illegal Rock Ridge signatures on an\nold session.</p></td></tr>\n</table>\n\n\n<p style=\"margin-left:11%;\"><b>-no-split-symlink-components</b></p>\n\n<p style=\"margin-left:22%;\">Don&rsquo;t split the symlink\ncomponents, but begin a new Continuation Area (CE) instead.\nThis may waste some space, but the SunOS 4.1.4 cdrom driver\nhas a bug in reading split symlink components.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">It is\nquestionable whether this option is useful nowadays.</p>\n\n\n<p style=\"margin-left:11%;\"><b>-no-split-symlink-fields</b></p>\n\n<p style=\"margin-left:22%;\">Don&rsquo;t split the symlink\nfields, but begin a new Continuation Area (CE) instead. This\nmay waste some space, but the SunOS 4.1.4 and Solaris 2.5.1\ncdrom driver have a bug in reading split symlink fields (a\n&rsquo;/&rsquo; can be dropped).</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">It is\nquestionable whether this option is useful nowadays.</p>\n\n<p style=\"margin-left:11%;\"><b>-o</b> <i>filename</i></p>\n\n<p style=\"margin-left:22%;\">Specify the output file for the\nthe ISO9660 filesystem image. This can be a disk file, a\ntape drive, or it can correspond directly to the device name\nof the optical disc writer. If not specified, stdout is\nused. Note that the output can also be a block device for a\nregular disk partition, in which case the ISO9660 filesystem\ncan be mounted normally to verify that it was generated\ncorrectly.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"6%\">\n\n\n<p><b>-pad</b></p></td>\n<td width=\"5%\"></td>\n<td width=\"78%\">\n\n\n<p>Pad the end of the whole image by 150 sectors (300 kB).\nThis option is enabled by default. If used in combination\nwith <b>-B</b>, padding is inserted between the ISO9660\npartition and the boot partitions, such that the first boot\npartition starts on a sector number that is a multiple of\n16.</p> </td></tr>\n</table>\n\n<p style=\"margin-left:22%; margin-top: 1em\">The padding is\nneeded as many operating systems (e.g. Linux) implement\nread-ahead bugs in their filesystem I/O. These bugs result\nin read errors on files that are located near the end of a\ntrack, particularly if the disc is written in Track At Once\nmode, or where a CD audio track follows the data track.</p>\n\n<p style=\"margin-left:11%;\"><b>-no-pad</b></p>\n\n<p style=\"margin-left:22%;\">Do not pad the end by 150\nsectors (300 kB) and do not make the the boot partitions\nstart on a multiple of 16 sectors.</p>\n\n<p style=\"margin-left:11%;\"><b>-path-list</b>\n<i>file</i></p>\n\n<p style=\"margin-left:22%;\">A file containing a list of\n<i>pathspec</i> directories and filenames to be added to the\nISO9660 filesystem. This list of pathspecs are processed\nafter any that appear on the command line. If the argument\nis <i>-</i>, the list is read from the standard input.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p><b>-P</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"61%\">\n\n\n<p>Outdated option; use <b>-publisher</b> instead.</p></td>\n<td width=\"17%\">\n</td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-publisher</b>\n<i>publisher_id</i></p>\n\n<p style=\"margin-left:22%;\">Specifies a text string that\nwill be written into the volume header. This should describe\nthe publisher of the CD-ROM, usually with a mailing address\nand phone number. There is space for 128 characters.\nEquivalent to <b>PUBL</b> in the <i>.genisoimagerc</i>\nfile.</p>\n\n<p style=\"margin-left:11%;\"><b>-p</b>\n<i>preparer_id</i></p>\n\n<p style=\"margin-left:22%;\">Specifies a text string that\nwill be written into the volume header. This should describe\nthe preparer of the CD-ROM, usually with a mailing address\nand phone number. There is space for 128 characters.\nEquivalent to <b>PREP</b> in the <i>.genisoimagerc</i>\nfile.</p>\n\n<p style=\"margin-left:11%;\"><b>-print-size</b></p>\n\n<p style=\"margin-left:22%;\">Print estimated filesystem size\nin multiples of the sector size (2048 bytes) and exit. This\noption is needed for Disk At Once mode and with some CD-R\ndrives when piping directly into <b>wodim</b>, cases where\n<b>wodim</b> needs to know the size of the filesystem image\nin advance. Old versions of <b>mkisofs</b> wrote this\ninformation (among other information) to <i>stderr</i>. As\nthis turns out to be hard to parse, the number without any\nother information is now printed on <i>stdout</i> too. If\nyou like to write a simple shell script, redirect\n<i>stderr</i> and catch the number from <i>stdout</i>. This\nmay be done with:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">cdblocks=`\ngenisoimage -print-size -quiet ... ` <br>\ngenisoimage ... | wodim ... tsize=${cdblocks}s -</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>-quiet</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>This makes <b>genisoimage</b> even less verbose. No\nprogress output will be provided.</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>-R</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>Generate SUSP and RR records using the Rock Ridge\nprotocol to further describe the files on the ISO9660\nfilesystem.</p> </td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>-r</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>This is like the -R option, but file ownership and modes\nare set to more useful values. The uid and gid are set to\nzero, because they are usually only useful on the\nauthor&rsquo;s system, and not useful to the client. All the\nfile read bits are set true, so that files and directories\nare globally readable on the client. If any execute bit is\nset for a file, set all of the execute bits, so that\nexecutables are globally executable on the client. If any\nsearch bit is set for a directory, set all of the search\nbits, so that directories are globally searchable on the\nclient. All write bits are cleared, because the filesystem\nwill be mounted read-only in any case. If any of the special\nmode bits are set, clear them, because file locks are not\nuseful on a read-only filesystem, and set-id bits are not\ndesirable for uid 0 or gid 0. When used on Win32, the\nexecute bit is set on <i>all</i> files. This is a result of\nthe lack of file permissions on Win32 and the Cygwin POSIX\nemulation layer. See also <b>-uid</b>, <b>-gid</b>,\n<b>-dir-mode</b>, <b>-file-mode</b> and\n<b>-new-dir-mode</b>.</p> </td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-relaxed-filenames</b></p>\n\n<p style=\"margin-left:22%;\">Allows ISO9660 filenames to\ninclude all 7-bit ASCII characters except lowercase letters.\n<br>\nThis violates the ISO9660 standard, but it happens to work\non many systems. Use with caution.</p>\n\n<p style=\"margin-left:11%;\"><b>-root</b> <i>dir</i></p>\n\n<p style=\"margin-left:22%;\">Moves all files and directories\ninto <i>dir</i> in the image. This is essentially the same\nas using <b>-graft-points</b> and adding <i>dir</i> in front\nof every pathspec, but is easier to use. <i>dir</i> may\nactually be several levels deep. It is created with the same\npermissions as other graft points.</p>\n\n<p style=\"margin-left:11%;\"><b>-old-root</b> <i>dir</i></p>\n\n<p style=\"margin-left:22%;\">This option is necessary when\nwriting a multisession image and the previous (or even\nolder) session was written with <b>-root</b> <i>dir</i>.\nUsing a directory name not found in the previous session\ncauses <b>genisoimage</b> to abort with an error. Without\nthis option, <b>genisoimage</b> would not be able to find\nunmodified files and would be forced to write their data\ninto the image once more. <b>-root</b> and <b>-old-root</b>\nare meant to be used together to do incremental backups. The\ninitial session would e.g. use: <b>genisoimage -root\nbackup_1</b> <i>dirs</i>. The next incremental backup with\n<b>genisoimage -root backup_2 -old-root backup_1</b>\n<i>dirs</i> would take another snapshot of these\ndirectories. The first snapshot would be found in\n<b>backup_1</b>, the second one in <b>backup_2</b>, but only\nmodified or new files need to be written into the second\nsession. Without these options, new files would be added and\nold ones would be preserved. But old ones would be\noverwritten if the file was modified. Recovering the files\nby copying the whole directory back from CD would also\nrestore files that were deleted intentionally. Accessing\nseveral older versions of a file requires support by the\noperating system to choose which sessions are to be\nmounted.</p>\n\n<p style=\"margin-left:11%;\"><b>-sort</b>\n<i>sort_file</i></p>\n\n<p style=\"margin-left:22%;\">Sort file locations on the\nmedia. Sorting is controlled by a file that contains pairs\nof filenames and sorting offset weighting. If the weighting\nis higher, the file will be located closer to the beginning\nof the media, if the weighting is lower, the file will be\nlocated closer to the end of the media. There must be only\none space or tabs character between the filename and the\nweight and the weight must be the last characters on a line.\nThe filename is taken to include all the characters up to,\nbut not including the last space or tab character on a line.\nThis is to allow for space characters to be in, or at the\nend of a filename. This option does <b>not</b> sort the\norder of the filenames that appear in the ISO9660 directory.\nIt sorts the order in which the file data is written to the\nCD image, which is useful in order to optimize the data\nlayout on a CD. See <b>README.sort</b> for more details.</p>\n\n<p style=\"margin-left:11%;\"><b>-sparc-boot</b>\n<i>img_sun4,img_sun4c,img_sun4m,img_sun4d,img_sun4e</i></p>\n\n<p style=\"margin-left:22%;\">See <b>-B</b> above.</p>\n\n<p style=\"margin-left:11%;\"><b>-sparc-label</b>\n<i>label</i></p>\n\n<p style=\"margin-left:22%;\">Set the Sun disk label name for\nthe Sun disk label that is created with\n<b>-sparc-boot</b>.</p>\n\n<p style=\"margin-left:11%;\"><b>-split-output</b></p>\n\n<p style=\"margin-left:22%;\">Split the output image into\nseveral files of approximately 1 GB each. This helps to\ncreate DVD-sized ISO9660 images on operating systems without\nlarge file support. <b>wodim</b> will concatenate more than\none file into a single track if writing to a DVD. To make\n<b>-split-output</b> work, <b>-o</b> <i>filename</i> must be\nspecified. The resulting output images will be named:\n<i>filename_00</i>, <i>filename_01</i>,\n<i>filename_02</i>....</p>\n\n<p style=\"margin-left:11%;\"><b>-stream-media-size</b>\n<i>#</i></p>\n\n<p style=\"margin-left:22%;\">Select streaming operation and\nset the media size to # sectors. This allows you to pipe the\noutput of the <a href=\"https://man.page/1/tar\">tar(1)</a> program into <b>genisoimage</b>\nand to create an ISO9660 filesystem without the need of an\nintermediate tar archive file. If this option has been\nspecified, <b>genisoimage</b> reads from <i>stdin</i> and\ncreates a file with the name <i>STREAM.IMG</i>. The maximum\nsize of the file (with padding) is 200 sectors less than the\nspecified media size. If <b>-no-pad</b> has been specified,\nthe file size is 50 sectors less than the specified media\nsize. If the file is smaller, <b>genisoimage</b> will write\npadding. This may take awhile.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">The option\n<b>-stream-media-size</b> creates simple ISO9660 filesystems\nonly and may not used together with multisession or hybrid\nfilesystem options.</p>\n\n<p style=\"margin-left:11%;\"><b>-stream-file-name</b>\n<i>name</i></p>\n\n<p style=\"margin-left:22%;\">Reserved for future use.</p>\n\n<p style=\"margin-left:11%;\"><b>-sunx86-boot</b>\n<i>UFS_img,,,AUX1_img</i></p>\n\n<p style=\"margin-left:22%;\">Specifies a comma-separated\nlist of filesystem images that are needed to make a bootable\nCD for Solaris x86 systems.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">Note that\npartition 1 is used for the ISO9660 image and that partition\n2 is the whole disk, so partition 1 and 2 may not be used by\nexternal partition data. The first image file is mapped to\npartition 0. There may be empty fields in the\ncomma-separated list, and list entries for partition 1 and 2\nmust be empty. The maximum number of supported partitions is\n8 (although the Solaris x86 partition table could support up\nto 16 partitions), so it is impossible to specify more than\n6 partition images. This option is required to make a\nbootable CD for Solaris x86 systems.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">If\n<b>-sunx86-boot</b> has been specified, the first sector of\nthe resulting image will contain a PC fdisk label with a\nSolaris type 0x82 fdisk partition that starts at offset 512\nand spans the whole CD. In addition, for the Solaris type\n0x82 fdisk partition, there is a SVr4 disk label at offset\n1024 in the first sector of the CD. This disk label\nspecifies slice 0 for the first (usually UFS type)\nfilesystem image that is used to boot the PC and slice 1 for\nthe ISO9660 image. Slice 2 spans the whole CD slice 3 ...\nslice 7 may be used for additional filesystem images that\nhave been specified with this option.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">A Solaris x86\nboot CD uses a 1024 byte sized primary boot that uses the\n<b>El-Torito no-emulation</b> boot mode and a secondary\ngeneric boot that is in CD sectors 1..15. For this reason,\nboth <b>-b</b> <i>bootimage</i> <b>-no-emul-boot</b> and\n<b>-G</b> <i>genboot</i> must be specified.</p>\n\n<p style=\"margin-left:11%;\"><b>-sunx86-label</b>\n<i>label</i></p>\n\n<p style=\"margin-left:22%;\">Set the SVr4 disk label name\nfor the SVr4 disk label that is created with\n<b>-sunx86-boot</b>.</p>\n\n<p style=\"margin-left:11%;\"><b>-sysid</b> <i>ID</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the system ID. There\nis space for 32 characters. Equivalent to <b>SYSI</b> in the\n<i>.genisoimagerc</i> file.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p><b>-T</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"78%\">\n\n\n<p>Generate a file <i>TRANS.TBL</i> in each directory on\nthe CD-ROM, which can be used on non-Rock&nbsp;Ridge-capable\nsystems to help establish the correct filenames. There is\nalso information present in the file that indicates the\nmajor and minor numbers for block and character devices, and\neach symlink has the name of the link file given.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-table-name</b>\n<i>table_name</i></p>\n\n<p style=\"margin-left:22%;\">Alternative translation table\nfilename (see above). Implies <b>-T</b>. If you are creating\na multisession image you must use the same name as in the\nprevious session.</p>\n\n<p style=\"margin-left:11%;\"><b>-ucs-level</b>\n<i>level</i></p>\n\n<p style=\"margin-left:22%;\">Set Unicode conformance level\nin the Joliet SVD. The default level is 3. It may be set to\n1..3 using this option.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"6%\">\n\n\n<p><b>-udf</b></p></td>\n<td width=\"5%\"></td>\n<td width=\"78%\">\n\n\n<p>Include UDF filesystem support in the generated\nfilesystem image. UDF support is currently in alpha status\nand for this reason, it is not possible to create UDF-only\nimages. UDF data structures are currently coupled to the\nJoliet structures, so there are many pitfalls with the\ncurrent implementation. There is no UID/GID support, there\nis no POSIX permission support, there is no support for\nsymlinks. Note that UDF wastes the space from sector ~20 to\nsector 256 at the beginning of the disc in addition to the\nspace needed for real UDF data structures.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-uid</b> <i>uid</i></p>\n\n<p style=\"margin-left:22%;\">Overrides the uid read from the\nsource files to the value of <i>uid</i>. Specifying this\noption automatically enables Rock Ridge extensions.</p>\n\n<p style=\"margin-left:11%;\"><b>-use-fileversion</b></p>\n\n<p style=\"margin-left:22%;\">The option\n<b>-use-fileversion</b> allows <b>genisoimage</b> to use\nfile version numbers from the filesystem. If the option is\nnot specified, <b>genisoimage</b> creates a version number\nof 1 for all files. File versions are strings in the range\n<i>;1</i> to <i>;32767</i> This option is the default on\nVMS.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p><b>-U</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"78%\">\n\n\n<p>Allows &quot;untranslated&quot; filenames, completely\nviolating the ISO9660 standards described above. Enables the\nfollowing flags: <b>-d -l -N -allow-leading-dots\n-relaxed-filenames -allow-lowercase -allow-multidot\n-no-iso-translate</b>. Allows more than one &rsquo;.&rsquo;\ncharacter in the filename, as well as mixed-case filenames.\nThis is useful on HP-UX, where the built-in <i>cdfs</i>\nfilesystem does not recognize any extensions. Use with\nextreme caution.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-no-iso-translate</b></p>\n\n<p style=\"margin-left:22%;\">Do not translate the characters\n&rsquo;#&rsquo; and &rsquo;~&rsquo; which are invalid for\nISO9660 filenames. Although invalid, these characters are\noften used by Microsoft systems. <br>\nThis violates the ISO9660 standard, but it happens to work\non many systems. Use with caution.</p>\n\n<p style=\"margin-left:11%;\"><b>-V</b> <i>volid</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the volume ID (volume\nname or label) to be written into the master block. There is\nspace for 32 characters. Equivalent to <b>VOLI</b> in the\n<i>.genisoimagerc</i> file. The volume ID is used as the\nmount point by the Solaris volume manager and as a label\nassigned to a disc on various other platforms such as\nWindows and Apple Mac OS.</p>\n\n<p style=\"margin-left:11%;\"><b>-volset</b> <i>ID</i></p>\n\n<p style=\"margin-left:22%;\">Specifies the volume set ID.\nThere is space for 128 characters. Equivalent to <b>VOLS</b>\nin the <i>.genisoimagerc</i> file.</p>\n\n<p style=\"margin-left:11%;\"><b>-volset-size</b>\n<i>#</i></p>\n\n<p style=\"margin-left:22%;\">Sets the volume set size to #.\nThe volume set size is the number of CDs that are in a CD\nvolume set. A volume set is a collection of one or more\nvolumes, on which a set of files is recorded.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">Volume Sets are\nnot intended to be used to create a set numbered CDs that\nare part of e.g. a Operation System installation set of CDs.\nVolume Sets are rather used to record a big directory tree\nthat would not fit on a single volume. Each volume of a\nVolume Set contains a description of all the directories and\nfiles that are recorded on the volumes where the sequence\nnumbers are less than, or equal to, the assigned Volume Set\nSize of the current volume.</p>\n\n\n<p style=\"margin-left:22%; margin-top: 1em\"><b>genisoimage</b>\ncurrently does not support a <b>-volset-size</b> that is\nlarger than 1.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">The option\n<b>-volset-size</b> must be specified before\n<b>-volset-seqno</b> on each command line.</p>\n\n<p style=\"margin-left:11%;\"><b>-volset-seqno</b>\n<i>#</i></p>\n\n<p style=\"margin-left:22%;\">Sets the volume set sequence\nnumber to #. The volume set sequence number is the index\nnumber of the current CD in a CD set. The option\n<b>-volset-size</b> must be specified before\n<b>-volset-seqno</b> on each command line.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p><b>-v</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"78%\">\n\n\n<p>Verbose execution. If given twice on the command line,\nextra debug information will be printed.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-x</b> <i>glob</i></p>\n\n<p style=\"margin-left:22%;\">Identical to <b>-m</b>\n<i>glob</i>.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"3%\">\n\n\n<p><b>-z</b></p></td>\n<td width=\"8%\"></td>\n<td width=\"78%\">\n\n\n<p>Generate special <i>RRIP</i> records for transparently\ncompressed files. This is only of use and interest for hosts\nthat support transparent decompression, such as Linux 2.4.14\nor later. You must specify <b>-R</b> or <b>-r</b> to enable\nRock Ridge, and generate compressed files using the\n<b>mkzftree</b> utility before running <b>genisoimage</b>.\nNote that transparent compression is a nonstandard Rock\nRidge extension. The resulting disks are only transparently\nreadable if used on Linux. On other operating systems you\nwill need to call <b>mkzftree</b> by hand to decompress the\nfiles.</p> </td></tr>\n</table>\n\n<h2>HFS OPTIONS\n<a name=\"HFS OPTIONS\"></a>\n</h2>\n\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p style=\"margin-top: 1em\"><b>-hfs</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p style=\"margin-top: 1em\">Create an ISO9660/HFS hybrid CD.\nThis option should be used in conjunction with the\n<b>-map</b>, <b>-magic</b> and/or the various <i>double\ndash</i> options given below.</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>-apple</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>Create an ISO9660 CD with Apple&rsquo;s extensions.\nSimilar to <b>-hfs</b>, except that the Apple Extensions to\nISO9660 are added instead of creating an HFS hybrid volume.\nFormer <b>genisoimage</b> versions did include Rock Ridge\nattributes by default if <b>-apple</b> was specified. This\nversions of <b>genisoimage</b> does not do this anymore. If\nyou like to have Rock Ridge attributes, you need to specify\nthis separately.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-map</b>\n<i>mapping_file</i></p>\n\n<p style=\"margin-left:22%;\">Use the <i>mapping_file</i> to\nset the CREATOR and TYPE information for a file based on the\nfilename&rsquo;s extension. A filename is mapped only if it\nis not one of the know Apple/Unix file formats. See the\n<b>HFS CREATOR/TYPE</b> section below.</p>\n\n<p style=\"margin-left:11%;\"><b>-magic</b>\n<i>magic_file</i></p>\n\n<p style=\"margin-left:22%;\">The CREATOR and TYPE\ninformation is set by using a file&rsquo;s <i>magic\nnumber</i> (usually the first few bytes of a file). The\n<i>magic_file</i> is only used if a file is not one of the\nknown Apple/Unix file formats, or the filename extension has\nnot been mapped using <b>-map</b>. See the <b>HFS\nCREATOR/TYPE</b> section below for more details.</p>\n\n<p style=\"margin-left:11%;\"><b>-hfs-creator</b>\n<i>creator</i></p>\n\n<p style=\"margin-left:22%;\">Set the default CREATOR for all\nfiles. Must be exactly 4 characters. See the <b>HFS\nCREATOR/TYPE</b> section below for more details.</p>\n\n<p style=\"margin-left:11%;\"><b>-hfs-type</b>\n<i>type</i></p>\n\n<p style=\"margin-left:22%;\">Set the default TYPE for all\nfiles. Must be exactly 4 characters. See the <b>HFS\nCREATOR/TYPE</b> section below for more details.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>-probe</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>Search the contents of files for all the known\nApple/Unix file formats. See the <b>HFS MACINTOSH FILE\nFORMATS</b> section below for more about these formats.\nHowever, the only way to check for <i>MacBinary</i> and\n<i>AppleSingle</i> files is to open and read them, so this\noption may increase processing time. It is better to use one\nor more <i>double dash</i> options given below if the\nApple/Unix formats in use are known.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-no-desktop</b></p>\n\n<p style=\"margin-left:22%;\">Do not create (empty) Desktop\nfiles. New HFS Desktop files will be created when the CD is\nused on a Macintosh (and stored in the System Folder). By\ndefault, empty Desktop files are added to the HFS\nvolume.</p>\n\n<p style=\"margin-left:11%;\"><b>-mac-name</b></p>\n\n<p style=\"margin-left:22%;\">Use the HFS filename as the\nstarting point for the ISO9660, Joliet and Rock Ridge\nfilenames. See the <b>HFS MACINTOSH FILENAMES</b> section\nbelow for more information.</p>\n\n<p style=\"margin-left:11%;\"><b>-boot-hfs-file</b>\n<i>driver_file</i></p>\n\n<p style=\"margin-left:22%;\">Installs the <i>driver_file</i>\nthat <i>may</i> make the CD bootable on a Macintosh. See the\n<b>HFS BOOT DRIVER</b> section below. (Alpha).</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p><b>-part</b></p></td>\n<td width=\"4%\"></td>\n<td width=\"78%\">\n\n\n<p>Generate an HFS partition table. By default, no\npartition table is generated, but some older Macintosh\nCD-ROM drivers need an HFS partition table on the CD-ROM to\nbe able to recognize a hybrid CD-ROM.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>-auto</b>\n<i>AutoStart_file</i></p>\n\n<p style=\"margin-left:22%;\">Make the HFS CD use the\nQuickTime 2.0 Autostart feature to launch an application or\ndocument. The given filename must be the name of a document\nor application located at the top level of the CD. The\nfilename must be less than 12 characters. (Alpha).</p>\n\n<p style=\"margin-left:11%;\"><b>-cluster-size</b>\n<i>size</i></p>\n\n<p style=\"margin-left:22%;\">Set the size in bytes of the\ncluster or allocation units of PC Exchange files. Implies\n<b>--exchange</b>. See the <b>HFS MACINTOSH FILE FORMATS</b>\nsection below.</p>\n\n<p style=\"margin-left:11%;\"><b>-hide-hfs</b>\n<i>glob</i></p>\n\n<p style=\"margin-left:22%;\">Hide <i>glob</i>, a shell\nwildcard pattern, from the HFS volume. The file or directory\nwill still exist in the ISO9660 and/or Joliet directory.\n<i>glob</i> may match any part of the filename. Multiple\nglobs may be excluded. Example:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">genisoimage -o\nrom -hfs -hide-hfs '*.o' -hide-hfs foobar</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">would exclude\nall files ending in &rsquo;.o&rsquo; or called <i>foobar</i>\nfrom the HFS volume. Note that if you had a directory called\n<i>foobar</i>, it too (and of course all its descendants)\nwould be excluded. The <i>glob</i> can also be a path name\nrelative to the source directories given on the command\nline. Example:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">genisoimage -o\nrom -hfs -hide-hfs src/html src</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">would exclude\njust the file or directory called <i>html</i> from the\n<i>src</i> directory. Any other file or directory called\n<i>html</i> in the tree will not be excluded. Should be used\nwith <b>-hide</b> and/or <b>-hide-joliet</b>. In order to\nmatch a directory name, make sure the pattern does not\ninclude a trailing &rsquo;/&rsquo; character. See\n<i>README.hide</i> for more details.</p>\n\n<p style=\"margin-left:11%;\"><b>-hide-hfs-list</b>\n<i>file</i></p>\n\n<p style=\"margin-left:22%;\">Specify a file containing a\nlist of wildcard patterns to be hidden as in\n<b>-hide-hfs</b>.</p>\n\n<p style=\"margin-left:11%;\"><b>-hfs-volid</b>\n<i>hfs_volid</i></p>\n\n<p style=\"margin-left:22%;\">Volume name for the HFS\npartition. This is the name that is assigned to the disc on\na Macintosh and replaces the <i>volid</i> used with\n<b>-V</b>.</p>\n\n<p style=\"margin-left:11%;\"><b>-icon-position</b></p>\n\n<p style=\"margin-left:22%;\">Use the icon position\ninformation, if it exists, from the Apple/Unix file. The\nicons will appear in the same position as they would on a\nMacintosh desktop. Folder location and size on screen, its\nscroll positions, folder View (view as Icons, Small Icons,\netc.) are also preserved. (Alpha).</p>\n\n<p style=\"margin-left:11%;\"><b>-root-info</b>\n<i>file</i></p>\n\n<p style=\"margin-left:22%;\">Set the location, size on\nscreen, scroll positions, folder View etc. for the root\nfolder of an HFS volume. See <i>README.rootinfo</i> for more\ninformation. (Alpha)</p>\n\n<p style=\"margin-left:11%;\"><b>-prep-boot</b>\n<i>file</i></p>\n\n<p style=\"margin-left:22%;\">PReP boot image file. Up to 4\nare allowed. See <i>README.prep_boot</i> for more\ninformation. (Alpha)</p>\n\n<p style=\"margin-left:11%;\"><b>-chrp-boot</b></p>\n\n<p style=\"margin-left:22%;\">Add CHRP boot header.</p>\n\n<p style=\"margin-left:11%;\"><b>-input-hfs-charset</b>\n<i>charset</i></p>\n\n<p style=\"margin-left:22%;\">Input charset that defines the\ncharacters used in HFS filenames when used with\n<b>-mac-name</b>. The default charset is <i>cp10000</i> (Mac\nRoman). See the <b>CHARACTER SETS</b> and <b>HFS MACINTOSH\nFILENAMES</b> sections below for more details.</p>\n\n<p style=\"margin-left:11%;\"><b>-output-hfs-charset</b>\n<i>charset</i></p>\n\n<p style=\"margin-left:22%;\">Output charset that defines the\ncharacters that will be used in the HFS filenames. Defaults\nto the input charset. See the <b>CHARACTER SETS</b> section\nbelow for more details.</p>\n\n<p style=\"margin-left:11%;\"><b>-hfs-unlock</b></p>\n\n<p style=\"margin-left:22%;\">By default, <b>genisoimage</b>\nwill create an HFS volume that is locked. This option leaves\nthe volume unlocked so that other applications (e.g.\n<b>hfsutils</b>) can modify the volume. See the <b>HFS\nPROBLEMS/LIMITATIONS</b> section below for warnings about\nusing this option.</p>\n\n<p style=\"margin-left:11%;\"><b>-hfs-bless</b>\n<i>folder_name</i></p>\n\n<p style=\"margin-left:22%;\">&quot;Bless&quot; the given\ndirectory (folder). This is usually the <i>System Folder</i>\nand is used in creating HFS bootable CDs. The name of the\ndirectory must be the whole path name as <b>genisoimage</b>\nsees it. E.g., if the given pathspec is <i>./cddata</i> and\nthe required folder is called <i>System Folder</i>, the\nwhole path name is <i>&quot;/cddata/System Folder&quot;</i>\n(remember to use quotes if the name contains spaces).</p>\n\n<p style=\"margin-left:11%;\"><b>-hfs-parms</b>\n<i>parameters</i></p>\n\n<p style=\"margin-left:22%;\">Override certain parameters\nused to create the HFS filesystem. Unlikely to be used in\nnormal circumstances. See the <i>libhfs_iso/hybrid.h</i>\nsource file for details.</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p><b>--cap</b></p></td>\n<td width=\"4%\"></td>\n<td width=\"78%\">\n\n\n<p>Look for AUFS CAP Macintosh files. Search for CAP\nApple/Unix file formats only. Searching for the other\npossible Apple/Unix file formats is disabled, unless other\n<i>double dash</i> options are given.</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>--netatalk</b></p>\n\n<p style=\"margin-left:22%;\">Look for NETATALK Macintosh\nfiles</p>\n\n<p style=\"margin-left:11%;\"><b>--double</b></p>\n\n<p style=\"margin-left:22%;\">Look for AppleDouble Macintosh\nfiles</p>\n\n<p style=\"margin-left:11%;\"><b>--ethershare</b></p>\n\n<p style=\"margin-left:22%;\">Look for Helios EtherShare\nMacintosh files</p>\n\n<p style=\"margin-left:11%;\"><b>--ushare</b></p>\n\n<p style=\"margin-left:22%;\">Look for IPT UShare Macintosh\nfiles</p>\n\n<p style=\"margin-left:11%;\"><b>--exchange</b></p>\n\n<p style=\"margin-left:22%;\">Look for PC Exchange Macintosh\nfiles</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"7%\">\n\n\n<p><b>--sgi</b></p></td>\n<td width=\"4%\"></td>\n<td width=\"43%\">\n\n\n<p>Look for SGI Macintosh files</p></td>\n<td width=\"35%\">\n</td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>--xinet</b></p>\n\n<p style=\"margin-left:22%;\">Look for XINET Macintosh\nfiles</p>\n\n<p style=\"margin-left:11%;\"><b>--macbin</b></p>\n\n<p style=\"margin-left:22%;\">Look for MacBinary Macintosh\nfiles</p>\n\n<p style=\"margin-left:11%;\"><b>--single</b></p>\n\n<p style=\"margin-left:22%;\">Look for AppleSingle Macintosh\nfiles</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>--dave</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>Look for Thursby Software Systems DAVE Macintosh\nfiles</p> </td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"11%\"></td>\n<td width=\"9%\">\n\n\n<p><b>--sfm</b></p></td>\n<td width=\"2%\"></td>\n<td width=\"78%\">\n\n\n<p>Look for Microsoft&rsquo;s Services for Macintosh files\n(NT only) (Alpha)</p></td></tr>\n</table>\n\n<p style=\"margin-left:11%;\"><b>--osx-double</b></p>\n\n<p style=\"margin-left:22%;\">Look for Mac OS X AppleDouble\nMacintosh files</p>\n\n<p style=\"margin-left:11%;\"><b>--osx-hfs</b></p>\n\n<p style=\"margin-left:22%;\">Look for Mac OS X HFS Macintosh\nfiles</p>\n\n<h2>CHARACTER SETS\n<a name=\"CHARACTER SETS\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>genisoimage</b>\nprocesses filenames in a POSIX-compliant way as strings of\n8-bit characters. To represent all codings for all\nlanguages, 8-bit characters are not sufficient. Unicode or\nISO-10646 define character codings that need at least 21\nbits to represent all known languages. They may be\nrepresented with <i>UTF-32</i>, <i>UTF-16</i> or\n<i>UTF-8</i> coding. UTF-32 uses a plain 32-bit coding but\nseems to be uncommon. UTF-16 is used by Microsoft with Win32\nwith the disadvantage that 16-bit characters are not\ncompliant with the POSIX filesystem interface.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Modern Unix\noperating systems may use UTF-8 coding for filenames. Each\n32-bit character is represented by one or more 8-bit\ncharacters. If a character is coded in <i>ISO-8859-1</i>\n(used in Central Europe and North America) is maps 1:1 to a\nUTF-32 or UTF-16 coded Unicode character. If a character is\ncoded in <i>7-Bit ASCII</i> (used in USA and other countries\nwith limited character set) is maps 1:1 to a UTF-32, UTF-16\nor UTF-8 coded Unicode character. Character codes that\ncannot be represented as a single byte in UTF-8 (if the\nvalue is &gt; 0x7F) use escape sequences that map to more\nthan one 8-bit character.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If all\noperating systems used UTF-8, <b>genisoimage</b> would not\nneed to recode characters in filenames. Unfortunately, Apple\nuses completely nonstandard codings and Microsoft uses a\nUnicode coding that is not compatible with the POSIX\nfilename interface.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">For all\nnon-UTF-8-coded operating systems, the actual character that\neach byte represents depends on the <i>character set</i> or\n<i>codepage</i> (the name used by Microsoft) used by the\nlocal operating system &mdash; the characters in a character\nset will reflect the region or natural language set by the\nuser.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Usually\ncharacter codes 0x00-0x1f are control characters, codes\n0x20-0x7f are the 7-bit ASCII characters and (on PCs and\nMacs) 0x80-0xff are used for other characters.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">As there are a\nlot more than 256 characters/symbols in use, only a small\nsubset are represented in a character set. Therefore the\nsame character code may represent a different character in\ndifferent character sets. So a filename generated, say in\ncentral Europe, may not display the same character when\nviewed on a machine in, say eastern Europe.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To make matters\nmore complicated, different operating systems use different\ncharacter sets for the region or language. For example, the\ncharacter code for &rsquo;&eacute;&rsquo; (small e with\nacute accent) may be character code 0x82 on a PC, code 0x8e\non a Macintosh, code 0xe9 on a Unix system in western\nEurope, and code 0x000e9 in Unicode.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">As long as not\nall operating systems and applications use the same\ncharacter set as the basis for filenames, it may be\nnecessary to specify which character set your filenames use\nin and which character set the filenames should appear on\nthe CD.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">There are four\noptions to specify the character sets you want to use:\n<b><br>\n-input-charset</b></p>\n\n<p style=\"margin-left:22%;\">Defines the local character set\nyou are using on your host machine. Any character set\nconversions that take place will use this character set as\nthe starting point. The default input character sets are\n<i>cp437</i> on MS-DOS-based systems and <i>iso8859-1</i> on\nall other systems. If <b>-J</b> is given, the Unicode\nequivalents of the input character set will be used in the\nJoliet directory. <b>-jcharset</b> is the same as\n<b>-input-charset -J</b>.</p>\n\n<p style=\"margin-left:11%;\"><b>-output-charset</b></p>\n\n<p style=\"margin-left:22%;\">Defines the character set that\nwill be used with for the Rock Ridge names on the CD.\nDefaults to the input character set.</p>\n\n<p style=\"margin-left:11%;\"><b>-input-hfs-charset</b></p>\n\n<p style=\"margin-left:22%;\">Defines the HFS character set\nused for HFS filenames decoded from any of the various\nApple/Unix file formats. Only useful when used with\n<b>-mac-name</b>. See the <b>HFS MACINTOSH FILENAMES</b> for\nmore information. Defaults to <i>cp10000</i> (Mac\nRoman).</p>\n\n<p style=\"margin-left:11%;\"><b>-output-hfs-charset</b></p>\n\n<p style=\"margin-left:22%;\">Defines the HFS character set\nused to create HFS filenames from the input character set in\nuse. In most cases this will be from the character set given\nwith <b>-input-charset</b>. Defaults to the input HFS\ncharacter set.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">There are a\nnumber of character sets built in to <b>genisoimage</b>. To\nget a listing, use <b>-input-charset help</b>. This list\ndoesn&rsquo;t include the charset derived from the current\nlocale, if <b>genisoimage</b> is built with <i>iconv</i>\nsupport.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Additional\ncharacter sets can be read from file for any of the\ncharacter set options by giving a filename as the argument\nto the options. The given file will only be read if its name\ndoes not match one of the built-in character sets.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The format of\nthe character set files is the same as the mapping files\navailable from\n<i>http://www.unicode.org/Public/MAPPINGS</i>. This format\nis:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">Column #1 is\nthe input byte code (in hex as 0xXX) <br>\nColumn #2 is the Unicode (in hex as 0xXXXX) <br>\nThe rest of the line is ignored.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Any blank line,\nline without two (or more) columns in the above format or\ncomments lines (starting with the # character) are ignored\nwithout any warnings. Any missing input code is mapped to\nUnicode character 0x0000.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Note that,\nwhile UTF-8 is supported, other Unicode encodings such as\nUCS-2/UTF-16 and UCS-4/UTF-32 are not, as POSIX operating\nsystems cannot handle them natively.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A 1:1 character\nset mapping can be defined by using the keyword\n<i>default</i> as the argument to any of the character set\noptions. This is the behaviour of old versions of\n<b>mkisofs</b>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The ISO9660\nfilenames generated from the input filenames are not\nconverted from the input character set. The ISO9660\ncharacter set is a very limited subset of the ASCII\ncharacters, so any conversion would be pointless.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Any character\nthat <b>genisoimage</b> cannot convert will be replaced with\na &rsquo;_&rsquo; character.</p>\n\n<h2>HFS CREATOR/TYPE\n<a name=\"HFS CREATOR/TYPE\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">A Macintosh\nfile has two properties associated with it which define\nwhich application created the file, the <i>CREATOR</i> and\nwhat data the file contains, the <i>TYPE</i>. Both are\n(exactly) 4 letter strings. Usually this allows a Macintosh\nuser to double-click on a file and launch the correct\napplication etc. The CREATOR and TYPE of a particular file\ncan be found by using something like ResEdit (or similar) on\na Macintosh.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The CREATOR and\nTYPE information is stored in all the various Apple/Unix\nencoded files. For other files it is possible to base the\nCREATOR and TYPE on the filename&rsquo;s extension using a\n<i>mapping</i> file (with <b>-map</b>) and/or using the\n<i>magic number</i> (usually a <i>signature</i> in the first\nfew bytes) of a file (with <b>-magic</b>). If both these\noptions are given, their order on the command line is\nsignificant. If <b>-map</b> is given first, a filename\nextension match is attempted before a magic number match.\nHowever, if <b>-magic</b> is given first, a magic number\nmatch is attempted before a filename extension match.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If a mapping or\nmagic file is not used, or no match is found, the default\nCREATOR and TYPE for all regular files can be set by using\nentries in the <i>.genisoimagerc</i> file or using\n<b>-hfs-creator</b> and/or <b>-hfs-type</b>, otherwise the\ndefault CREATOR and TYPE are <i>Unix</i> and\n<i>TEXT</i>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The format of\nthe <i>mapping</i> file is the same <i>afpfile</i> format as\nused by <b>aufs</b>. This file has five columns for the\n<i>extension</i>, <i>file translation</i>, <i>CREATOR</i>,\n<i>TYPE</i> and <i>Comment</i>. Lines starting with the\n&rsquo;#&rsquo; character are comment lines and are ignored.\nAn example file would be like:</p>\n\n\n<p align=\"center\" style=\"margin-top: 1em\"><img src=\"grohtml-1318901.png\" alt=\"Image grohtml-1318901.png\"></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Where:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">The first\ncolumn <i>EXTN</i> defines the Unix filename extension to be\nmapped. The default mapping for any filename extension that\ndoesn&rsquo;t match is defined with the &rsquo;*&rsquo;\ncharacter.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">The\n<i>Xlate</i> column defines the type of text translation\nbetween the Unix and Macintosh file it is ignored by\n<b>genisoimage</b>, but is kept to be compatible with\n<a href=\"https://man.page/1/aufs\">aufs(1)</a>. Although <b>genisoimage</b> does not alter\nthe contents of a file, if a binary file has its TYPE set as\n<i>TEXT</i>, it <i>may</i> be read incorrectly on a\nMacintosh. Therefore a better choice for the default TYPE\nmay be <i>????</i>.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">The\n<i>CREATOR</i> and <i>TYPE</i> keywords must be 4 characters\nlong and enclosed in single quotes.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">The comment\nfield is enclosed in double quotes &mdash; it is ignored by\n<b>genisoimage</b>, but is kept to be compatible with\n<b>aufs</b>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The format of\nthe <i>magic</i> file is almost identical to the\n<a href=\"https://man.page/5/magic\">magic(5)</a> file used by the <a href=\"https://man.page/1/file\">file(1)</a> command.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">This file has\nfour tab-separated columns for the <i>byte offset</i>,\n<i>type</i>, <i>test</i> and <i>message</i>. Lines starting\nwith the &rsquo;#&rsquo; character are comment lines and are\nignored. An example file would be like:</p>\n\n\n<p align=\"center\" style=\"margin-top: 1em\"><img src=\"grohtml-1318902.png\" alt=\"Image grohtml-1318902.png\"></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The format of\nthe file is described in <a href=\"https://man.page/5/magic\">magic(5)</a>. The only\ndifference here is that for each entry in the magic file,\nthe <i>message</i> for the initial offset must be be 4\ncharacters for the CREATOR followed by 4 characters for the\nTYPE &mdash; white space is optional between them. Any other\ncharacters on this line are ignored. Continuation lines\n(starting with a &rsquo;&gt;&rsquo;) are also ignored, i.e.,\nonly the initial offset lines are used.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Using\n<b>-magic</b> may significantly increase processing time as\neach file has to opened and read to find its magic\nnumber.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">In summary, for\nall files, the default CREATOR is <i>Unix</i> and the\ndefault TYPE is <i>TEXT</i>. These can be changed by using\nentries in the <i>.genisoimagerc</i> file or by using\n<b>-hfs-creator</b> and/or <b>-hfs-type</b>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If the a file\nis in one of the known Apple/Unix formats (and the format\nhas been selected), the CREATOR and TYPE are taken from the\nvalues stored in the Apple/Unix file.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Other files can\nhave their CREATOR and TYPE set from their filename\nextension (with <b>-map</b>), or their magic number (with\n<b>-magic</b>). If the default match is used in the\n<i>mapping</i> file, these values override the default\nCREATOR and TYPE.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A full\nCREATOR/TYPE database can be found at\n<i>http://www.angelfire.com/il/szekely/</i>.</p>\n\n<h2>HFS MACINTOSH FILE FORMATS\n<a name=\"HFS MACINTOSH FILE FORMATS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Macintosh files\nhave two parts called the <i>Data</i> and <i>Resource\nfork</i>. Either may be empty. Unix (and many other OSs) can\nonly cope with files having one part (or fork). To add to\nthis, Macintosh files have a number of attributes associated\nwith them &mdash; probably the most important are the TYPE\nand CREATOR. Again, Unix has no concept of these types of\nattributes.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">E.g., a\nMacintosh file may be a JPEG image where the image is stored\nin the Data fork and a desktop thumbnail stored in the\nResource fork. It is usually the information in the data\nfork that is useful across platforms.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Therefore to\nstore a Macintosh file on a Unix filesystem, a way has to be\nfound to cope with the two forks and the extra attributes\n(which are referred to as the <i>Finder info</i>).\nUnfortunately, it seems that every software package that\nstores Macintosh files on Unix has chosen a completely\ndifferent storage method.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The Apple/Unix\nformats that <b>genisoimage</b> (partially) supports are:\n<br>\nCAP AUFS format</p>\n\n<p style=\"margin-left:22%;\">Data fork stored in a file.\nResource fork in subdirectory <i>.resource</i> with same\nfilename as data fork. Finder info in subdirectory\n<i>.finderinfo</i> with same filename.</p>\n\n<p style=\"margin-left:11%;\">AppleDouble/Netatalk</p>\n\n<p style=\"margin-left:22%;\">Data fork stored in a file.\nResource fork stored in a file with same name prefixed with\n&rsquo;%&rsquo;. Finder info also stored in same\n&rsquo;%&rsquo; file. Netatalk uses the same format, but the\nresource fork/Finder info stored in subdirectory\n<i>.AppleDouble</i> with same filename as data fork.</p>\n\n<p style=\"margin-left:11%;\">AppleSingle</p>\n\n<p style=\"margin-left:22%;\">Data structures similar to\nabove, except both forks and Finder info are stored in one\nfile.</p>\n\n<p style=\"margin-left:11%;\">Helios EtherShare</p>\n\n<p style=\"margin-left:22%;\">Data fork stored in a file.\nResource fork and Finder info together in subdirectory\n<i>.rsrc</i> with same filename as data fork.</p>\n\n<p style=\"margin-left:11%;\">IPT UShare</p>\n\n<p style=\"margin-left:22%;\">Like the EtherShare format, but\nthe Finder info is stored slightly differently.</p>\n\n<p style=\"margin-left:11%;\">MacBinary</p>\n\n<p style=\"margin-left:22%;\">Both forks and Finder info\nstored in one file.</p>\n\n<p style=\"margin-left:11%;\">Apple PC Exchange</p>\n\n<p style=\"margin-left:22%;\">Used by Macintoshes to store\nApple files on DOS (FAT) disks. Data fork stored in a file.\nResource fork in subdirectory <i>resource.frk</i> (or\n<i>RESOURCE.FRK</i>). Finder info as one record in file\n<i>finder.dat</i> (or <i>FINDER.DAT</i>). Separate\n<i>finder.dat</i> for each data fork directory.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">Note:\n<b>genisoimage</b> needs to know the native FAT cluster size\nof the disk that the PC Exchange files are on (or have been\ncopied from). This size is given by <b>-cluster-size</b>.\nThe cluster or allocation size can be found by using the DOS\nutility <b>chkdsk</b>.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">May not work\nwith PC Exchange v2.2 or higher files (available with MacOS\n8.1). DOS media containing PC Exchange files should be\nmounted as type <i>msdos</i> (not <i>vfat</i>) when using\nLinux.</p>\n\n<p style=\"margin-left:11%;\">SGI/XINET</p>\n\n<p style=\"margin-left:22%;\">Used by SGI machines when they\nmount HFS disks. Data fork stored in a file. Resource fork\nin subdirectory <i>.HSResource</i> with same filename.\nFinder info as one record in file <i>.HSancillary</i>.\nSeparate <i>.HSancillary</i> for each data fork\ndirectory.</p>\n\n<p style=\"margin-left:11%;\">Thursby Software Systems\nDAVE</p>\n\n<p style=\"margin-left:22%;\">Allows Macintoshes to store\nApple files on SMB servers. Data fork stored in a file.\nResource fork in subdirectory <i>resource.frk</i>. Uses the\nAppleDouble format to store resource fork.</p>\n\n<p style=\"margin-left:11%;\">Services for Macintosh</p>\n\n<p style=\"margin-left:22%;\">Format of files stored by NT\nServers on NTFS filesystems. Data fork is stored as\n<i>filename</i>. Resource fork stored as a NTFS stream\ncalled <i>filename:AFP_Resource</i>. The Finder info is\nstored as a NTFS stream called <i>filename:Afp_AfpInfo</i>.\nNTFS streams are normally invisible to the user.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">Warning:\n<b>genisoimage</b> only partially supports the SFM format.\nIf an HFS file or folder stored on the NT server contains an\nillegal NT character in its name, NT converts these\ncharacters to <i>Private Use Unicode</i> characters. The\ncharacters are: &quot; * / &lt; &gt; ? \\ | and a space or\nperiod if it is the last character of the filename,\ncharacter codes 0x01 to 0x1f (control characters) and\nApple&rsquo;s apple logo.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">Unfortunately,\nthese private Unicode characters are not readable by the\n<b>genisoimage</b> NT executable. Therefore any file or\ndirectory name containing these characters will be ignored\n&mdash; including the contents of any such directory.</p>\n\n<p style=\"margin-left:11%;\">Mac OS X AppleDouble</p>\n\n<p style=\"margin-left:22%;\">When HFS/HFS+ files are copied\nor saved by Mac OS X on to a non-HFS filesystem (e.g. UFS,\nNFS etc.), the files are stored in AppleDouble format. Data\nfork stored in a file. Resource fork stored in a file with\nsame name prefixed with &rsquo;._&rsquo;. Finder info also\nstored in same &rsquo;._&rsquo; file.</p>\n\n<p style=\"margin-left:11%;\">Mac OS X HFS (Alpha)</p>\n\n<p style=\"margin-left:22%;\">Not really an Apple/Unix\nencoding, but actual HFS/HFS+ files on a Mac&nbsp;OS&nbsp;X\nsystem. Data fork stored in a file. Resource fork stored in\na pseudo file with the same name with the suffix\n<i>/rsrc</i>. The Finder info is only available via a Mac OS\nX library call.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">See also\n<i>README.macosx</i>.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">Only works when\nused on Mac OS X.</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">If a file is\nfound with a zero length resource fork and empty finderinfo,\nit is assumed not to have any Apple/Unix encoding &mdash;\ntherefore a TYPE and CREATOR can be set using other\nmethods.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>genisoimage</b>\nwill attempt to set the CREATOR, TYPE, date and possibly\nother flags from the finder info. Additionally, if it\nexists, the Macintosh filename is set from the finder info,\notherwise the Macintosh name is based on the Unix filename\n&mdash; see the <b>HFS MACINTOSH FILENAMES</b> section\nbelow.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">When using\n<b>-apple</b>, the TYPE and CREATOR are stored in the\noptional System Use or <i>SUSP</i> field in the ISO9660\nDirectory Record &mdash; in much the same way as the Rock\nRidge attributes are. In fact to make life easy, the Apple\nextensions are added at the beginning of the existing Rock\nRidge attributes (i.e., to get the Apple extensions you get\nthe Rock Ridge extensions as well).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The Apple\nextensions require the resource fork to be stored as an\nISO9660 <i>associated</i> file. This is just like any normal\nfile stored in the ISO9660 filesystem except that the\nassociated file flag is set in the Directory Record (bit 2).\nThis file has the same name as the data fork (the file seen\nby non-Apple machines). Associated files are normally\nignored by other OSs</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">When using\n<b>-hfs</b>, the TYPE and CREATOR plus other finder info,\nare stored in a separate HFS directory, not visible on the\nISO9660 volume. The HFS directory references the same data\nand resource fork files described above.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">In most cases,\nit is better to use <b>-hfs</b> instead of <b>-apple</b>, as\nthe latter imposes the limited ISO9660 characters allowed in\nfilenames. However, the Apple extensions do give the\nadvantage that the files are packed on the disk more\nefficiently and it may be possible to fit more files on a\nCD.</p>\n\n<h2>HFS MACINTOSH FILENAMES\n<a name=\"HFS MACINTOSH FILENAMES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Where possible,\nthe HFS filename that is stored with an Apple/Unix file is\nused for the HFS part of the CD. However, not all the\nApple/Unix encodings store the HFS filename with the\nfinderinfo. In these cases, the Unix filename is used\n&mdash; with escaped special characters. Special characters\ninclude &rsquo;/&rsquo; and characters with codes over\n127.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">AUFS escapes\nthese characters by using &rsquo;:&rsquo; followed by the\ncharacter code as two hex digits. Netatalk and EtherShare\nhave a similar scheme, but uses &rsquo;%&rsquo; instead of a\n&rsquo;:&rsquo;.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If\n<b>genisoimage</b> cannot find an HFS filename, it uses the\nUnix name, with any <i>%xx</i> or <i>:xx</i> characters\n(<i>xx</i> are two hex digits) converted to a single\ncharacter code. If <i>xx</i> are not hex digits\n([0-9a-fA-F]), they are left alone &mdash; although any\nremaining &rsquo;:&rsquo; is converted to &rsquo;%&rsquo;,\nas &rsquo;:&rsquo; is the HFS directory separator. Care must\nbe taken, as an ordinary Unix file with <i>%xx</i> or\n<i>:xx</i> will also be converted. e.g.</p>\n\n\n<p align=\"center\" style=\"margin-top: 1em\"><img src=\"grohtml-1318903.png\" alt=\"Image grohtml-1318903.png\"></p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Although HFS\nfilenames appear to support uppercase and lowercase letters,\nthe filesystem is case-insensitive, i.e., the filenames\n<i>aBc</i> and <i>AbC</i> are the same. If a file is found\nin a directory with the same HFS name, <b>genisoimage</b>\nwill attempt to make a unique name by adding &rsquo;_&rsquo;\ncharacters to one of the filenames.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If an HFS\nfilename exists for a file, <b>genisoimage</b> can use this\nname as the starting point for the ISO9660, Joliet and Rock\nRidge filenames using <b>-mac-name</b>. Normal Unix files\nwithout an HFS name will still use their Unix name. e.g.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If a MacBinary\n(or PC Exchange) file is stored as <i>someimage.gif.bin</i>\non the Unix filesystem, but contains a HFS file called\n<i>someimage.gif</i>, this is the name that would appear on\nthe HFS part of the CD. However, as <b>genisoimage</b> uses\nthe Unix name as the starting point for the other names, the\nISO9660 name generated will probably be <i>SOMEIMAG.BIN</i>\nand the Joliet/Rock Ridge would be <i>someimage.gif.bin</i>.\nThis option will use the HFS filename as the starting point\nand the ISO9660 name will probably be <i>SOMEIMAG.GIF</i>\nand the Joliet/Rock Ridge would be <i>someimage.gif</i>.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>-mac-name</b>\nwill not currently work with <b>-T</b> &mdash; the Unix name\nwill be used in the <i>TRANS.TBL</i> file, not the Macintosh\nname.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The character\nset used to convert any HFS filename to a Joliet/Rock Ridge\nfilename defaults to <i>cp10000</i> (Mac Roman). The\ncharacter set used can be specified using\n<b>-input-hfs-charset</b>. Other built-in HFS character sets\nare: <i>cp10006</i> (MacGreek), <i>cp10007</i>\n(MacCyrillic), <i>cp10029</i> (MacLatin2), <i>cp10079</i>\n(MacIcelandandic) and <i>cp10081</i> (MacTurkish).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Note: the\ncharacter codes used by HFS filenames taken from the various\nApple/Unix formats will not be converted as they are assumed\nto be in the correct Apple character set. Only the\nJoliet/Rock Ridge names derived from the HFS filenames will\nbe converted.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The existing\n<b>genisoimage</b> code will filter out any illegal\ncharacters for the ISO9660 and Joliet filenames, but as\n<b>genisoimage</b> expects to be dealing directly with Unix\nnames, it leaves the Rock Ridge names as is. But as\n&rsquo;/&rsquo; is a legal HFS filename character,\n<b>-mac-name</b> converts &rsquo;/&rsquo; to a\n&rsquo;_&rsquo; in Rock Ridge filenames.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If the Apple\nextensions are used, only the ISO9660 filenames will appear\non the Macintosh. However, as the Macintosh ISO9660 drivers\ncan use <i>Level 2</i> filenames, you can use options like\n<b>-allow-multidot</b> without problems on a Macintosh\n&mdash; still take care over the names, for example\n<i>this.file.name</i> will be converted to <i>THIS.FILE</i>\ni.e. only have one &rsquo;.&rsquo;, also filename\n<i>abcdefgh</i> will be seen as <i>ABCDEFGH</i> but\n<i>abcdefghi</i> will be seen as <i>ABCDEFGHI.</i> i.e. with\na &rsquo;.&rsquo; at the end &mdash; don&rsquo;t know if\nthis is a Macintosh problem or a\n<b>genisoimage</b>/<b>mkhybrid</b> problem. All filenames\nwill be in uppercase when viewed on a Macintosh. Of course,\nDOS/Win3.X machines will not be able to see Level 2\nfilenames...</p>\n\n<h2>HFS CUSTOM VOLUME/FOLDER ICONS\n<a name=\"HFS CUSTOM VOLUME/FOLDER ICONS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">To give a HFS\nCD a custom icon, make sure the root (top level) folder\nincludes a standard Macintosh volume icon file. To give a\nvolume a custom icon on a Macintosh, an icon has to be\npasted over the volume&rsquo;s icon in the &quot;Get\nInfo&quot; box of the volume. This creates an invisible file\ncalled <i>Icon\\r</i> (&rsquo;\\r&rsquo; is the carriage\nreturn character) in the root folder.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A custom folder\nicon is very similar &mdash; an invisible file called\n<i>Icon\\r</i> exists in the folder itself.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Probably the\neasiest way to create a custom icon that <b>genisoimage</b>\ncan use is to format a blank HFS floppy disk on a Mac and\npaste an icon to its &quot;Get Info&quot; box. If using\nLinux with the HFS module installed, mount the floppy:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">mount -t hfs\n/dev/fd0 /mnt/floppy</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The floppy will\nbe mounted as a CAP filesystem by default. Then run\n<b>genisoimage</b> using something like:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">genisoimage\n--cap -o output source_dir /mnt/floppy</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If you are not\nusing Linux, you can use <b>hfsutils</b> to copy the icon\nfile from the floppy. However, care has to be taken, as the\nicon file contains a control character. For example:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">hmount /dev/fd0\n<br>\nhdir -a <br>\nhcopy -m Icon^V^M icon_dir/icon</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Where\n&rsquo;^V^M&rsquo; is control-V followed by control-M. Then\nrun <b>genisoimage</b> by using something like:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">genisoimage\n--macbin -o output source_dir icon_dir</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The procedure\nfor creating/using custom folder icons is very similar\n&mdash; paste an icon to folder&rsquo;s &quot;Get Info&quot;\nbox and transfer the resulting <i>Icon\\r</i> file to the\nrelevant directory in the <b>genisoimage</b> source\ntree.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">You may want to\nhide the icon files from the ISO9660 and Joliet trees.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To give a\ncustom icon to a Joliet CD, follow the instructions found at\n<i>http://www.cdrfaq.org/faq03.html#S3-21-1</i>.</p>\n\n<h2>HFS BOOT DRIVER\n<a name=\"HFS BOOT DRIVER\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">It <i>may</i>\nbe possible to make the hybrid CD bootable on a\nMacintosh.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A bootable HFS\nCD requires an Apple CD-ROM (or compatible) driver, a\nbootable HFS partition and the necessary System, Finder,\netc. files.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">A driver can be\nobtained from any other Macintosh bootable CD-ROM using the\n<b>apple_driver</b> utility. This file can then be used with\n<b>-boot-hfs-file</b>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The HFS\npartition (i.e. the hybrid disk in our case) must contain a\nsuitable System Folder, again from another CD-ROM or\ndisk.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">For a partition\nto be bootable, it must have its <i>boot block</i> set. The\nboot block is in the first two blocks of a partition. For a\nnon-bootable partition the boot block is full of zeros.\nNormally, when a System file is copied to partition on a\nMacintosh disk, the boot block is filled with a number of\nrequired settings &mdash; unfortunately I don&rsquo;t know\nthe full spec for the boot block, so I&rsquo;m guessing that\nthe following will work.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Therefore, the\nutility <b>apple_driver</b> also extracts the boot block\nfrom the first HFS partition it finds on the given CD-ROM\nand this is used for the HFS partition created by\n<b>genisoimage</b>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><i>Please\nnote:</i> By using a driver from an Apple CD and copying\nApple software to your CD, you become liable to obey Apple\nComputer, Inc. Software License Agreements.</p>\n\n<h2>EL TORITO BOOT INFORMATION TABLE\n<a name=\"EL TORITO BOOT INFORMATION TABLE\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">When\n<b>-boot-info-table</b> is given, <b>genisoimage</b> will\nmodify the boot file specified by <b>-b</b> by inserting a\n56-byte <i>boot information table</i> at offset 8 in the\nfile. This modification is done in the source filesystem, so\nmake sure you use a copy if this file is not easily\nrecreated! This file contains pointers which may not be\neasily or reliably obtained at boot time.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The format of\nthis table is as follows; all integers are in section 7.3.1\n(&quot;little endian&quot;) format.</p>\n\n<p style=\"margin-left:14%; margin-top: 1em\">Offset Name\nSize Meaning</p>\n\n<table width=\"100%\" border=\"0\" rules=\"none\" frame=\"void\"\n       cellspacing=\"0\" cellpadding=\"0\">\n<tr valign=\"top\" align=\"left\">\n<td width=\"14%\"></td>\n<td width=\"1%\">\n\n\n<p>8</p></td>\n<td width=\"23%\">\n\n\n<p>bi_pvd</p></td>\n<td width=\"16%\">\n\n\n<p>4 bytes</p></td>\n<td width=\"46%\">\n\n\n<p>LBA of primary volume descriptor</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"14%\"></td>\n<td width=\"1%\">\n\n\n<p>12</p></td>\n<td width=\"23%\">\n\n\n<p>bi_file</p></td>\n<td width=\"16%\">\n\n\n<p>4 bytes</p></td>\n<td width=\"46%\">\n\n\n<p>LBA of boot file</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"14%\"></td>\n<td width=\"1%\">\n\n\n<p>16</p></td>\n<td width=\"23%\">\n\n\n<p>bi_length</p></td>\n<td width=\"16%\">\n\n\n<p>4 bytes</p></td>\n<td width=\"46%\">\n\n\n<p>Boot file length in bytes</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"14%\"></td>\n<td width=\"1%\">\n\n\n<p>20</p></td>\n<td width=\"23%\">\n\n\n<p>bi_csum</p></td>\n<td width=\"16%\">\n\n\n<p>4 bytes</p></td>\n<td width=\"46%\">\n\n\n<p>32-bit checksum</p></td></tr>\n<tr valign=\"top\" align=\"left\">\n<td width=\"14%\"></td>\n<td width=\"1%\">\n\n\n<p>24</p></td>\n<td width=\"23%\">\n\n\n<p>bi_reserved</p></td>\n<td width=\"16%\">\n\n\n<p>40 bytes</p></td>\n<td width=\"46%\">\n\n\n<p>Reserved</p></td></tr>\n</table>\n\n<p style=\"margin-left:22%; margin-top: 1em\">The 32-bit\nchecksum is the sum of all the 32-bit words in the boot file\nstarting at byte offset 64. All linear block addresses\n(LBAs) are given in CD sectors (normally 2048 bytes).</p>\n\n<h2>HPPA NOTES\n<a name=\"HPPA NOTES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">To make a\nbootable CD for HPPA, at the very least a boot loader file\n(<b>-hppa-bootloader</b>), a kernel image file (32-bit,\n64-bit, or both, depending on hardware) and a boot command\nline (<b>-hppa-cmdline</b>) must be specified. Some systems\ncan boot either a 32- or a 64-bit kernel, and the firmware\nwill choose one if both are present. Optionally, a ramdisk\ncan be used for the root filesystem using\n<b>-hppa-cmdline</b>.</p>\n\n<h2>JIGDO NOTES\n<a name=\"JIGDO NOTES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Jigdo is a tool\nto help in the distribution of large files like CD and DVD\nimages; see <i>http://atterer.org/jigdo/</i> for more\ndetails. Debian CDs and DVD ISO images are published on the\nweb in jigdo format to allow end users to download them more\nefficiently.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To create jigdo\nand template files alongside the ISO image from\n<b>genisoimage</b>, you must first generate a list of the\nfiles that will be used, in the following format:</p>\n\n<p style=\"margin-left:14%; margin-top: 1em\">MD5sum File\nsize Path <br>\n32 chars 12 chars to end of line</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The MD5sum must\nbe written in standard hexadecimal notation, the file size\nmust list the size of the file in bytes, and the path must\nlist the absolute path to the file. For example:</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">00006dcd58ff0756c36d2efae21be376\n14736 /mirror/debian/file1 <br>\n000635c69b254a1be8badcec3a8d05c1 211822 /mirror/debian/file2\n<br>\n00083436a3899a09633fc1026ef1e66e 22762\n/mirror/debian/file3</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Once you have\nthis file, call <b>genisoimage</b> with all of your normal\ncommand-line parameters. Specify the output filenames for\nthe jigdo and template files using <b>-jigdo-jigdo</b> and\n<b>-jigdo-template</b>, and pass in the location of your MD5\nlist with <b>-md5-list</b>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If there are\nfiles that you do NOT want to be added into the jigdo file\n(e.g. if they are likely to change often), specify them\nusing -jigdo-exclude. If you want to verify some of the\nfiles as they are written into the image, specify them using\n-jigdo-force-md5. If any files don&rsquo;t match,\n<b>genisoimage</b> will then abort. Both of these options\ntake regular expressions as input. It is possible to\nrestrict the set of files that will be used further based on\nsize &mdash; use the -jigdo-min-file-size option.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Finally, the\njigdo code needs to know how to map the files it is given\nonto a mirror-style configuration. Specify how to map paths\nusing <b>-jigdo-map</b>. Using <i>Debian=/mirror/debian</i>\nwill cause all paths starting with <i>/mirror/debian</i> to\nbe mapped to <i>Debian:&lt;file&gt;</i> in the output jigdo\nfile.</p>\n\n<h2>EXAMPLES\n<a name=\"EXAMPLES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">To create a\nvanilla ISO9660 filesystem image in the file <i>cd.iso</i>,\nwhere the directory <i>cd_dir</i> will become the root\ndirectory of the CD, call:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">% genisoimage\n-o cd.iso cd_dir</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To create a CD\nwith Rock Ridge extensions of the source directory\n<i>cd_dir</i>:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">% genisoimage\n-o cd.iso -R cd_dir</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To create a CD\nwith Rock Ridge extensions of the source directory\n<i>cd_dir</i> where all files have at least read permission\nand all files are owned by <i>root</i>, call:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">% genisoimage\n-o cd.iso -r cd_dir</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To write a tar\narchive directly to a CD that will later contain a simple\nISO9660 filesystem with the tar archive call:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">% tar cf - . |\ngenisoimage -stream-media-size 333000 | \\ <br>\nwodim dev=b,t,l -dao tsize=333000s -</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To create a HFS\nhybrid CD with the Joliet and Rock Ridge extensions of the\nsource directory <i>cd_dir</i>:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">% genisoimage\n-o cd.iso -R -J -hfs cd_dir</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To create a HFS\nhybrid CD from the source directory <i>cd_dir</i> that\ncontains Netatalk Apple/Unix files:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">% genisoimage\n-o cd.iso --netatalk cd_dir</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To create a HFS\nhybrid CD from the source directory <i>cd_dir</i>, giving\nall files CREATOR and TYPES based on just their filename\nextensions listed in the file &quot;mapping&quot;.:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">% genisoimage\n-o cd.iso -map mapping cd_dir</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">To create a CD\nwith the Apple Extensions to ISO9660, from the source\ndirectories <i>cd_dir</i> and <i>another_dir</i>. Files in\nall the known Apple/Unix format are decoded and any other\nfiles are given CREATOR and TYPE based on their magic number\ngiven in the file <i>magic</i>:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">% genisoimage\n-o cd.iso -apple -magic magic -probe \\ <br>\ncd_dir another_dir</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The following\nexample puts different files on the CD that all have the\nname README, but have different contents when seen as a\nISO9660/Rock Ridge, Joliet or HFS CD.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Current\ndirectory contains:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">% ls -F <br>\nREADME.hfs README.joliet README.Unix cd_dir/</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The following\ncommand puts the contents of the directory <i>cd_dir</i> on\nthe CD along with the three README files &mdash; but only\none will be seen from each of the three filesystems:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">% genisoimage\n-o cd.iso -hfs -J -r -graft-points \\ <br>\n-hide README.hfs -hide README.joliet \\ <br>\n-hide-joliet README.hfs -hide-joliet README.Unix \\ <br>\n-hide-hfs README.joliet -hide-hfs README.Unix \\ <br>\nREADME=README.hfs README=README.joliet \\ <br>\nREADME=README.Unix cd_dir</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">i.e. the file\nREADME.hfs will be seen as README on the HFS CD and the\nother two README files will be hidden. Similarly for the\nJoliet and ISO9660/Rock Ridge CD.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">There are\nprobably all sorts of strange results possible with\ncombinations of the hide options ...</p>\n\n<h2>NOTES\n<a name=\"NOTES\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>genisoimage</b>\nmay safely be installed suid root. This may be needed to\nallow <b>genisoimage</b> to read the previous session when\ncreating a multisession image.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If\n<b>genisoimage</b> is creating a filesystem image with Rock\nRidge attributes and the directory nesting level of the\nsource directory tree is too much for ISO9660,\n<b>genisoimage</b> will do deep directory relocation. This\nresults in a directory called <b>RR_MOVED</b> in the root\ndirectory of the CD. You cannot avoid this directory.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Many boot code\noptions for different platforms are mutualy exclusive\nbecause the boot blocks cannot coexist, ie. different\nplatforms share the same data locations in the image. See\nhttp://lists.debian.org/debian-cd/2006/12/msg00109.html for\ndetails.</p>\n\n<h2>BUGS\n<a name=\"BUGS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Any files that\nhave hard links to files not in the tree being copied to the\nISO9660 filesystem will have an incorrect file reference\ncount.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Does not check\nfor SUSP record(s) in &rsquo;.&rsquo; entry of the root\ndirectory to verify the existence of Rock Ridge\nenhancements. This problem is present when reading old\nsessions while adding data in multisession mode.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Does not\nproperly read relocated directories in multisession mode\nwhen adding data. Any relocated deep directory is lost if\nthe new session does not include the deep directory.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Does not re-use\n<i>RR_MOVED</i> when doing multisession from\n<i>TRANS.TBL</i>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Does not create\nwhole_name entry for <i>RR_MOVED</i> in multisession\nmode.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">There may be\nother bugs. Please, report them to the maintainers.</p>\n\n<h2>HFS PROBLEMS/LIMITATIONS\n<a name=\"HFS PROBLEMS/LIMITATIONS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">I have had to\nmake several assumptions on how I expect the modified libhfs\nroutines to work, however there may be situations that\neither I haven&rsquo;t thought of, or come across when these\nassumptions fail. Therefore I can&rsquo;t guarantee that\n<b>genisoimage</b> will work as expected (although I\nhaven&rsquo;t had a major problem yet). Most of the HFS\nfeatures work fine, but some are not fully tested. These are\nmarked as <i>Alpha</i> above.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Although HFS\nfilenames appear to support uppercase and lowercase letters,\nthe filesystem is case-insensitive, i.e., the filenames\n<i>aBc</i> and <i>AbC</i> are the same. If a file is found\nin a directory with the same HFS name, <b>genisoimage</b>\nwill attempt to make a unique name by adding &rsquo;_&rsquo;\ncharacters to one of the filenames.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">HFS\nfile/directory names that share the first 31 characters have\n&rsquo;_N&rsquo; (a decimal number) substituted for the last\nfew characters to generate unique names.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Care must be\ntaken when &quot;grafting&quot; Apple/Unix files or\ndirectories (see above for the method and syntax involved).\nIt is not possible to use a new name for an Apple/Unix\nencoded file/directory. e.g. If a Apple/Unix encoded file\ncalled <i>oldname</i> is to added to the CD, you cannot use\nthe command line:</p>\n\n<p style=\"margin-left:22%; margin-top: 1em\">genisoimage -o\noutput.raw -hfs -graft-points newname=oldname cd_dir</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>genisoimage</b>\nwill be unable to decode <i>oldname</i>. However, you can\ngraft Apple/Unix encoded files or directories as long as you\ndo not attempt to give them new names as above.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">When creating\nan HFS volume with the multisession options, <b>-M</b> and\n<b>-C</b>, only files in the last session will be in the HFS\nvolume. i.e. <b>genisoimage</b> cannot <i>add</i> existing\nfiles from previous sessions to the HFS volume.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">However, if\neach session is created with <b>-part</b>, each session will\nappear as separate volumes when mounted on a Mac. In this\ncase, it is worth using <b>-V</b> or <b>-hfs-volid</b> to\ngive each session a unique volume name, otherwise each\n&quot;volume&quot; will appear on the Desktop with the same\nname.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Symbolic links\n(as with all other non-regular files) are not added to the\nHFS directory.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Hybrid volumes\nmay be larger than pure ISO9660 volumes containing the same\ndata. In some cases (e.g. DVD sized volumes) the difference\ncan be significant. As an HFS volume gets bigger, so does\nthe allocation block size (the smallest amount of space a\nfile can occupy). For a 650MB CD, the allocation block is\n10kB, for a 4.7GB DVD it will be about 70kB.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The maximum\nnumber of files in an HFS volume is about 65500 &mdash;\nalthough the real limit will be somewhat less than this.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The resulting\nhybrid volume can be accessed on a Unix machine by using the\nhfsutils routines. However, no changes can be made to the\nvolume as it is set as <b>locked.</b> The option\n<b>-hfs-unlock</b> will create an output image that is\nunlocked &mdash; however no changes should be made to the\ncontents of the volume (unless you really know what you are\ndoing) as it&rsquo;s not a &quot;real&quot; HFS volume.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>-mac-name</b>\nwill not currently work with <b>-T</b> &mdash; the Unix name\nwill be used in the <i>TRANS.TBL</i> file, not the Macintosh\nname.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Although\n<b>genisoimage</b> does not alter the contents of a file, if\na binary file has its TYPE set as <i>TEXT</i>, it <i>may</i>\nbe read incorrectly on a Macintosh. Therefore a better\nchoice for the default TYPE may be <i>????</i>.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>-mac-boot-file</b>\nmay not work at all...</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">May not work\nwith PC Exchange v2.2 or higher files (available with MacOS\n8.1). DOS media containing PC Exchange files should be\nmounted as type <b>msdos</b> (not <b>vfat</b>) when using\nLinux.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The SFM format\nis only partially supported &mdash; see <b>HFS MACINTOSH\nFILE FORMATS</b> section above.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">It is not\npossible to use <b>-sparc-boot</b> or <b>-generic-boot</b>\nwith <b>-boot-hfs-file</b> or <b>-prep-boot</b>.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>genisoimage</b>\nshould be able to create HFS hybrid images over 4Gb,\nalthough this has not been fully tested.</p>\n\n<h2>SEE ALSO\n<a name=\"SEE ALSO\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><a href=\"https://man.page/5/genisoimagerc\">genisoimagerc(5)</a>,\n<a href=\"https://man.page/1/wodim\">wodim(1)</a>, <b>mkzftree</b>(8), <a href=\"https://man.page/5/magic\">magic(5)</a>.</p>\n\n<h2>AUTHORS\n<a name=\"AUTHORS\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>genisoimage</b>\nis derived from <b>mkisofs</b> from the <b>cdrtools\n2.01.01a08</b> package from May 2006 (with few updates\nextracted from cdrtools 2.01.01a24 from March 2007) from .IR\nhttp://cdrecord.berlios.de/ , but is now part of the\n<b>cdrkit</b> suite, maintained by Joerg Jaspert, Eduard\nBloch, Steve McIntyre, Peter Samuelson, Christian Fromme,\nBen Hutchings, and other contributors. The maintainers can\nbe contacted at\n<i>debburn-devel@lists.alioth.debian.org</i>, or see the\n<b>cdrkit</b> project web site at\n<i>http://www.cdrkit.org/</i>.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Eric Youngdale\nwrote the first versions (1993&ndash;1998) of\n<b>mkisofs</b>. J&ouml;rg Schilling wrote the SCSI transport\nlibrary and its interface, and has maintained <b>mkisofs</b>\nsince 1999. James Pearson wrote the HFS hybrid code, using\n<i>libhfs</i> by Robert Leslie. Pearson, Schilling, Jungshik\nShin and Jaakko Heinonen contributed to the character set\nconversion code. The <b>cdrkit</b> maintainers have\nmaintained <b>genisoimage</b> since 2006.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Copyright\n1993-1998 by Yggdrasil Computing, Inc. <br>\nCopyright 1996-1997 by Robert Leslie <br>\nCopyright 1997-2001 by James Pearson <br>\nCopyright 1999-2006 by J&ouml;rg Schilling <br>\nCopyright 2007 by J&ouml;rg Schilling (originating few\nupdates) <br>\nCopyright 2002-2003 by Jungshik Shin <br>\nCopyright 2003 by Jaakko Heinonen <br>\nCopyright 2006 by the Cdrkit maintainers</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If you want to\ntake part in the development of <b>genisoimage</b>, you may\njoin the <b>cdrkit</b> developer mailing list by following\nthe instructions on\n<i>http://alioth.debian.org/mail/?group_id=31006</i>. The\nemail address of the list is\n<i>debburn-devel@lists.alioth.debian.org</i>. This is also\nthe address for user support questions. Note that\n<b>cdrkit</b> and <b>cdrtools</b> are not affiliated.</p>\n\n<h2>ACKNOWLEDGEMENTS\n<a name=\"ACKNOWLEDGEMENTS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">UNIX is a\nregistered trademark of The Open Group in the US and other\ncountries.</p>\n<hr>\n","headings":["<a href=\"#NAME\">NAME</a>","<a href=\"#SYNOPSIS\">SYNOPSIS</a>","<a href=\"#DESCRIPTION\">DESCRIPTION</a>","<a href=\"#OPTIONS\">OPTIONS</a>","<a href=\"#HFS OPTIONS\">HFS OPTIONS</a>","<a href=\"#CHARACTER SETS\">CHARACTER SETS</a>","<a href=\"#HFS CREATOR/TYPE\">HFS CREATOR/TYPE</a>","<a href=\"#HFS MACINTOSH FILE FORMATS\">HFS MACINTOSH FILE FORMATS</a>","<a href=\"#HFS MACINTOSH FILENAMES\">HFS MACINTOSH FILENAMES</a>","<a href=\"#HFS CUSTOM VOLUME/FOLDER ICONS\">HFS CUSTOM VOLUME/FOLDER ICONS</a>","<a href=\"#HFS BOOT DRIVER\">HFS BOOT DRIVER</a>","<a href=\"#EL TORITO BOOT INFORMATION TABLE\">EL TORITO BOOT INFORMATION TABLE</a>","<a href=\"#HPPA NOTES\">HPPA NOTES</a>","<a href=\"#JIGDO NOTES\">JIGDO NOTES</a>","<a href=\"#EXAMPLES\">EXAMPLES</a>","<a href=\"#NOTES\">NOTES</a>","<a href=\"#BUGS\">BUGS</a>","<a href=\"#HFS PROBLEMS/LIMITATIONS\">HFS PROBLEMS/LIMITATIONS</a>","<a href=\"#SEE ALSO\">SEE ALSO</a>","<a href=\"#AUTHORS\">AUTHORS</a>","<a href=\"#ACKNOWLEDGEMENTS\">ACKNOWLEDGEMENTS</a>"]}