{"name":"pnmscalefixed","body":"\n\n<h1 align=\"center\">pnmscalefixed</h1>\n\n\n\n\n<hr>\n\n\n<h2>NAME\n<a name=\"NAME\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">pnmscalefixed -\nscale a portable anymap quickly, but less accurate</p>\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>pnmscalefixed</b>\nis the same thing as <b>pnmscale</b> except that it uses\nfixed point arithmetic internally instead of floating point,\nwhich makes it run faster. In turn, it is less accurate and\nmay distort the image.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Use the\n<b>pnmscale</b> man page with <b>pnmscalefixed</b>. This man\npage only describes the difference.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>pnmscalefixed</b>\nuses fixed point 12 bit arithmetic. By contrast,\n<b>pnmscale</b> uses floating point arithmetic which on most\nmachines is probably 24 bit precision. This makes\n<b>pnmscalefixed</b> run faster (30% faster in one\nexperiment), but the imprecision can cause distortions at\nthe right and bottom edges.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The distortion\ntakes the following form: One pixel from the edge of the\ninput is rendered larger in the output than the scaling\nfactor requires. Consequently, the rest of the image is\nsmaller than the scaling factor requires, because the\noverall dimensions of the image are always as requested.\nThis distortion will usually be very hard to see.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>pnmscalefixed</b>\nwith the <b>-verbose</b> option tells you how much\ndistortion there is.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The amount of\ndistortion depends on the size of the input image and how\nclose the scaling factor is to an integral 1/4096th.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If the scaling\nfactor is an exact multiple of 1/4096, there is no\ndistortion. So, for example doubling or halving an image\ncauses no distortion. But reducing it or enlarging it by a\nthird would cause some distortion. To consider an extreme\ncase, scaling a 100,000 row image down to 50,022 rows would\ncreate an output image with all of the input squeezed into\nthe top 50,000 rows, and the last row of the input copied\ninto the bottom 22 rows of output.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>pnmscalefixed</b>\ncould probably be modified to use 16 bit or better\narithmetic without losing anything. The modification would\nconsist of a single constant in the source code. Until there\nis a demonstrated need for that, though, the Netpbm\nmaintainer wants to keep the safety cushion afforded by the\noriginal 12 bit precision.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>pnmscalefixed</b>\ndoes not have <b>pnmscale &rsquo;s -nomix</b> option.</p>\n<hr>\n","headings":["<a href=\"#NAME\">NAME</a>","<a href=\"#DESCRIPTION\">DESCRIPTION</a>"]}