{"name":"pnmtotiff","body":"\n\n<h1 align=\"center\">pnmtotiff</h1>\n\n\n\n\n\n\n\n\n\n<hr>\n\n\n<h2>NAME\n<a name=\"NAME\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">pnmtotiff -\nconvert a portable anymap into a TIFF file</p>\n\n<h2>SYNOPSIS\n<a name=\"SYNOPSIS\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>pnmtotiff</b>\n[<b>-none</b>|<b>-packbits</b>|<b>-lzw</b>|<b>-g3</b>|<b>-g4</b>]\n[<b>-2d</b>] [<b>-fill</b>] [<b>-predictor</b> <i>n</i>]\n[<b>-msb2lsb</b>|<b>-lsb2msb</b>] [<b>-rowsperstrip</b>\n<i>n</i>] [<b>-minisblack</b>|<b>-miniswhite</b>]\n[<b>-truecolor</b>] [<b>-color</b>] [<b>-indexbits</b>\n<i>1|2|4|8</i>] [<i>pnmfile</i>]</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Minimum\nunambiguous abbreviations of options are acceptable.</p>\n\n<h2>DESCRIPTION\n<a name=\"DESCRIPTION\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Reads a PNM\nimage as input. Produces a TIFF file as output.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The output goes\nto Standard Output, which must be a seekable file. That\nmeans no pipes, but any regular file should work.</p>\n\n<h2>OPTIONS\n<a name=\"OPTIONS\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">By default,\n<b>pnmtotiff</b> creates a TIFF file with no compression.\nThis is your best bet most of the time. If you want to try\nanother compression scheme or tweak some of the other even\nmore obscure output options, there are a number of flags to\nplay with.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Actually, the\nbest default would be to use LZW compression, which is what\n<b>pnmtotiff</b> used to do by default. However, the Tiff\nlibrary no longer does LZW compression due to concerns with\nviolating Unisys&rsquo;s patent on LZW compression.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n<b>-none</b>, <b>-packbits</b>, <b>-lzw</b>, <b>-g3</b>,\n<b>-g4</b>, <b>-flate</b>, and <b>-adobeflat</b> options are\nused to override the default and set the compression scheme\nused in creating the output file. The CCITT Group 3 and\nGroup 4 compression algorithms can only be used with bilevel\ndata. <b>-lzw</b> doesn&rsquo;t really work because the Tiff\nlibrary doesn&rsquo;t do LZW compression. It used to, but\nits developers removed the function out of concern about\nviolating Unisys&rsquo;s patent. This option remains in case\nyou use a Tiff library that cooperates, now or in the\nfuture. The <b>-2d</b> and <b>-fill</b> options are\nmeaningful only with Group 3 compression: <b>-2d</b>\nrequests 2-dimensional encoding, while <b>-fill</b> requests\nthat each encoded scanline be zero-filled to a byte boundry.\nThe <b>-predictor</b> option is only meaningful with LZW\ncompression: a predictor value of 2 causes each scanline of\nthe output image to undergo horizontal differencing before\nit is encoded; a value of 1 forces each scanline to be\nencoded without differencing.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">By default,\n<b>pnmtotiff</b> creates a TIFF file with msb-to-lsb fill\norder. The <b>-msb2lsb</b> and <b>-lsb2msb</b> options are\nused to override the default and set the fill order used in\ncreating the file.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The fill order\nis the order in which pixels are packed into a byte in the\nTiff raster, in the case that there are multiple pixels per\nbyte. msb-to-lsb means that the leftmost columns go into the\nmost significant bits of the byte in the Tiff image.\nHowever, there is considerable confusion about the meaning\nof fill order. Some believe it means whether 16 bit sample\nvalues in the Tiff image are little-endian or big-endian.\nThis is totally erroneous (The endianness of integers in a\nTiff image is designated by the image&rsquo;s magic number).\nHowever, ImageMagick and older Netpbm both have been known\nto implement that interpretation. 2001.09.06.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If the image\ndoes not have sub-byte pixels, these options have no effect\nother than to set the value of the FILLORDER tag in the Tiff\nimage (which may be useful for those programs that\nmisinterpret the tag with reference to 16 bit samples).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n<b>-rowsperstrip</b> option can be used to set the number of\nrows (scanlines) in each strip of data in the output file.\nBy default, the output file has the number of rows per strip\nset to a value that will ensure each strip is no more than 8\nkilobytes long.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n<b>-minisblack</b> and <b>-miniswhite</b> option force the\noutput image to have a &quot;minimum is black&quot; or\n&quot;minimum is white&quot; photometric, respectively. If\nyou don&rsquo;t specify either, <b>pnmtotiff uses minimum is\nblack except</b> when using Group 3 or Group 4 compression,\nin which case <b>pnmtotiff</b> follows CCITT fax standards\nand uses &quot;minimum is white.&quot; This usually results\nin better compression and is generally preferred for bilevel\ncoding.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">Before February\n2001, <b>pnmtotiff</b> always produced &quot;minimum is\nblack,&quot; due to a bug. In either case, <b>pnmtotiff</b>\nsets the photometric interpretation tag in the TIFF output\naccording to which photometric is actually used.</p>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>-truecolor</b>\ntells <b>pnmtotiff</b> to produce the 24-bit RGB form of\nTIFF output if it is producing a color TIFF image. Without\nthis option, <b>pnmtotiff</b> produces a colormapped\n(paletted) 8-bit TIFF image unless there are more than 256\ncolors (and in the latter case, issues a warning).</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n<b>-truecolor</b> option can prevent <b>pnmtotiff</b> from\nmaking two passes through the input file, thus improving\nspeed and memory usage. See the section MULTIPLE PASSES.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If\n<b>pnmtotiff</b> produces a grayscale TIFF image, this\noption has no effect.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>-color</b>\ntells <b>pnmtotiff</b> to produce a color, as opposed to\ngrayscale, TIFF image if the input is PPM, even if it\ncontains only shades of gray. Without this option,\n<b>pnmtotiff</b> produces a grayscale TIFF image if the\ninput is PPM and contains only shades of gray, and at most\n256 shades. Otherwise, it produces a color TIFF output. For\nPBM and PGM input, <b>pnmtotiff</b> always produces\ngrayscale TIFF output and this option has no effect.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n<b>-color</b> option can prevent <b>pnmtotiff</b> from\nmaking two passes through the input file, thus improving\nspeed and memory usage. See the section MULTIPLE PASSES.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The\n<b>-indexbits</b> option is meaningful only for a\ncolormapped (paletted) image. In this kind of image, the\nraster contains values which are indexes into a table of\ncolors, with the indexes normally taking less space that the\ncolor description in the table. pnmtotiff can generate\nindexes of 1, 2, 4, or 8 bits. By default, it will use 8,\nbecause many programs that interpret TIFF images can&rsquo;t\nhandle any other width.</p>\n\n<h2>NOTES\n<a name=\"NOTES\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">There are\nmyriad variations of the TIFF format, and this program\ngenerates only a few of them. <b>pnmtotiff</b> creates a\ngrayscale TIFF file if its input is a PBM (monochrome) or\nPGM (grayscale) file. <b>pnmtotiff</b> also creates a\ngrayscale file if it input is PPM (color), but there is only\none color in the image. If the input is a PPM (color) file\nand there are 256 colors or fewer, but more than 1,\n<b>pnmtotiff</b> generates a color palette TIFF file. If\nthere are more colors than that, <b>pnmtotiff</b> generates\nan RGB (not RGBA) single plane TIFF file. Use\n<b>pnmtotiffcmyk</b> to generate the\ncyan-magenta-yellow-black ink color separation TIFF\nformat.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">The number of\nbits per sample in the TIFF output is determined by the\nmaxval of the PNM input. If the maxval is less than 256, the\nbits per sample in the output is the smallest number that\ncan encode the maxval. If the maxval is greater than or\nequal to 256, there are 16 bits per sample in the\noutput.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\"><b>Multiple\nPasses <br>\npnmtotiff</b> reads the input image once if it can, and\notherwise twice. It needs that second pass to analyze the\ncolors in the image and generate a color map (pallette) and\ndetermine if the image is grayscale. So the second pass only\nhappens when the input is PPM. And you can avoid it then by\nspecifying both the <b>-truecolor</b> and <b>-color</b>\noptions.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">If the input\nimage is small enough to fit in your system&rsquo;s file\ncache, the second pass is very fast. If not, it requires\nreading from disk twice, which can be slow.</p>\n\n<p style=\"margin-left:11%; margin-top: 1em\">When the input\nis from a file that cannot be rewound and reread,\n<b>pnmtotiff</b> reads the entire input image into a\ntemporary file which can, and works from that. Even if it\nonly needs one pass.</p>\n\n<h2>SEE ALSO\n<a name=\"SEE ALSO\"></a>\n</h2>\n\n\n\n<p style=\"margin-left:11%; margin-top: 1em\"><a href=\"https://man.page/1/tifftopnm\">tifftopnm(1)</a>,\n<a href=\"https://man.page/1/pnmtotiffcmyk\">pnmtotiffcmyk(1)</a>, <a href=\"https://man.page/1/pnmdepth\">pnmdepth(1)</a>,\n<a href=\"https://man.page/5/pnm\">pnm(5)</a></p>\n\n<h2>AUTHOR\n<a name=\"AUTHOR\"></a>\n</h2>\n\n\n<p style=\"margin-left:11%; margin-top: 1em\">Derived by Jef\nPoskanzer from ras2tiff.c, which is Copyright (c) 1990 by\nSun Microsystems, Inc. Author: Patrick J. Naughton\n(naughton@wind.sun.com).</p>\n<hr>\n","headings":["<a href=\"#NAME\">NAME</a>","<a href=\"#SYNOPSIS\">SYNOPSIS</a>","<a href=\"#DESCRIPTION\">DESCRIPTION</a>","<a href=\"#OPTIONS\">OPTIONS</a>","<a href=\"#NOTES\">NOTES</a>","<a href=\"#SEE ALSO\">SEE ALSO</a>","<a href=\"#AUTHOR\">AUTHOR</a>"]}